/******************************************************************************
 * System	: mgdemo
 * Computer : DOS/V
 * OS		: Microsoft Windows
 * Compiler : Microsoft Visual C++
 * Module	: Win32 Console Application
 */

/*
#Íö(EUCÈ½ÄêÍÑÊ¸»ú)
*/


#ifndef __INC_EDITMAKEFILE__
#define __INC_EDITMAKEFILE__

/******************************************************************************
 * included
 */

/******************************************************************************
 * defined
 */

/******************************************************************************
 * typedef and struct
 */

/******************************************************************************
 * extern
 */
extern int EditMakeFile(char* lpszFileName);


/*****************************************************************************/

#endif // __INC_EDITMAKEFILE__
