//----------------------------------------------------------------------------
//BP - added stdafx.h to get precompiled MGS_SysCommon.h in Windows
#include "stdafx.h"
//BP
//----------------------------------------------------------------------------
/*
	targets.c
		ターゲット処理のデータ

	2001/02/13 K.Kano
	$Id: targets.c,v 1.1.1.3 2002/11/19 11:43:24 Yoshizawa1 Exp $
 */


#include "npc_snake.h"


/* ------------------------------------------------------------------------ */
/* ------------------------------------------------------------------------ */


static int	Child_Level_Num[] = { 
	0,	/* Level 0 のターゲット数 */
	2,	/* Level 1 のターゲット数 */
	8,	/* Level 2 のターゲット数 */
	1	/* Level 3 のターゲット数 */
} ;

static int	Child_Target_Connect[] = { 
	HUMAN21_ATAMA,
	HUMAN21_MUNE,

	HUMAN21_MIGI_UDE1,
	HUMAN21_MIGI_UDE2,
	HUMAN21_HIDARI_UDE1,
	HUMAN21_HIDARI_UDE2,
	HUMAN21_MIGI_ASHI1,
	HUMAN21_MIGI_ASHI2,
	HUMAN21_HIDARI_ASHI1,
	HUMAN21_HIDARI_ASHI2,

	HUMAN21_MUNE
} ;

static FVECTOR Child_Target_Shift[] = { 
	/* level 0 は無し */
	/* level 1 */
	{ 0.0F, 30.0F, 0.0F },		/* 頭 */
	{ 100.0F, 0.0F, 100.0F },	/* 心臓 */
	/* level 2 */
	{ 0.0F, -130.0F, 0.0F },	/* 右腕１ */
	{ 0.0F, -130.0F, 0.0F },	/* 右腕２ */
	{ 0.0F, -130.0F, 0.0F },	/* 左腕１ */
	{ 0.0F, -130.0F, 0.0F },	/* 左腕２ */
	{ -10.0F, -200.0F, -10.0F },/* 右足１ */
	{ -20.0F, -250.0F, -20.0F },/* 右足２ */
	{ -10.0F, -200.0F, -10.0F },/* 左足１ */
	{ -20.0F, -250.0F, -20.0F },/* 左足２ */
	/* level 3 */
	{ 0.0F, 0.0F, 0.0F },		/* 胴体 */
} ;


static FVECTOR Child_Target_Size[] = { 
	/* level 0 は無し */
	/* level 1 */
	{ 96.0F, 130.0F, 96.0F },		/* 頭 */
	{ 50.0F, 50.0F, 50.0F },	/* 心臓 */
	/* level 2 */
	{ 75.0F, 150.0F, 75.0F },	/* 右腕１ */
	{ 75.0F, 150.0F, 75.0F },	/* 右腕２ */
	{ 75.0F, 150.0F, 75.0F },	/* 左腕１ */
	{ 75.0F, 150.0F, 75.0F },	/* 左腕２ */
	{ 85.0F, 200.0F, 120.0F },	/* 右足１ */
	{ 85.0F, 200.0F, 250.0F },	/* 右足２ */
	{ 85.0F, 200.0F, 120.0F },	/* 左足１ */
	{ 85.0F, 200.0F, 250.0F },	/* 左足２ */
	/* level 3 */
	{ 200.0F, 300.0F, 200.0F },	/* 胴体 */
} ;

/* ターゲットサイズ */
static FVECTOR SampleTrgSize[] = {
	{ 400.0F, 1000.0F, 400.0F },	/* 立ち */
	{ 1000.0F, 200.0F, 1000.0F },	/* ダウン */
	{ 250.0F, 650.0F, 250.0F },		/* しゃがみ */
	// { 700.0F, 650.0F, 700.0F },		/* しゃがみ */
	// { 250.0F, 500.0F, 200.0F },		/* しゃがみ */
	{ 400.0F, 650.0F, 1000.0F },	/* しゃがみ w14a */
	{ 200.0F, 1000.0F, 200.0F },	/* 立ちビハンド */
	// { 200.0F, 700.0F, 200.0F },	/* 立ちビハンド */
} ;

/* 引き摺りシフト */
static FVECTOR SampleDragShift[] = {
	{ 26.483F, -393.755F, 940.002F },	/* 仰向け頭16 */
	{ 0.0F, -113.487F, 291.057F },		/* 仰向け頭 */
	{ 0.0F, -421.119F, 1192.692F },		/* 仰向け足16 */
	{ 0.0F, -382.115F, 422.438F },		/* 仰向け足 */
	{ 0.0F, -346.867F, 1192.629F },		/* うつぶせ足16 */
	{ 0.0F, -294.030F, 463.501F },		/* うつぶせ足 */
	{ 45.761F, -317.266F, 946.003F },	/* うつ伏せ頭16 */
} ;

/* パンチキックの際の攻撃ターゲットのシフト、サイズ値 */
// BP FIX: added w=1.0f to each
static const FVECTOR PunchKick_Shift[]={
	{ 0.0F, -130.0F, 0.0F, 1.0f },	/* 右腕１ */
	{ 0.0F, -130.0F, 0.0F, 1.0f },	/* 右腕２ */
	{ 0.0F, -130.0F, 0.0F, 1.0f },	/* 左腕１ */
	{ 0.0F, -130.0F, 0.0F, 1.0f },	/* 左腕２ */
	{ -10.0F, -200.0F, -10.0F, 1.0f },/* 左足１ */
	{ -20.0F, -250.0F, -20.0F, 1.0f },/* 左足２ */

	{ 0.0F, 0.0F, 0.0F, 1.0f },		/* 胴体 */
};

static const FVECTOR PunchKick_Size[]={
	{ 75.0F, 150.0F, 75.0F },	/* 右腕１ */
	{ 75.0F, 150.0F, 75.0F },	/* 右腕２ */
	{ 75.0F, 150.0F, 75.0F },	/* 左腕１ */
	{ 75.0F, 150.0F, 75.0F },	/* 左腕２ */
	{ 85.0F+800.0f, 200.0F, 120.0F },	/* 左足１ */
	{ 85.0F+800.0f, 200.0F, 250.0F },	/* 左足２ */

	{ 200.0F, 300.0F, 200.0F },	/* 胴体 */
};

/* 首締めのシフト座標 */
static FVECTOR HangShift = { 6.4F, -158.0F, 246.0F } ;

/* ------------------------------------------------------------------------ */
/* ------------------------------------------------------------------------ */
