/*************************************************************************************/
//
//	写真撮影用共通プロック
//	dcam_alt.h	2002/07/11 S.Kaneyoshi
//
/*************************************************************************************/


/*************************************************************************************/
// 写真撮影用ローカル変数初期化プロック
/*************************************************************************************/
	proc 写真撮影用ローカル変数初期化プロック {
		$$b:撮影成功フラグ = 0;
		$$i:Ｘ画面位置 = 0;
		$$i:Ｙ画面位置 = 0;
		$$i:画面占有率 = 0;
		$$i:中心からの距離 = 0;
	}

/*************************************************************************************/
// 撮影成功フラグ入力
/*************************************************************************************/
	proc 撮影成功フラグ入力 $:p_値 {
		if( $$b:撮影成功フラグ < $:p_値 ) {
			print '********値入力しました:'$:p_値'***********'
			$$b:撮影成功フラグ = $:p_値;
		}
	}

/*************************************************************************************/
// 写真中心チェック
/*************************************************************************************/
	// 被写体の中心から距離を計算
	proc 写真中心チェック {
		if( $$i:Ｘ画面位置 < 0 ) {
			$$i:Ｘ画面位置 = $$i:Ｘ画面位置 * -1;
		}
		if( $$i:Ｙ画面位置 < 0 ) {
			$$i:Ｙ画面位置 = $$i:Ｙ画面位置 * -1;
		}
		
		if( $$i:Ｘ画面位置 > $$i:Ｙ画面位置 ) {
			return $$i:Ｘ画面位置;
		} else {
			return $$i:Ｙ画面位置;
		}
	}

	proc 写真中心チェックＸＹ $:p_Ｘ座標 $:p_Ｙ座標 {
		if( $$i:Ｘ画面位置 < 0 ) {
			$$i:Ｘ画面位置 = $$i:Ｘ画面位置 * -1;
		}
		if( $$i:Ｙ画面位置 < 0 ) {
			$$i:Ｙ画面位置 = $$i:Ｙ画面位置 * -1;
		}

		print 'Ｘ目標値:'$:p_Ｘ座標' Ｘ位置:'$$i:Ｘ画面位置
		print 'Ｙ目標値:'$:p_Ｙ座標' Ｙ位置:'$$i:Ｙ画面位置

		if( $$i:Ｘ画面位置 > $:p_Ｘ座標 ) {
			print 'Ｘ座標値オーバーです'
			return 0;
		} else if( $$i:Ｙ画面位置 > $:p_Ｙ座標 ) {
			print 'Ｙ座標値オーバーです'
			return 0;
		} else {
			print '座標値チェックＯＫ'
			return 1;
		}
	}

/*************************************************************************************/
// 写真中心チェック
/*************************************************************************************/
	proc 写真座標チェック $:Ｘ $:Ｙ {
		if( ( $$i:Ｘ画面位置 < $:Ｘ && $$i:Ｘ画面位置 > (-$:Ｘ) ) && \
			( $$i:Ｙ画面位置 < $:Ｙ && $$i:Ｙ画面位置 > (-$:Ｙ) ) ) {
			
			return 1;
		} else {
			return 0;
		}
	}
	
	proc グラビアチェック範囲チェック $:Ｘ $:上 $:下 {
		if( ( $$i:Ｘ画面位置 < $:Ｘ && $$i:Ｘ画面位置 > (-$:Ｘ) ) && \
			( $$i:Ｙ画面位置 < $:上 && $$i:Ｙ画面位置 > (-$:下) ) ) {
			
			return 1;
		} else {
			return 0;
		}
	}

/*************************************************************************************/
// ポスター設置
/*************************************************************************************/
	proc チェック面登録＿右 $:Ｘ $:Ｙ $:Ｚ $:p_判定プロック {
		command カメラチェック面登録 \
		-points $:Ｘ,($:Ｙ+150),($:Ｚ+150) \
				$:Ｘ,($:Ｙ+150),($:Ｚ-150) \
				$:Ｘ,($:Ｙ-150),($:Ｚ-150) \
				$:Ｘ,($:Ｙ-150),($:Ｚ+150) \
		-far 1 \
		-proc $:p_判定プロック
	}
	
	proc チェック面登録＿表 $:Ｘ $:Ｙ $:Ｚ $:p_判定プロック {
		command カメラチェック面登録 \
		-points ($:Ｘ-150),($:Ｙ-150),$:Ｚ \
				($:Ｘ-150),($:Ｙ+150),$:Ｚ \
				($:Ｘ+150),($:Ｙ+150),$:Ｚ \
				($:Ｘ+150),($:Ｙ-150),$:Ｚ \
		-far 1 \
		-proc $:p_判定プロック
	}
	
	proc チェック面登録＿裏 $:Ｘ $:Ｙ $:Ｚ $:p_判定プロック {
		command カメラチェック面登録 \
			-points ($:Ｘ+150),($:Ｙ-150),$:Ｚ \
					($:Ｘ+150),($:Ｙ+150),$:Ｚ \
					($:Ｘ-150),($:Ｙ+150),$:Ｚ \
					($:Ｘ-150),($:Ｙ-150),$:Ｚ \
			-far 1 \
			-proc $:p_判定プロック
	}

// エロ判定
	proc エロ登録＿表 $:Ｘ $:Ｙ $:Ｚ $:p_判定プロック {
		command カメラチェック面登録 \
		-points ($:Ｘ-100),($:Ｙ-50),$:Ｚ \
				($:Ｘ-100),($:Ｙ+50),$:Ｚ \
				($:Ｘ+100),($:Ｙ+50),$:Ｚ \
				($:Ｘ+100),($:Ｙ-50),$:Ｚ \
		-far 1 \
		-proc $:p_判定プロック
	}
	
	proc エロ登録＿裏 $:Ｘ $:Ｙ $:Ｚ $:p_判定プロック {
		command カメラチェック面登録 \
			-points ($:Ｘ+100),($:Ｙ-50),$:Ｚ \
					($:Ｘ+100),($:Ｙ+50),$:Ｚ \
					($:Ｘ-100),($:Ｙ+50),$:Ｚ \
					($:Ｘ-100),($:Ｙ-50),$:Ｚ \
			-far 1 \
			-proc $:p_判定プロック
	}

// ピンポイント
	proc チェック面登録ピンポイント＿表 $:Ｘ $:Ｙ $:Ｚ $:p_判定プロック {
		command カメラチェック面登録 \
		-points ($:Ｘ-25),($:Ｙ-25),$:Ｚ \
				($:Ｘ-25),($:Ｙ+25),$:Ｚ \
				($:Ｘ+25),($:Ｙ+25),$:Ｚ \
				($:Ｘ+25),($:Ｙ-25),$:Ｚ \
		-far 1 \
		-proc $:p_判定プロック
	}
	
	proc チェック面登録ピンポイント＿裏 $:Ｘ $:Ｙ $:Ｚ $:p_判定プロック {
		command カメラチェック面登録 \
			-points ($:Ｘ+25),($:Ｙ-25),$:Ｚ \
					($:Ｘ+25),($:Ｙ+25),$:Ｚ \
					($:Ｘ-25),($:Ｙ+25),$:Ｚ \
					($:Ｘ-25),($:Ｙ-25),$:Ｚ \
			-far 1 \
			-proc $:p_判定プロック
	}
/*************************************************************************************/
// デバッグ用
/*************************************************************************************/
	proc ２Ｄ用写真判定プリント文 $:値 {
		#if d:DEBUG_PRINT
			print ''
			if( $:値 == 4 ) {
				print 'ＯＫ'
			} else if( $:値 == 3 ) {
				print '遠すぎる'
			} else if( $:値 == 2 ) {
				print '当たりがあって見えない'
			} else if( $:値 == 1 ) {
				print '近すぎる'
			} else {
				print 'ＮＧ'
			}
			print ''
		#endif
	}
	
	proc 写真判定プリント文 $:値 {
		#if d:DEBUG_PRINT
			print 'Ｘ画面位置' $$i:Ｘ画面位置
			print 'Ｙ画面位置' $$i:Ｙ画面位置
			print '画面占有率' $$i:画面占有率
			print '$1'$:値
		#endif
	}
