			//敵兵１ (51)
			t:vc041000,t:vc041000_len,	//0「初めてプレイヤーを発見」127f 26
			t:vc041001,t:vc041001_len,	//1「初めてプレイヤーを発見２」166f 34
			t:vc041003,t:vc041003_len,	//2「プレイヤーを発見」
			t:vc041004,t:vc041004_len,	//3「プレイヤーを発見２」
			t:vc041007,t:vc041007_len,	//4「不意にプレイヤーを発見」
			t:vc04100a,t:vc04100a_len,	//5「駆け込み連絡」
			t:vc04100b,t:vc04100b_len,	//6「ダメージを受けた」
			t:vc04100d,t:vc04100d_len,	//7「ホールドアップさせられた」146
			t:vc04100f,t:vc04100f_len,	//8「銃でダメージを受けた」
			t:vc041010,t:vc041010_len,	//9「仲間の死体を発見」
			t:vc041011,t:vc041011_len,	//a「仲間の死体を発見２」
			t:vc041013,t:vc041013_len,	//b「仲間が攻撃を受けた」
			t:vc041014,t:vc041014_len,	//c「仲間が攻撃を受けた２」
			t:vc041017,t:vc041017_len,	//d「侵入の痕跡を発見」
			t:vc04101e,t:vc04101e_len,	//e「警備の補充を頼む」
			t:vc04101b,t:vc04101b_len,	//f「了解」
			t:vc04101d,t:vc04101d_len,	//10「応答のなかった隊員は発見できず・・・
			t:vc040000,t:vc040000_len,	//11「配置に戻れ！警備を強化しろ！」
			t:vc041029,t:vc041029_len,	//12「異常なし」

			t:vc041101,t:vc041101_len,	//13「音がした？」
			t:vc041102,t:vc041102_len,	//14「音がした？（回避）」
			t:vc041103,t:vc041103_len,	//15「足音がした？」
			t:vc041104,t:vc041104_len,	//16「足音がした？（回避）」
			t:vc041105,t:vc041105_len,	//17「壊れている……」
			t:vc041106,t:vc041106_len,	//18「この本は！？」
			t:vc041107,t:vc041107_len,	//19「足跡がある……」
			t:vc041108,t:vc041108_len,	//1a「足跡がある……（回避）」
			t:vc041109,t:vc041109_len,	//1b「血の跡だ」
			t:vc041110,t:vc041110_len,	//1c「血の跡だ（回避）」
			t:vc041111,t:vc041111_len,	//1d「誰だ？」
			t:vc041112,t:vc041112_len,	//1e「誰だ？（回避）」
			t:vc041113,t:vc041113_len,	//1f「大丈夫か？」
			t:vc041114,t:vc041114_len,	//20「大丈夫か？（回避）」
			t:vc041115,t:vc041115_len,	//21「やられたのか？」
			t:vc041116,t:vc041116_len,	//22「やられたのか？（回避）」
			t:vc041117,t:vc041117_len,	//23「この箱は？」
			t:vc041119,t:vc041119_len,	//24「この箱は？（回避）」
			t:vc041117,t:vc041117_len,	//25「あの箱は？」
			t:vc041119,t:vc041119_len,	//26「あの箱は？（回避）」
			t:vc041121,t:vc041121_len,	//27「お前、ちょっと待て」
			t:vc041124,t:vc041124_len,	//28「お前、ちょっと待て（回避）」
			t:vc041122,t:vc041122_len,	//29「武器はどうした？」
			t:vc041125,t:vc041125_len,	//2a「武器はどうした？（回避）」
			t:vc041128,t:vc041128_len,	//2b「なんだその武器は？」
			t:vc041131,t:vc041131_len,	//2c「なんだその武器は？（回避）」
			t:vc041140,t:vc041140_len,	//2d「その血はどうした？」
			t:vc041144,t:vc041144_len,	//2e「その血はどうした？（回避）」
			t:vc041148,t:vc041148_len,	//2f「お前、何をしてる？」
			t:vc041151,t:vc041151_len,	//30「お前、何をしてる？（回避）」
			t:vc041203,t:vc041203_len,	//31「異常は無い（寝言）」
			t:vc041015,t:vc041015_len,	//32「敵がどこかにいる。探し出せ」
			t:vc041036,t:vc041036_len,	//33「う、はわわ」
			t:vc041037,t:vc041037_len,	//34「撃つ気か？はわわ」
			t:vc041038,t:vc041038_len,	//35「やるならやれ、はわわ」
			t:vc041134,t:vc041134_len,	//36「お前、何故ここにいる」
			t:vc041137,t:vc041137_len,	//37「お前、何故ここにいる（回避）」

			//敵兵２ (51)
			t:vc042000,t:vc042000_len,	//「初めてプレイヤーを発見」
			t:vc042001,t:vc042001_len,	//「初めてプレイヤーを発見２」
			t:vc042003,t:vc042003_len,	//「プレイヤーを発見」
			t:vc042004,t:vc042004_len,	//「プレイヤーを発見２」
			t:vc042007,t:vc042007_len,	//「不意にプレイヤーを発見」
			t:vc04200a,t:vc04200a_len,	//「駆け込み連絡」
			t:vc04200b,t:vc04200b_len,	//「ダメージを受けた」
			t:vc04200d,t:vc04200d_len,	//「ホールドアップさせられた」 146
			t:vc04200f,t:vc04200f_len,	//「銃でダメージを受けた」
			t:vc042010,t:vc042010_len,	//「仲間の死体を発見」
			t:vc042011,t:vc042011_len,	//「仲間の死体を発見２」
			t:vc042013,t:vc042013_len,	//「仲間が攻撃を受けた」
			t:vc042014,t:vc042014_len,	//「仲間が攻撃を受けた２」
			t:vc042017,t:vc042017_len,	//「侵入の痕跡を発見」
			t:vc04201e,t:vc04201e_len,	//e「警備の補充を頼む」
			t:vc04201b,t:vc04201b_len,	//「了解」
			t:vc04201d,t:vc04201d_len,	//「応答のなかった隊員は発見で・・・」
			t:vc040001,t:vc040001_len,	//「配置に戻れ！気を抜くな！」
			t:vc042029,t:vc042029_len,	//「異常なし」

			t:vc042101,t:vc042101_len,	//13「音がした？」
			t:vc042102,t:vc042102_len,	//14「音がした？（回避）」
			t:vc042103,t:vc042103_len,	//15「足音がした？」
			t:vc042104,t:vc042104_len,	//16「足音がした？（回避）」
			t:vc042105,t:vc042105_len,	//17「壊れている……」
			t:vc042106,t:vc042106_len,	//18「この本は！？」
			t:vc042107,t:vc042107_len,	//19「足跡がある……」
			t:vc042108,t:vc042108_len,	//1a「足跡がある……（回避）」
			t:vc042109,t:vc042109_len,	//1b「血の跡だ」
			t:vc042110,t:vc042110_len,	//1c「血の跡だ（回避）」
			t:vc042111,t:vc042111_len,	//1d「誰だ？」
			t:vc042112,t:vc042112_len,	//1e「誰だ？（回避）」
			t:vc042113,t:vc042113_len,	//1f「大丈夫か？」
			t:vc042114,t:vc042114_len,	//20「大丈夫か？（回避）」
			t:vc042115,t:vc042115_len,	//21「やられたのか？」
			t:vc042116,t:vc042116_len,	//22「やられたのか？（回避）」
			t:vc042117,t:vc042117_len,	//23「この箱は？」
			t:vc042119,t:vc042119_len,	//24「この箱は？（回避）」
			t:vc042118,t:vc042118_len,	//25「あの箱は？」
			t:vc042120,t:vc042120_len,	//26「あの箱は？（回避）」
			t:vc042121,t:vc042121_len,	//27「お前、ちょっと待て」
			t:vc042124,t:vc042124_len,	//28「お前、ちょっと待て（回避）」
			t:vc042122,t:vc042122_len,	//29「武器はどうした？」
			t:vc042125,t:vc042125_len,	//2a「武器はどうした？（回避）」
			t:vc042128,t:vc042128_len,	//2b「なんだその武器は？」
			t:vc042131,t:vc042131_len,	//2c「なんだその武器は？（回避）」
			t:vc042140,t:vc042140_len,	//2d「その血はどうした？」
			t:vc042144,t:vc042144_len,	//2e「その血はどうした？（回避）」
			t:vc042148,t:vc042148_len,	//2f「お前、何をしてる？」
			t:vc042151,t:vc042151_len,	//30「お前、何をしてる？（回避）」
			t:vc042203,t:vc042203_len,	//31「異常は無い（寝言）」
			t:vc04201a,t:vc04201a_len,	//32「敵は近くにいるぞ。気をつけろ」
			t:vc042036,t:vc042036_len,	//33「う、はわわ」
			t:vc042037,t:vc042037_len,	//34「撃つ気か？はわわ」
			t:vc042038,t:vc042038_len,	//35「やるならやれ、はわわ」
			t:vc042134,t:vc042134_len,	//36「お前、何故ここにいる」
			t:vc042137,t:vc042137_len,	//37「お前、何故ここにいる（回避）」

			//敵兵３ (51)
			t:vc043000,t:vc043000_len,	//「初めてプレイヤーを発見」
			t:vc043001,t:vc043001_len,	//「初めてプレイヤーを発見２」
			t:vc043003,t:vc043003_len,	//「プレイヤーを発見」
			t:vc043004,t:vc043004_len,	//「プレイヤーを発見２」
			t:vc043007,t:vc043007_len,	//「不意にプレイヤーを発見」
			t:vc04300a,t:vc04300a_len,	//「駆け込み連絡」
			t:vc04300b,t:vc04300b_len,	//「ダメージを受けた」
			t:vc04300d,t:vc04300d_len,	//「ホールドアップさせられた」 146
			t:vc04300f,t:vc04300f_len,	//「銃でダメージを受けた」
			t:vc043010,t:vc043010_len,	//「仲間の死体を発見」
			t:vc043012,t:vc043012_len,	//「仲間の死体を発見２」
			t:vc043013,t:vc043013_len,	//「仲間が攻撃を受けた」
			t:vc043014,t:vc043014_len,	//「仲間が攻撃を受けた２」
			t:vc043017,t:vc043017_len,	//「侵入の痕跡を発見」
			t:vc04301e,t:vc04301e_len,	//e「警備の補充を頼む」
			t:vc04301b,t:vc04301b_len,	//「了解」
			t:vc04301d,t:vc04301d_len,	//「連絡が途絶えた隊員はいなかった・・・」
			t:vc040002,t:vc040002_len,	//「配置に戻れ！警戒強化だ！」
			t:vc043029,t:vc043029_len,	//「異常なし」

			t:vc043101,t:vc043101_len,	//13「音がした？」
			t:vc043102,t:vc043102_len,	//14「音がした？（回避）」
			t:vc043103,t:vc043103_len,	//15「足音がした？」
			t:vc043104,t:vc043104_len,	//16「足音がした？（回避）」
			t:vc043105,t:vc043105_len,	//17「壊れている……」
			t:vc043106,t:vc043106_len,	//18「この本は！？」
			t:vc043107,t:vc043107_len,	//19「足跡がある……」
			t:vc043108,t:vc043108_len,	//1a「足跡がある……（回避）」
			t:vc043109,t:vc043109_len,	//1b「血の跡だ」
			t:vc043110,t:vc043110_len,	//1c「血の跡だ（回避）」
			t:vc043111,t:vc043111_len,	//1d「誰だ？」
			t:vc043112,t:vc043112_len,	//1e「誰だ？（回避）」
			t:vc043113,t:vc043113_len,	//1f「大丈夫か？」
			t:vc043114,t:vc043114_len,	//20「大丈夫か？（回避）」
			t:vc043115,t:vc043115_len,	//21「やられたのか？」
			t:vc043116,t:vc043116_len,	//22「やられたのか？（回避）」
			t:vc043117,t:vc043117_len,	//23「この箱は？」
			t:vc043119,t:vc043119_len,	//24「この箱は？（回避）」
			t:vc043117,t:vc043117_len,	//25「あの箱は？」
			t:vc043119,t:vc043119_len,	//26「あの箱は？（回避）」
			t:vc043121,t:vc043121_len,	//27「お前、ちょっと待て」
			t:vc043124,t:vc043124_len,	//28「お前、ちょっと待て（回避）」
			t:vc043122,t:vc043122_len,	//29「武器はどうした？」
			t:vc043125,t:vc043125_len,	//2a「武器はどうした？（回避）」
			t:vc043128,t:vc043128_len,	//2b「なんだその武器は？」
			t:vc043131,t:vc043131_len,	//2c「なんだその武器は？（回避）」
			t:vc043140,t:vc043140_len,	//2d「その血はどうした？」
			t:vc043144,t:vc043144_len,	//2e「その血はどうした？（回避）」
			t:vc043148,t:vc043148_len,	//2f「お前、何をしてる？」
			t:vc043151,t:vc043151_len,	//30「お前、何をしてる？（回避）」
			t:vc043203,t:vc043203_len,	//31「異常は無い（寝言）」
			t:vc043017,t:vc043017_len,	//32「気をつけろやつはこのエリアにいる」
			t:vc043036,t:vc043036_len,	//33「う、はわわ」
			t:vc043037,t:vc043037_len,	//34「撃つ気か？はわわ」
			t:vc043038,t:vc043038_len,	//35「やるならやれ、はわわ」
			t:vc043134,t:vc043134_len,	//36「お前、何故ここにいる」
			t:vc043137,t:vc043137_len,	//37「お前、何故ここにいる（回避）」

			//敵兵４ (51)
			t:vc044000,t:vc044000_len,	//「初めてプレイヤーを発見」
			t:vc044001,t:vc044001_len,	//「初めてプレイヤーを発見２」
			t:vc044004,t:vc044004_len,	//「プレイヤーを発見」
			t:vc044005,t:vc044005_len,	//「プレイヤーを発見２」
			t:vc044007,t:vc044007_len,	//「不意にプレイヤーを発見」
			t:vc04400a,t:vc04400a_len,	//「駆け込み連絡」
			t:vc04400b,t:vc04400b_len,	//「ダメージを受けた」
			t:vc04400e,t:vc04400e_len,	//「ホールドアップさせられた」 146
			t:vc04400f,t:vc04400f_len,	//「銃でダメージを受けた」
			t:vc044010,t:vc044010_len,	//「仲間の死体を発見」
			t:vc044012,t:vc044012_len,	//「仲間の死体を発見２」
			t:vc044013,t:vc044013_len,	//「仲間が攻撃を受けた」
			t:vc044016,t:vc044016_len,	//「仲間が攻撃を受けた２」
			t:vc044017,t:vc044017_len,	//「侵入の痕跡を発見」
			t:vc04401e,t:vc04401e_len,	//e「警備の補充を頼む」
			t:vc04401b,t:vc04401b_len,	//「了解」
			t:vc04401d,t:vc04401d_len,	//「応答のなかった隊員は発見できず・・・」
			t:vc040002,t:vc040002_len,	//「配置に戻れ！警戒強化だ！」
			t:vc044029,t:vc044029_len,	//「異常なし」

			t:vc044101,t:vc044101_len,	//13「音がした？」
			t:vc044102,t:vc044102_len,	//14「音がした？（回避）」
			t:vc044103,t:vc044103_len,	//15「足音がした？」
			t:vc044104,t:vc044104_len,	//16「足音がした？（回避）」
			t:vc044105,t:vc044105_len,	//17「壊れている……」
			t:vc044106,t:vc044106_len,	//18「この本は！？」
			t:vc044107,t:vc044107_len,	//19「足跡がある……」
			t:vc044108,t:vc044108_len,	//1a「足跡がある……（回避）」
			t:vc044109,t:vc044109_len,	//1b「血の跡だ」
			t:vc044110,t:vc044110_len,	//1c「血の跡だ（回避）」
			t:vc044111,t:vc044111_len,	//1d「誰だ？」
			t:vc044112,t:vc044112_len,	//1e「誰だ？（回避）」
			t:vc044113,t:vc044113_len,	//1f「大丈夫か？」
			t:vc044114,t:vc044114_len,	//20「大丈夫か？（回避）」
			t:vc044115,t:vc044115_len,	//21「やられたのか？」
			t:vc044116,t:vc044116_len,	//22「やられたのか？（回避）」
			t:vc044117,t:vc044117_len,	//23「この箱は？」
			t:vc044119,t:vc044119_len,	//24「この箱は？（回避）」
			t:vc044118,t:vc044118_len,	//25「あの箱は？」
			t:vc044119,t:vc044119_len,	//26「あの箱は？（回避）」
			t:vc044121,t:vc044121_len,	//27「お前、ちょっと待て」
			t:vc044124,t:vc044124_len,	//28「お前、ちょっと待て（回避）」
			t:vc044122,t:vc044122_len,	//29「武器はどうした？」
			t:vc044125,t:vc044125_len,	//2a「武器はどうした？（回避）」
			t:vc044128,t:vc044128_len,	//2b「なんだその武器は？」
			t:vc044131,t:vc044131_len,	//2c「なんだその武器は？（回避）」
			t:vc044140,t:vc044140_len,	//2d「その血はどうした？」
			t:vc044144,t:vc044144_len,	//2e「その血はどうした？（回避）」
			t:vc044148,t:vc044148_len,	//2f「お前、何をしてる？」
			t:vc044151,t:vc044151_len,	//30「お前、何をしてる？（回避）」
			t:vc044203,t:vc044203_len,	//31「異常は無い（寝言）」
			t:vc04401a,t:vc04401a_len,	//32「やつは近くにいるようだ油断するな」
			t:vc044036,t:vc044036_len,	//33「う、はわわ」
			t:vc044037,t:vc044037_len,	//34「撃つ気か？はわわ」
			t:vc044038,t:vc044038_len,	//35「やるならやれ、はわわ」
			t:vc044134,t:vc044134_len,	//36「お前、何故ここにいる」
			t:vc044137,t:vc044137_len,	//37「お前、何故ここにいる（回避）」
