/*
	enevoice.h
	    敵兵音声集

	2000/07/12 H.Yoshiike
	$Id: enevoice.h,v 1.33 2002/10/02 05:22:15 usr01749 Exp $
*/

resource ene_tank_voice {
	01:
		$t{
#include "enedefvox.h"
#include "eneslvox.h"	/* 訛り無し */
			//その他	15	51*4*2=408
			t:vc040000,t:vc040000_len,	//0「配置に戻れ、警備を強化しろ」
			t:vc040003,t:vc040003_len,	//1「了解、応援を回す」
			t:vc040004,t:vc040004_len,	//2「了解、増援を送る」
			t:vc040005,t:vc040005_len,	//3「わかった。至急応援部隊を派遣する」
			t:vc040006,t:vc040006_len,	//4「攻撃チーム現場へ向え、警戒チーム各自持ち場を離れるな」
			t:vc040033,t:vc040033_len,	//5「了解エンジンルーム、2名増員1名ずつ左右の～」
			t:vc040062,t:vc040062_len,	//6「定時連絡はどうした？」
			t:vc040493,t:vc040493_len,	//7「攻撃チーム配置に戻れ、警戒チーム引き続き警戒せよ」
			t:vc040063,t:vc040063_len,	//8「状況を報告せよ」
			t:vc040072,t:vc040072_len,	//9「引き続き警戒せよ！」
			t:vc040065,t:vc040065_len,	//a「どうした、応答しろ！」
			t:vc040066,t:vc040066_len,	//b「どうしたんだ」
			t:vc040067,t:vc040067_len,	//c「何があった」
			t:vc040100,t:vc040100_len,	//d「おい、寝ているのか！？起きろ！！」
			t:vc040484,t:vc040484_len,	//e「至急調査に向え」
			t:vc040008,t:vc040008_len,	//「増援は出せない。現状の戦力で対処せよ！」
			
			-1
		}

//攻撃兵のみのステージ
	02:
		$t{
#include "enedefvox.h"
#include "eneslvox.h"	/* 訛り無し */
			//その他	15	51*4*2=408
			t:vc040000,t:vc040000_len,	//「配置に戻れ、警備を強化しろ」
			t:vc040003,t:vc040003_len,	//「了解、応援を回す」
			t:vc040004,t:vc040004_len,	//「了解、増援を送る」
			t:vc040005,t:vc040005_len,	//「わかった。至急応援部隊を派遣する」
		t:vc040494,t:vc040494_len,	//「了解、攻撃チーム現場へ向え」
			t:vc040033,t:vc040033_len,	//「了解、エンジンルーム、2名増員、1名ずつ左右の～」
			t:vc040062,t:vc040062_len,	//6「定時連絡はどうした？」
		t:vc040496,t:vc040496_len,	//「攻撃チーム配置に戻れ」
			t:vc040063,t:vc040063_len,	//「状況を報告せよ」
			t:vc040072,t:vc040072_len,	//「引き続き警戒せよ！」
			t:vc040065,t:vc040065_len,	//「どうした、応答しろ！」
			t:vc040066,t:vc040066_len,	//「どうしたんだ」
			t:vc040067,t:vc040067_len,	//「何があった」
			t:vc040100,t:vc040100_len,	//d「おい、寝ているのか！？起きろ！！」
			t:vc040484,t:vc040484_len,	//e「至急調査に向え」
			t:vc040008,t:vc040008_len,	//「増援は出せない。現状の戦力で対処せよ！」
			
			-1
		}

//警備兵のみのステージ
	03:
		$t{
#include "enedefvox.h"	/* 訛り有り （こっちがデフォルト）*/
#include "eneslvox.h"	/* 訛り無し */
			//その他	14	51*4*2=408
		t:vc040002,t:vc040002_len,	//「配置に戻れ、警備強化だ」
			t:vc040003,t:vc040003_len,	//「了解、応援を回す」
			t:vc040004,t:vc040004_len,	//「了解、増援を送る」
			t:vc040005,t:vc040005_len,	//「わかった。至急応援部隊を派遣する」
		t:vc040008,t:vc040008_len,	//「増援は出せない。現状の戦力で対処せよ！」
//			t:vc040033,t:vc040033_len,	//「了解、エンジンルーム、2名増員、1名ずつ左右の～」
			t:vc046601,t:vc046601_len,	//5「了解、総員警戒を強化せよ」
			t:vc040062,t:vc040062_len,	//6「定時連絡はどうした？」
		t:vc040001,t:vc040001_len,	//「配置に戻れ、気を抜くな」
			t:vc040063,t:vc040063_len,	//「状況を報告せよ」
			t:vc040072,t:vc040072_len,	//「引き続き警戒せよ！」
			t:vc040065,t:vc040065_len,	//「どうした、応答しろ！」
			t:vc040066,t:vc040066_len,	//「どうしたんだ」
			t:vc040067,t:vc040067_len,	//「何があった」
			t:vc040100,t:vc040100_len,	//d「おい、寝ているのか！？起きろ！！」
			t:vc040484,t:vc040484_len,	//e「至急調査に向え」
			t:vc040008,t:vc040008_len,	//「増援は出せない。現状の戦力で対処せよ！」

			-1
		}

//警備兵のみステージ２
	04:
		$t{
#include "enedefvox.h"	/* 訛り有り （こっちがデフォルト）*/
#include "eneslvox.h"	/* 訛り無し */
			//その他	14	51*4*2=408
		t:vc040002,t:vc040002_len,	//「配置に戻れ、警備強化だ」
//		t:vc040601,t:vc040601_len,	//「了解。総員、警戒を強化せよ」
			t:vc040003,t:vc040003_len,	//「了解、応援を回す」
			t:vc040004,t:vc040004_len,	//「了解、増援を送る」
			t:vc040005,t:vc040005_len,	//「わかった。至急応援部隊を派遣する」
		t:vc040009,t:vc040009_len,	//「了解。敵を殲滅せよ！」
			t:vc040033,t:vc040033_len,	//「了解、エンジンルーム、2名増員、1名ずつ左右の～」
			t:vc040062,t:vc040062_len,	//6「定時連絡はどうした？」
		t:vc040602,t:vc040602_len,	//「総員、配置に戻れ」
			t:vc040063,t:vc040063_len,	//「状況を報告せよ」
			t:vc040072,t:vc040072_len,	//「引き続き警戒せよ！」
			t:vc040065,t:vc040065_len,	//「どうした、応答しろ！」
			t:vc040066,t:vc040066_len,	//「どうしたんだ」
			t:vc040067,t:vc040067_len,	//「何があった」
			t:vc040100,t:vc040100_len,	//d「おい、寝ているのか！？起きろ！！」
			t:vc040484,t:vc040484_len,	//e「至急調査に向え」
			t:vc040008,t:vc040008_len,	//「増援は出せない。現状の戦力で対処せよ！」

			-1
		}

//攻撃兵がいるのに警戒モードで攻撃兵が追加されないステージ
	06:
		$t{
#include "enedefvox.h"	/* 訛り有り （こっちがデフォルト）*/
#include "eneslvox.h"	/* 訛り無し */
			//その他	14	51*4*2=408
			t:vc040000,t:vc040000_len,	//0「配置に戻れ、警備を強化しろ」
			t:vc040003,t:vc040003_len,	//1「了解、応援を回す」
			t:vc040004,t:vc040004_len,	//2「了解、増援を送る」
			t:vc040005,t:vc040005_len,	//3「わかった。至急応援部隊を派遣する」
			t:vc040006,t:vc040006_len,	//4「攻撃チーム現場へ向え、警戒チーム各自持ち場を離れるな」
			t:vc046601,t:vc046601_len,	//5「了解、総員警戒を強化せよ」
			t:vc040062,t:vc040062_len,	//6「定時連絡はどうした？」
			t:vc040001,t:vc040001_len,	//7「配置に戻れ、気を抜くな」
			t:vc040063,t:vc040063_len,	//8「状況を報告せよ」
			t:vc040072,t:vc040072_len,	//9「引き続き警戒せよ！」
			t:vc040065,t:vc040065_len,	//a「どうした、応答しろ！」
			t:vc040066,t:vc040066_len,	//b「どうしたんだ」
			t:vc040067,t:vc040067_len,	//c「何があった」
			t:vc040100,t:vc040100_len,	//d「おい、寝ているのか！？起きろ！！」
			t:vc040484,t:vc040484_len,	//e「至急調査に向え」
			t:vc040008,t:vc040008_len,	//「増援は出せない。現状の戦力で対処せよ！」

			-1
		}


}


resource ene_plant_voice {
	01:
		$t{
#include "enedefvox.h"
#include "eneslvox.h"	/* 訛り無し */
			//その他	15	51*4*2=408
			t:vc049000,t:vc049000_len,	//0「配置に戻れ、警備を強化しろ」
			t:vc049003,t:vc049003_len,	//1「了解、応援を回す」
			t:vc049004,t:vc049004_len,	//2「了解、増援を送る」
			t:vc049005,t:vc049005_len,	//3「わかった。至急応援部隊を派遣する」
			t:vc049006,t:vc049006_len,	//4「攻撃チーム現場へ向え、警戒チーム各自持ち場を離れるな」
			t:vc040033,t:vc040033_len,	//5「了解エンジンルーム、2名増員1名ずつ左右の～」
			t:vc049062,t:vc049062_len,	//6「定時連絡はどうした？」
			t:vc040493,t:vc040493_len,	//7「攻撃チーム配置に戻れ、警戒チーム引き続き警戒せよ」
			t:vc049063,t:vc049063_len,	//8「状況を報告せよ」
			t:vc049072,t:vc049072_len,	//9「引き続き警戒せよ！」
			t:vc049065,t:vc049065_len,	//a「どうした、応答しろ！」
			t:vc049066,t:vc049066_len,	//b「どうしたんだ」
			t:vc049067,t:vc049067_len,	//c「何があった」
			t:vc040100,t:vc040100_len,	//d「おい、寝ているのか！？起きろ！！」
			t:vc040484,t:vc040484_len,	//e「至急調査に向え」
			t:vc049008,t:vc049008_len,	//「増援は出せない。現状の戦力で対処せよ！」
			
			-1
		}

//攻撃兵のみのステージ
	02:
		$t{
#include "enedefvox.h"
#include "eneslvox.h"	/* 訛り無し */
			//その他	15	51*4*2=408
			t:vc049000,t:vc049000_len,	//「配置に戻れ、警備を強化しろ」
			t:vc049003,t:vc049003_len,	//「了解、応援を回す」
			t:vc049004,t:vc049004_len,	//「了解、増援を送る」
			t:vc049005,t:vc049005_len,	//「わかった。至急応援部隊を派遣する」
		t:vc040494,t:vc040494_len,	//「了解、攻撃チーム現場へ向え」
			t:vc040033,t:vc040033_len,	//「了解、エンジンルーム、2名増員、1名ずつ左右の～」
			t:vc049062,t:vc049062_len,	//6「定時連絡はどうした？」
		t:vc040496,t:vc040496_len,	//「攻撃チーム配置に戻れ」
			t:vc049063,t:vc049063_len,	//「状況を報告せよ」
			t:vc049072,t:vc049072_len,	//「引き続き警戒せよ！」
			t:vc049065,t:vc049065_len,	//「どうした、応答しろ！」
			t:vc049066,t:vc049066_len,	//「どうしたんだ」
			t:vc049067,t:vc049067_len,	//「何があった」
			t:vc040100,t:vc040100_len,	//d「おい、寝ているのか！？起きろ！！」
			t:vc040484,t:vc040484_len,	//e「至急調査に向え」
			t:vc049008,t:vc049008_len,	//「増援は出せない。現状の戦力で対処せよ！」
			
			-1
		}

//警備兵のみのステージ
	03:
		$t{
#include "enedefvox.h"	/* 訛り有り （こっちがデフォルト）*/
#include "eneslvox.h"	/* 訛り無し */
			//その他	14	51*4*2=408
		t:vc049002,t:vc049002_len,	//「配置に戻れ、警備強化だ」
			t:vc049003,t:vc049003_len,	//「了解、応援を回す」
			t:vc049004,t:vc049004_len,	//「了解、増援を送る」
			t:vc049005,t:vc049005_len,	//「わかった。至急応援部隊を派遣する」
		t:vc049008,t:vc049008_len,	//「増援は出せない。現状の戦力で対処せよ！」
//			t:vc040033,t:vc040033_len,	//「了解、エンジンルーム、2名増員、1名ずつ左右の～」
			t:vc046601,t:vc046601_len,	//5「了解、総員警戒を強化せよ」
			t:vc049062,t:vc049062_len,	//6「定時連絡はどうした？」
		t:vc049001,t:vc049001_len,	//「配置に戻れ、気を抜くな」
			t:vc049063,t:vc049063_len,	//「状況を報告せよ」
			t:vc049072,t:vc049072_len,	//「引き続き警戒せよ！」
			t:vc049065,t:vc049065_len,	//「どうした、応答しろ！」
			t:vc049066,t:vc049066_len,	//「どうしたんだ」
			t:vc049067,t:vc049067_len,	//「何があった」
			t:vc040100,t:vc040100_len,	//d「おい、寝ているのか！？起きろ！！」
			t:vc040484,t:vc040484_len,	//e「至急調査に向え」
			t:vc049008,t:vc049008_len,	//「増援は出せない。現状の戦力で対処せよ！」

			-1
		}

//警備兵のみステージ２
	04:
		$t{
#include "enedefvox.h"	/* 訛り有り （こっちがデフォルト）*/
#include "eneslvox.h"	/* 訛り無し */
			//その他	14	51*4*2=408
		t:vc049002,t:vc049002_len,	//「配置に戻れ、警備強化だ」
//		t:vc040601,t:vc040601_len,	//「了解。総員、警戒を強化せよ」
			t:vc049003,t:vc049003_len,	//「了解、応援を回す」
			t:vc049004,t:vc049004_len,	//「了解、増援を送る」
			t:vc049005,t:vc049005_len,	//「わかった。至急応援部隊を派遣する」
		t:vc049009,t:vc049009_len,	//「了解。敵を殲滅せよ！」
			t:vc040033,t:vc040033_len,	//「了解、エンジンルーム、2名増員、1名ずつ左右の～」
			t:vc049062,t:vc049062_len,	//6「定時連絡はどうした？」
		t:vc040602,t:vc040602_len,	//「総員、配置に戻れ」
			t:vc049063,t:vc049063_len,	//「状況を報告せよ」
			t:vc049072,t:vc049072_len,	//「引き続き警戒せよ！」
			t:vc049065,t:vc049065_len,	//「どうした、応答しろ！」
			t:vc049066,t:vc049066_len,	//「どうしたんだ」
			t:vc049067,t:vc049067_len,	//「何があった」
			t:vc040100,t:vc040100_len,	//d「おい、寝ているのか！？起きろ！！」
			t:vc040484,t:vc040484_len,	//e「至急調査に向え」
			t:vc049008,t:vc049008_len,	//「増援は出せない。現状の戦力で対処せよ！」

			-1
		}

//指揮官なしステージ
	05:
		$t{
#include "enedefvox.h"	/* 訛り有り （こっちがデフォルト）*/
#include "eneslvox.h"	/* 訛り無し */
			//その他	14	51*4*2=408
			t:vc040510,t:vc040510_len,	//「配置に戻れ、警備強化だ」
			t:vc040510,t:vc040510_len,	//「了解、応援を回す」
			t:vc040510,t:vc040510_len,	//「了解、増援を送る」
			t:vc040510,t:vc040510_len,	//「わかった。至急応援部隊を派遣する」
			t:vc040510,t:vc040510_len,	//「増援は出せない。現状の戦力で対処せよ！」
			t:vc040510,t:vc040510_len,	//「了解、エンジンルーム、2名増員、1名ずつ左右の～」
			t:vc040510,t:vc040510_len,	//6「定時連絡はどうした？」
			t:vc040510,t:vc040510_len,	//「配置に戻れ、気を抜くな」
			t:vc040510,t:vc040510_len,	//「状況を報告せよ」
			t:vc040510,t:vc040510_len,	//「引き続き警戒せよ！」
			t:vc040510,t:vc040510_len,	//「どうした、応答しろ！」
			t:vc040510,t:vc040510_len,	//「どうしたんだ」
			t:vc040510,t:vc040510_len,	//「何があった」
			t:vc040510,t:vc040510_len,	//d「おい、寝ているのか！？起きろ！！」
			t:vc040510,t:vc040510_len,	//e「至急調査に向え」
			t:vc040510,t:vc040510_len,	//f「増援は出せない。現状の戦力で対処せよ！」

			-1
		}

//攻撃兵がいるのに警戒モードで攻撃兵が追加されないステージ
	06:
		$t{
#include "enedefvox.h"	/* 訛り有り （こっちがデフォルト）*/
#include "eneslvox.h"	/* 訛り無し */
			//その他	14	51*4*2=408
			t:vc049000,t:vc049000_len,	//0「配置に戻れ、警備を強化しろ」
			t:vc049003,t:vc049003_len,	//1「了解、応援を回す」
			t:vc049004,t:vc049004_len,	//2「了解、増援を送る」
			t:vc049005,t:vc049005_len,	//3「わかった。至急応援部隊を派遣する」
			t:vc049006,t:vc049006_len,	//4「攻撃チーム現場へ向え、警戒チーム各自持ち場を離れるな」
			t:vc046601,t:vc046601_len,	//5「了解、総員警戒を強化せよ」
			t:vc049062,t:vc049062_len,	//6「定時連絡はどうした？」
			t:vc049001,t:vc049001_len,	//「配置に戻れ、気を抜くな」
			t:vc049063,t:vc049063_len,	//「状況を報告せよ」
			t:vc049072,t:vc049072_len,	//「引き続き警戒せよ！」
			t:vc049065,t:vc049065_len,	//「どうした、応答しろ！」
			t:vc049066,t:vc049066_len,	//「どうしたんだ」
			t:vc049067,t:vc049067_len,	//「何があった」
			t:vc040100,t:vc040100_len,	//d「おい、寝ているのか！？起きろ！！」
			t:vc040484,t:vc040484_len,	//e「至急調査に向え」
			t:vc049008,t:vc049008_len,	//「増援は出せない。現状の戦力で対処せよ！」

			-1
		}

}


/*
// 危険モードの司令官音声。エリア別。
resource ghq_area_alert_voice {
	w01a:
		$t{
			// PLAREA0 左舷
			t:vc04000e,	//「了解。バックアップは船橋一階左舷へ向かえ」
			t:vc04000f,	//「応援部隊、左舷に向かえ。奴を逃がすな！」
			-2,

			// PLAREA1 右舷
			t:vc04000c,	//「了解。船橋一階居住区に応援部隊を派遣する。右舷を固めろ」
			t:vc04000d,	//「わかった。応援部隊、右舷に向かえ！。奴を追い込むんだ！」
			-1
		}
}

// 警戒モードの司令官音声。警戒態勢別。
resource ghq_caution_voice {
	w01a:
		$t{
			t:vc040035,	//「了解。一階居住区を増員。右舷警備を固めろ」
			t:vc040036,	//「わかった。右舷に増員。警戒を強化せよ！」
			t:vc040037,	//「了解。船橋一階左舷を増員する。警戒を強化しろ」
			t:vc040038,	//「船橋一階居住区を増員。左舷警備を固めろ」
			-2,	// 連絡が途絶えたときの確認要請台詞
			t:vc040069, //「船橋一階居住区との連絡が途絶えた」
			-3, // カメラ系が異常を発見したときの確認要請台詞
			t:vc040504, //「・・・で異常発生。至急確認に向かえ」
			-1
		}
}
*/

resource ene_vr_voice {
	01:
		$t{
#include "enevrvox.h"
#include "enevrvox.h"
#include "enevrvox.h"
#include "enevrvox.h"
#include "enevrvox.h"	/* 訛り無し有りは関係無し。台詞は１種類 */
#include "enevrvox.h"	/* 訛り無し有りは関係無し。台詞は１種類 */
#include "enevrvox.h"	/* 訛り無し有りは関係無し。台詞は１種類 */
#include "enevrvox.h"	/* 訛り無し有りは関係無し。台詞は１種類 */
			//その他	15	51*4*2=408
			t:vc046000,t:vc046000_len,	//0「配置に戻れ、警備を強化しろ」
			t:vc046003,t:vc046003_len,	//1「了解、応援を回す」
			t:vc046004,t:vc046004_len,	//2「了解、増援を送る」
			t:vc046005,t:vc046005_len,	//3「わかった。至急応援部隊を派遣する」
			t:vc046006,t:vc046006_len,	//4「攻撃チーム現場へ向え、警戒チーム各自持ち場を離れるな」
			t:vc046601,t:vc046601_len,	//5「了解、総員警戒を強化せよ」
			t:vc046062,t:vc046062_len,	//6「定時連絡はどうした？」
			t:vc046602,t:vc046602_len,	//7「総員、配置に戻れ」
			t:vc046063,t:vc046063_len,	//8「状況を報告せよ」
			t:vc046072,t:vc046072_len,	//9「引き続き警戒せよ！」
			t:vc046065,t:vc046065_len,	//a「どうした、応答しろ！」
			t:vc046066,t:vc046066_len,	//b「どうしたんだ」
			t:vc046067,t:vc046067_len,	//c「何があった」
			t:vc046100,t:vc046100_len,	//d「おい、寝ているのか！？起きろ！！」
			t:vc046484,t:vc046484_len,	//e「至急調査に向え」
			t:vc046008,t:vc046008_len,	//「増援は出せない。現状の戦力で対処せよ！」
			
			-1
		}
}
