/*
	ファイル名		mcwarning_j.rsc
	作成日			2001/07/12
	作者			K.Kano
	説明			起動直後に出るメモリーカード警告メッセージ
					ZOEのソースからそのまま持ってきた
	$Id: mcwarning_j.rsc,v 1.4 2001/10/04 19:46:07 usr01363 Exp $
*/

resource メモリーカード警告メッセージ {
// 0
空き無し:
	//'メモリーカード(PS2)に|'
	//'空き容量が足りません|'
	//'セーブファイルの保存には、|'
	//'?キロバイト以上の|'
	//'空き容量が必要です|'
	//'このままゲームを開始しますか？'
	'メモリーカード(PS2)に空き容量が|'
	'足りません。セーブファイルの保存には、|'
	'?キロバイト以上の空き容量が必要です。|'
	'このままゲームを開始しますか？'

// 1
カード無し:
	//'メモリーカード(PS2)が|'
	//'ささっていません|'
	//'セーブファイルの保存には、|'
	//'?キロバイト以上の|'
	//'空き容量が必要です|'
	//'このままゲームを開始しますか？'
	'メモリーカード(PS2)がささっていません。|'
	'セーブファイルの保存には、|'
	'?キロバイト以上の空き容量が必要です。|'
	'このままゲームを開始しますか？'

// 2
エラー:
	//'メモリーカード(PS2)検出で|'
	//'エラーが発生しました|'
	//'セーブファイルの保存には、|'
	//'?キロバイト以上の|'
	//'空き容量が必要です|'
	//'このままゲームを開始しますか？'
	'メモリーカード(PS2)検出でエラーが発生|'
	'しました。セーブファイルの保存には、|'
	'?キロバイト以上の空き容量が必要です。|'
	'このままゲームを開始しますか？'

// 3
はい:
	'はい'

// 4
いいえ:
	'いいえ'
};
