/*
	ファイル名		pre_story1_j.rsc
	作成日			2001/08/07
	作者			S.Kaneyoshi
	$Id: pre_story1_j.rsc,v 1.6 2002/06/11 04:18:23 usr04761 Exp $
*/

/*****************************************************************************/
// コラム
/*****************************************************************************/

resource コラム日本 {
ページ01:
'　'
'　'
'　'
'　　　　　　「シャドーモセスの真実」'
'　　　　　著者：ナスターシャ・ロマネンコ'
'　　　　　評者：ジョージ・フランクリン'

ページ02:
'世の中には人間の好奇心を刺激してやまない話題が'
'無数にある。'
'ケネディ暗殺にまつわる陰謀、ロズウェル事件……。'
'そして今また新たな話題が登場した。'
'本書「シャドーモセスの真実」。'
'二年前のシャドーモセス事件を扱った「衝撃のノン'
'フィクション」である。'

ページ03:
'アラスカ、フォックス諸島沖に位置するシャドー'
'モセス島の核兵器廃棄所を極右系テロリストが占拠。'
'連邦刑務所に投獄された仲間の解放を要求したが'
'事件は軍特殊部隊の突入によって速やかに収拾され'
'た。これが世に言われている「シャドーモセス事件」'
'のあらましである。'
'しかし、＃｛核緊急捜索チーム、ＮＥＳＴ｝＃のアドバイザーとして'
'自ら事件に関わったと言う＃｛著者、ナスターシャ｝＃は、それらを政府内'
'一部勢力による隠蔽工作であるとし、本書でその'
'「真実」を明らかにしようと試みる。'

ページ04:
'著者によればシャドーモセス島は単なる核兵器廃棄'
'所ではなく、陸軍の秘密演習場であったという。'
'そこで極秘裏に開発されていたのが核搭載二足歩行'
'戦車“メタルギア＃｛ＲＥＸ、レックス｝＃”。'
'あらゆる地表面から「見えない核攻撃」（レール'
'ガン技術を応用）の実行を可能とし、世界の軍事的'
'パワーバランスを一変させる驚異の新兵器だった。'
'そして「シャドーモセス事件」とは、この悪魔を'
'奪わんとした「合衆国最強」の「影の特殊部隊」'
'＃｛ＦＯＸＨＯＵＮＤ、フォックスハウンド｝＃の＃｛蜂起、ほうき｝＃であったという。'


ページ05:
'この危機に際し、政府は元＃｛ＦＯＸＨＯＵＮＤ、フォックスハウンド｝＃隊員'
'“ソリッド・スネーク”を召還、シャドーモセス島'
'への単独潜入作戦を敢行させた。'
'“スネーク”は作戦を指揮する“キャンベル大佐”'
'＃｛ＦＯＸＨＯＵＮＤ、フォックスハウンド｝＃の＃｛医療担当、メディカルスタッフ｝＃“ナオミ”、新型レーダー'
'の開発者“メイ・リン”（１０代の女性！）'
'そして著者本人らによる無線支援を受け、シャドー'
'モセス島に潜入。島内に監禁されていたメタルギア'
'＃｛ＲＥＸ、レックス｝＃の開発者“オタコン”らの協力を得て、メタル'
'ギア＃｛ＲＥＸ、レックス｝＃を破壊した……。'

ページ06:
'特に興味を惹かれたのが＃｛ＦＯＸＨＯＵＮＤ、フォックスハウンド｝＃のメンバーで'
'あり“シャラシャーシカ”の異名を持つリボルバー'
'式拳銃の達人“リボルバー・オセロット”が、“ゴ'
'ルルコビッチ大佐”なる人物率いるロシアの私兵軍'
'隊と繋がりを持っており、その部隊との合流を目論'
'んでいたというくだりだ。合衆国内に核を手にした'
'大武装集団が！　まさに未曾有の危機だ。さらに著'
'者はこの事件自体が政府内一部勢力によって仕組ま'
'れた陰謀だったとすら示唆している。何とも刺激的'
'な話ではないか？'

ページ07:
'政府は本書の内容が事実無根であることを公式に表'
'明しているが、ネット上には著者の主張を裏付ける'
'目撃談等も多数登場しており、論議を呼びつつある。'
'もしもあなたがパーティーで話題に詰まるのを怖れ'
'るなら、その時のために本書を一読しておくのもい'
'いかもしれない。天気の話をするより歓迎される事'
'は確かだ。'
'　'
'ＮＹミラー紙 書評コラム'
'　　「話題にしたい本」より抜粋'

};
