/*
	ファイル名		savegame_j.rsc
	作成日			2001/10/22
	作者			K.Kano
	説明			セーブの際に出るメッセージ
					ZOEのソースからそのまま持ってきた
	$Id: savegame_j.rsc,v 1.3 2002/07/05 04:37:20 usr03692 Exp $
*/

// サブスタンス用にリソース名を変更した。

resource セーブゲームリソース日本語 {
// 0:
メモリーカードが見つからなかった:
	'メモリーカード(PS2)が見つかりません'

// 1:
空き容量が足りない:
	'メモリーカード(PS2)の空き容量が足りません'

// 2:
新規確認:
	'新規にデータをセーブします|' \
	'よろしいですか？'

// 3:
上書き確認:
	'データを上書きセーブします|' \
	'よろしいですか？'

// 4:
フォーマット確認:
	'メモリーカード(PS2)はフォーマットされていません|' \
	'メモリーカード(PS2)をフォーマットして|' \
	'セーブします よろしいですか？'

// 5:
ファイルセーブ:
	'ファイルのセーブ中'

// 6:
フォーマット:
	'フォーマット中'

// 7:
成功:
	'ファイルのセーブが終了しました'

// 8:
失敗:
	'ファイルのセーブ中にエラーが発生しました'

// 9:
新規確認2:
	'新規にデータをセーブします。よろしいですか？'

// 10:
上書き確認2:
	'データを上書きセーブします。よろしいですか？'

// 11:
フォーマット失敗:
	'フォーマット中にエラーが発生しました'

// 12
はい:
	'Yes'

// 13
いいえ:
	'No'
};
