/*
	tales_window.h
	    スネークテイルズ小目的説明ウィンドウのふぁいるるん

	2002/08/06 T.Fukushima
	$Id: tales_window.h,v 1.9 2002/08/20 08:32:13 usr03005 Exp $


*/


#include "tales_comment_j.rsc"
#include "tales_comment_e.rsc"
#include "tales_comment_g.rsc"
#include "tales_comment_f.rsc"
#include "tales_comment_i.rsc"
#include "tales_comment_s.rsc"
#include "tales_comment_k.rsc"

proc テイルズＶＲウィンドウ設定 $:p_リソース日 $:p_リソース英 $:p_リソース独 $:p_リソース仏 $:p_リソース伊 $:p_リソース西 $:p_リソース韓 $:p_テイルズ番号 {
	chara ＶＲウィンドウ テイルズ用ＶＲウィンドウ様 \
		-message $:p_リソース日 $:p_リソース英 $:p_リソース仏 $:p_リソース独 $:p_リソース伊 $:p_リソース西 $:p_リソース韓 \
		-snake_tales $:p_テイルズ番号
}

proc テイルズＶＲウィンドウセット＿ゴルルゴン戦中 {
				@テイルズＶＲウィンドウ設定 \
					[テイルズ＿独り言__j:E_ゴルルゴン戦中] \
					[テイルズ＿独り言__e:E_ゴルルゴン戦中] \
					[テイルズ＿独り言__g:E_ゴルルゴン戦中] \
					[テイルズ＿独り言__f:E_ゴルルゴン戦中] \
					[テイルズ＿独り言__i:E_ゴルルゴン戦中] \
					[テイルズ＿独り言__s:E_ゴルルゴン戦中] \
					[テイルズ＿独り言__k:E_ゴルルゴン戦中] \
					4
}

proc テイルズＶＲウィンドウセット {
print 'ごりごりむにゃばっちょあ'
	switch ( $b:tales_story_no ){
		// テイルズＡ
		case(d:TALES_NO:A) {
			if( $b:tales_story_a < d:TALES_A:エイムズ遭遇中 ){
				if($s:エリア == "a22a"){
					@テイルズＶＲウィンドウ設定 \
						[テイルズ＿独り言__j:A_エイムズ会うまで＿Ｆ脚] \
						[テイルズ＿独り言__e:A_エイムズ会うまで＿Ｆ脚] \
						[テイルズ＿独り言__g:A_エイムズ会うまで＿Ｆ脚] \
						[テイルズ＿独り言__f:A_エイムズ会うまで＿Ｆ脚] \
						[テイルズ＿独り言__i:A_エイムズ会うまで＿Ｆ脚] \
						[テイルズ＿独り言__s:A_エイムズ会うまで＿Ｆ脚] \
						[テイルズ＿独り言__k:A_エイムズ会うまで＿Ｆ脚] \
						0
				}else {
					@テイルズＶＲウィンドウ設定 \
						[テイルズ＿独り言__j:A_エイムズ会うまで] \
						[テイルズ＿独り言__e:A_エイムズ会うまで] \
						[テイルズ＿独り言__g:A_エイムズ会うまで] \
						[テイルズ＿独り言__f:A_エイムズ会うまで] \
						[テイルズ＿独り言__e:A_エイムズ会うまで] \
						[テイルズ＿独り言__s:A_エイムズ会うまで] \
						[テイルズ＿独り言__k:A_エイムズ会うまで] \
						0
				}

			}else {
				if(!$f:テイルズＡファットマンに会ったフラグ) {
					if($b:tales_story_a < d:TALES_A:ジェニファー遭遇中){
						//人質部屋はいる前
						if(!$f:テイルズＡ人質部屋１回来たフラグ){
							@テイルズＶＲウィンドウ設定 \
								[テイルズ＿独り言__j:A_エイムズ会った後人質部屋前] \
								[テイルズ＿独り言__e:A_エイムズ会った後人質部屋前] \
								[テイルズ＿独り言__g:A_エイムズ会った後人質部屋前] \
								[テイルズ＿独り言__f:A_エイムズ会った後人質部屋前] \
								[テイルズ＿独り言__i:A_エイムズ会った後人質部屋前] \
								[テイルズ＿独り言__s:A_エイムズ会った後人質部屋前] \
								[テイルズ＿独り言__k:A_エイムズ会った後人質部屋前] \
								0

						//人質部屋入った後
						}else {
							//人質部屋内
							if($s:エリア == "a24c"){
								//マイクある
								if($w:武器弾数Ｒ[ d:武器:マイク ] >= 1 ){
									@テイルズＶＲウィンドウ設定 \
										[テイルズ＿独り言__j:A_人質部屋内＿マイクあり] \
										[テイルズ＿独り言__e:A_人質部屋内＿マイクあり] \
										[テイルズ＿独り言__g:A_人質部屋内＿マイクあり] \
										[テイルズ＿独り言__f:A_人質部屋内＿マイクあり] \
										[テイルズ＿独り言__i:A_人質部屋内＿マイクあり] \
										[テイルズ＿独り言__s:A_人質部屋内＿マイクあり] \
										[テイルズ＿独り言__k:A_人質部屋内＿マイクあり] \
										0
								//マイクなしし
								}else {
									@テイルズＶＲウィンドウ設定 \
										[テイルズ＿独り言__j:A_人質部屋内＿マイクなし] \
										[テイルズ＿独り言__e:A_人質部屋内＿マイクなし] \
										[テイルズ＿独り言__g:A_人質部屋内＿マイクなし] \
										[テイルズ＿独り言__f:A_人質部屋内＿マイクなし] \
										[テイルズ＿独り言__i:A_人質部屋内＿マイクなし] \
										[テイルズ＿独り言__s:A_人質部屋内＿マイクなし] \
										[テイルズ＿独り言__k:A_人質部屋内＿マイクなし] \
										0
								}

							}else {
								@テイルズＶＲウィンドウ設定 \
									[テイルズ＿独り言__j:A_人質部屋後人質部屋外] \
									[テイルズ＿独り言__e:A_人質部屋後人質部屋外] \
									[テイルズ＿独り言__g:A_人質部屋後人質部屋外] \
									[テイルズ＿独り言__f:A_人質部屋後人質部屋外] \
									[テイルズ＿独り言__i:A_人質部屋後人質部屋外] \
									[テイルズ＿独り言__s:A_人質部屋後人質部屋外] \
									[テイルズ＿独り言__k:A_人質部屋後人質部屋外] \
									0
							}
						}

					}else if( (d:TALES_A:ジェニファー遭遇中 <= $b:tales_story_a) && \
								($b:tales_story_a < d:TALES_A:爆弾解体後) ){
						@テイルズＶＲウィンドウ設定 \
							[テイルズ＿独り言__j:A_ジェニファー後爆弾無線前] \
							[テイルズ＿独り言__e:A_ジェニファー後爆弾無線前] \
							[テイルズ＿独り言__g:A_ジェニファー後爆弾無線前] \
							[テイルズ＿独り言__f:A_ジェニファー後爆弾無線前] \
							[テイルズ＿独り言__i:A_ジェニファー後爆弾無線前] \
							[テイルズ＿独り言__s:A_ジェニファー後爆弾無線前] \
							[テイルズ＿独り言__k:A_ジェニファー後爆弾無線前] \
							0

					}else {
						@テイルズＶＲウィンドウ設定 \
							[テイルズ＿独り言__j:A_爆弾無線後ファットマン前] \
							[テイルズ＿独り言__e:A_爆弾無線後ファットマン前] \
							[テイルズ＿独り言__g:A_爆弾無線後ファットマン前] \
							[テイルズ＿独り言__f:A_爆弾無線後ファットマン前] \
							[テイルズ＿独り言__i:A_爆弾無線後ファットマン前] \
							[テイルズ＿独り言__s:A_爆弾無線後ファットマン前] \
							[テイルズ＿独り言__k:A_爆弾無線後ファットマン前] \
							0
					}


				//ファットマソ戦中
				}else{
					//いきなりファットマソ
					if( $b:tales_story_a < d:TALES_A:爆弾解体後 ){
						@テイルズＶＲウィンドウ設定 \
							[テイルズ＿独り言__j:A_爆弾未処理ファットマン戦中] \
							[テイルズ＿独り言__e:A_爆弾未処理ファットマン戦中] \
							[テイルズ＿独り言__g:A_爆弾未処理ファットマン戦中] \
							[テイルズ＿独り言__f:A_爆弾未処理ファットマン戦中] \
							[テイルズ＿独り言__i:A_爆弾未処理ファットマン戦中] \
							[テイルズ＿独り言__s:A_爆弾未処理ファットマン戦中] \
							[テイルズ＿独り言__k:A_爆弾未処理ファットマン戦中] \
							0
					//爆弾解体済み
					}else {
						@テイルズＶＲウィンドウ設定 \
							[テイルズ＿独り言__j:A_爆弾処理済みファットマン戦中] \
							[テイルズ＿独り言__e:A_爆弾処理済みファットマン戦中] \
							[テイルズ＿独り言__g:A_爆弾処理済みファットマン戦中] \
							[テイルズ＿独り言__f:A_爆弾処理済みファットマン戦中] \
							[テイルズ＿独り言__i:A_爆弾処理済みファットマン戦中] \
							[テイルズ＿独り言__s:A_爆弾処理済みファットマン戦中] \
							[テイルズ＿独り言__k:A_爆弾処理済みファットマン戦中] \
							0
					}
				}
			}

		}

		//テイルズＢ
		case(d:TALES_NO:B) {
			if( $b:tales_story_b < d:TALES_B:エマ遭遇前) {
					@テイルズＶＲウィンドウ設定 \
						[テイルズ＿独り言__j:B_立ち聞き前] \
						[テイルズ＿独り言__e:B_立ち聞き前] \
						[テイルズ＿独り言__g:B_立ち聞き前] \
						[テイルズ＿独り言__f:B_立ち聞き前] \
						[テイルズ＿独り言__i:B_立ち聞き前] \
						[テイルズ＿独り言__s:B_立ち聞き前] \
						[テイルズ＿独り言__k:B_立ち聞き前] \
						1

			}else if( (d:TALES_B:エマ遭遇前 <= $b:tales_story_b) && \
						($b:tales_story_b < d:TALES_B:エマ遭遇中) ){
					@テイルズＶＲウィンドウ設定 \
						[テイルズ＿独り言__j:B_立ち聞き後＿エマ接触前] \
						[テイルズ＿独り言__e:B_立ち聞き後＿エマ接触前] \
						[テイルズ＿独り言__g:B_立ち聞き後＿エマ接触前] \
						[テイルズ＿独り言__f:B_立ち聞き後＿エマ接触前] \
						[テイルズ＿独り言__i:B_立ち聞き後＿エマ接触前] \
						[テイルズ＿独り言__s:B_立ち聞き後＿エマ接触前] \
						[テイルズ＿独り言__k:B_立ち聞き後＿エマ接触前] \
						1

			}else if( (d:TALES_B:エマ遭遇中 <= $b:tales_story_b) && \
						($b:tales_story_b < d:TALES_B:敵兵倒し中) ){
					@テイルズＶＲウィンドウ設定 \
						[テイルズ＿独り言__j:B_エマ接触後＿敵兵ラッシュ中] \
						[テイルズ＿独り言__e:B_エマ接触後＿敵兵ラッシュ中] \
						[テイルズ＿独り言__g:B_エマ接触後＿敵兵ラッシュ中] \
						[テイルズ＿独り言__f:B_エマ接触後＿敵兵ラッシュ中] \
						[テイルズ＿独り言__i:B_エマ接触後＿敵兵ラッシュ中] \
						[テイルズ＿独り言__s:B_エマ接触後＿敵兵ラッシュ中] \
						[テイルズ＿独り言__k:B_エマ接触後＿敵兵ラッシュ中] \
						1

			}else if( (d:TALES_B:敵兵倒し中 <= $b:tales_story_b) && \
						($b:tales_story_b < d:TALES_B:Ｂ脚ノードアクセス中) ){
					@テイルズＶＲウィンドウ設定 \
						[テイルズ＿独り言__j:B_敵兵ラッシュ後＿ノード前] \
						[テイルズ＿独り言__e:B_敵兵ラッシュ後＿ノード前] \
						[テイルズ＿独り言__g:B_敵兵ラッシュ後＿ノード前] \
						[テイルズ＿独り言__f:B_敵兵ラッシュ後＿ノード前] \
						[テイルズ＿独り言__i:B_敵兵ラッシュ後＿ノード前] \
						[テイルズ＿独り言__s:B_敵兵ラッシュ後＿ノード前] \
						[テイルズ＿独り言__k:B_敵兵ラッシュ後＿ノード前] \
						1

			}else if( (d:TALES_B:Ｂ脚ノードアクセス中 <= $b:tales_story_b) && \
						($b:tales_story_b < d:TALES_B:エマ再会中) ){
				if($s:エリア == "a22b"){
					@テイルズＶＲウィンドウ設定 \
						[テイルズ＿独り言__j:B_ノード後＿再会前＿Ｆ脚内] \
						[テイルズ＿独り言__e:B_ノード後＿再会前＿Ｆ脚内] \
						[テイルズ＿独り言__g:B_ノード後＿再会前＿Ｆ脚内] \
						[テイルズ＿独り言__f:B_ノード後＿再会前＿Ｆ脚内] \
						[テイルズ＿独り言__i:B_ノード後＿再会前＿Ｆ脚内] \
						[テイルズ＿独り言__s:B_ノード後＿再会前＿Ｆ脚内] \
						[テイルズ＿独り言__k:B_ノード後＿再会前＿Ｆ脚内] \
						1
				}else {
					@テイルズＶＲウィンドウ設定 \
						[テイルズ＿独り言__j:B_ノード後＿再会前＿Ｆ脚以外] \
						[テイルズ＿独り言__e:B_ノード後＿再会前＿Ｆ脚以外] \
						[テイルズ＿独り言__g:B_ノード後＿再会前＿Ｆ脚以外] \
						[テイルズ＿独り言__f:B_ノード後＿再会前＿Ｆ脚以外] \
						[テイルズ＿独り言__i:B_ノード後＿再会前＿Ｆ脚以外] \
						[テイルズ＿独り言__s:B_ノード後＿再会前＿Ｆ脚以外] \
						[テイルズ＿独り言__k:B_ノード後＿再会前＿Ｆ脚以外] \
						1
				}

			}else if( (d:TALES_B:エマ再会中 <= $b:tales_story_b) && \
						($b:tales_story_b < d:TALES_B:Ｅ脚戻り中) ){
					@テイルズＶＲウィンドウ設定 \
						[テイルズ＿独り言__j:B_再会後＿Ｅ脚前] \
						[テイルズ＿独り言__e:B_再会後＿Ｅ脚前] \
						[テイルズ＿独り言__g:B_再会後＿Ｅ脚前] \
						[テイルズ＿独り言__f:B_再会後＿Ｅ脚前] \
						[テイルズ＿独り言__i:B_再会後＿Ｅ脚前] \
						[テイルズ＿独り言__s:B_再会後＿Ｅ脚前] \
						[テイルズ＿独り言__k:B_再会後＿Ｅ脚前] \
						1

			}else if( (d:TALES_B:Ｅ脚戻り中 <= $b:tales_story_b) && \
						($b:tales_story_b < d:TALES_B:Ｅ脚脱出中) ){
					@テイルズＶＲウィンドウ設定 \
						[テイルズ＿独り言__j:B_Ｅ脚脱出中] \
						[テイルズ＿独り言__e:B_Ｅ脚脱出中] \
						[テイルズ＿独り言__g:B_Ｅ脚脱出中] \
						[テイルズ＿独り言__f:B_Ｅ脚脱出中] \
						[テイルズ＿独り言__i:B_Ｅ脚脱出中] \
						[テイルズ＿独り言__s:B_Ｅ脚脱出中] \
						[テイルズ＿独り言__k:B_Ｅ脚脱出中] \
						1

			}else {
					@テイルズＶＲウィンドウ設定 \
						[テイルズ＿独り言__j:B_ハリアー戦中] \
						[テイルズ＿独り言__e:B_ハリアー戦中] \
						[テイルズ＿独り言__g:B_ハリアー戦中] \
						[テイルズ＿独り言__f:B_ハリアー戦中] \
						[テイルズ＿独り言__i:B_ハリアー戦中] \
						[テイルズ＿独り言__s:B_ハリアー戦中] \
						[テイルズ＿独り言__k:B_ハリアー戦中] \
						1
			}
		}

		//テイルズＣ
		case(d:TALES_NO:C) {
			if( $b:tales_story_c < d:TALES_C:メリル遭遇終了 ){
				@テイルズＶＲウィンドウ設定 \
					[テイルズ＿独り言__j:C_艦橋メリル前] \
					[テイルズ＿独り言__e:C_艦橋メリル前] \
					[テイルズ＿独り言__g:C_艦橋メリル前] \
					[テイルズ＿独り言__f:C_艦橋メリル前] \
					[テイルズ＿独り言__i:C_艦橋メリル前] \
					[テイルズ＿独り言__s:C_艦橋メリル前] \
					[テイルズ＿独り言__k:C_艦橋メリル前] \
					2

			}else if( (d:TALES_C:メリル遭遇終了 <= $b:tales_story_c) && \
						($b:tales_story_c < d:TALES_C:長廊下で攻撃された終了) ){
				@テイルズＶＲウィンドウ設定 \
					[テイルズ＿独り言__j:C_艦橋メリル後＿長廊下戦前] \
					[テイルズ＿独り言__e:C_艦橋メリル後＿長廊下戦前] \
					[テイルズ＿独り言__g:C_艦橋メリル後＿長廊下戦前] \
					[テイルズ＿独り言__f:C_艦橋メリル後＿長廊下戦前] \
					[テイルズ＿独り言__i:C_艦橋メリル後＿長廊下戦前] \
					[テイルズ＿独り言__s:C_艦橋メリル後＿長廊下戦前] \
					[テイルズ＿独り言__k:C_艦橋メリル後＿長廊下戦前] \
					2

			}else if( (d:TALES_C:長廊下で攻撃された終了 <= $b:tales_story_c) && \
						($b:tales_story_c < d:TALES_C:長廊下戦終了 ) ){
				@テイルズＶＲウィンドウ設定 \
					[テイルズ＿独り言__j:C_長廊下戦中] \
					[テイルズ＿独り言__e:C_長廊下戦中] \
					[テイルズ＿独り言__g:C_長廊下戦中] \
					[テイルズ＿独り言__f:C_長廊下戦中] \
					[テイルズ＿独り言__i:C_長廊下戦中] \
					[テイルズ＿独り言__s:C_長廊下戦中] \
					[テイルズ＿独り言__k:C_長廊下戦中] \
					2

			}else if( (d:TALES_C:長廊下戦終了 <= $b:tales_story_c) && \
						($b:tales_story_c <  d:TALES_C:大佐デモ開始 ) ){
				@テイルズＶＲウィンドウ設定 \
					[テイルズ＿独り言__j:C_長廊下脱出中] \
					[テイルズ＿独り言__e:C_長廊下脱出中] \
					[テイルズ＿独り言__g:C_長廊下脱出中] \
					[テイルズ＿独り言__f:C_長廊下脱出中] \
					[テイルズ＿独り言__i:C_長廊下脱出中] \
					[テイルズ＿独り言__s:C_長廊下脱出中] \
					[テイルズ＿独り言__k:C_長廊下脱出中] \
					2

			}else if( (d:TALES_C:大佐デモ開始 <= $b:tales_story_c) && \
						($b:tales_story_c <  d:TALES_C:メリル戦前デモ開始 ) ){
				@テイルズＶＲウィンドウ設定 \
					[テイルズ＿独り言__j:C_長廊下脱出後メリル戦前] \
					[テイルズ＿独り言__e:C_長廊下脱出後メリル戦前] \
					[テイルズ＿独り言__g:C_長廊下脱出後メリル戦前] \
					[テイルズ＿独り言__f:C_長廊下脱出後メリル戦前] \
					[テイルズ＿独り言__i:C_長廊下脱出後メリル戦前] \
					[テイルズ＿独り言__s:C_長廊下脱出後メリル戦前] \
					[テイルズ＿独り言__k:C_長廊下脱出後メリル戦前] \
					2

			}else{
				@テイルズＶＲウィンドウ設定 \
					[テイルズ＿独り言__j:C_メリル戦中] \
					[テイルズ＿独り言__e:C_メリル戦中] \
					[テイルズ＿独り言__g:C_メリル戦中] \
					[テイルズ＿独り言__f:C_メリル戦中] \
					[テイルズ＿独り言__i:C_メリル戦中] \
					[テイルズ＿独り言__s:C_メリル戦中] \
					[テイルズ＿独り言__k:C_メリル戦中] \
					2
			}
		}

		//テイルズＤ
		case(d:TALES_NO:D) {
			if( $b:tales_story_d  < d:TALES_D:Ｄ脚到着前 ){
				@テイルズＶＲウィンドウ設定 \
					[テイルズ＿独り言__j:D_ＳＥＡＬＳ死体前] \
					[テイルズ＿独り言__e:D_ＳＥＡＬＳ死体前] \
					[テイルズ＿独り言__g:D_ＳＥＡＬＳ死体前] \
					[テイルズ＿独り言__f:D_ＳＥＡＬＳ死体前] \
					[テイルズ＿独り言__i:D_ＳＥＡＬＳ死体前] \
					[テイルズ＿独り言__s:D_ＳＥＡＬＳ死体前] \
					[テイルズ＿独り言__k:D_ＳＥＡＬＳ死体前] \
					3

			}else if( (d:TALES_D:Ｄ脚到着前 <= $b:tales_story_d ) && \
						($b:tales_story_d <  d:TALES_D:Ｅ脚梯子部屋到着前 ) ){
				@テイルズＶＲウィンドウ設定 \
					[テイルズ＿独り言__j:D_ＳＥＡＬＳ死体後Ｄ脚前] \
					[テイルズ＿独り言__e:D_ＳＥＡＬＳ死体後Ｄ脚前] \
					[テイルズ＿独り言__g:D_ＳＥＡＬＳ死体後Ｄ脚前] \
					[テイルズ＿独り言__f:D_ＳＥＡＬＳ死体後Ｄ脚前] \
					[テイルズ＿独り言__i:D_ＳＥＡＬＳ死体後Ｄ脚前] \
					[テイルズ＿独り言__s:D_ＳＥＡＬＳ死体後Ｄ脚前] \
					[テイルズ＿独り言__k:D_ＳＥＡＬＳ死体後Ｄ脚前] \
					3

			}else if( (d:TALES_D:Ｅ脚梯子部屋到着前 <= $b:tales_story_d ) && \
						($b:tales_story_d <   d:TALES_D:Ｅ脚梯子部屋到着中) ){
				@テイルズＶＲウィンドウ設定 \
					[テイルズ＿独り言__j:D_Ｄ脚後Ｅ脚前] \
					[テイルズ＿独り言__e:D_Ｄ脚後Ｅ脚前] \
					[テイルズ＿独り言__g:D_Ｄ脚後Ｅ脚前] \
					[テイルズ＿独り言__f:D_Ｄ脚後Ｅ脚前] \
					[テイルズ＿独り言__i:D_Ｄ脚後Ｅ脚前] \
					[テイルズ＿独り言__s:D_Ｄ脚後Ｅ脚前] \
					[テイルズ＿独り言__k:D_Ｄ脚後Ｅ脚前] \
					3

			}else if( (d:TALES_D:Ｅ脚梯子部屋到着中 <= $b:tales_story_d ) && \
						($b:tales_story_d < d:TALES_D:電撃床破壊前  ) ){
				@テイルズＶＲウィンドウ設定 \
					[テイルズ＿独り言__j:D_Ｅ脚後シェル２中央棟１Ｆ前] \
					[テイルズ＿独り言__e:D_Ｅ脚後シェル２中央棟１Ｆ前] \
					[テイルズ＿独り言__g:D_Ｅ脚後シェル２中央棟１Ｆ前] \
					[テイルズ＿独り言__f:D_Ｅ脚後シェル２中央棟１Ｆ前] \
					[テイルズ＿独り言__i:D_Ｅ脚後シェル２中央棟１Ｆ前] \
					[テイルズ＿独り言__s:D_Ｅ脚後シェル２中央棟１Ｆ前] \
					[テイルズ＿独り言__k:D_Ｅ脚後シェル２中央棟１Ｆ前] \
					3

			}else if( (d:TALES_D:電撃床破壊前 <= $b:tales_story_d ) && \
						($b:tales_story_d <   d:TALES_D:電撃床破壊中) ){
				@テイルズＶＲウィンドウ設定 \
					[テイルズ＿独り言__j:D_シェル２中央棟１Ｆ後配電盤破壊前] \
					[テイルズ＿独り言__e:D_シェル２中央棟１Ｆ後配電盤破壊前] \
					[テイルズ＿独り言__g:D_シェル２中央棟１Ｆ後配電盤破壊前] \
					[テイルズ＿独り言__f:D_シェル２中央棟１Ｆ後配電盤破壊前] \
					[テイルズ＿独り言__i:D_シェル２中央棟１Ｆ後配電盤破壊前] \
					[テイルズ＿独り言__s:D_シェル２中央棟１Ｆ後配電盤破壊前] \
					[テイルズ＿独り言__k:D_シェル２中央棟１Ｆ後配電盤破壊前] \
					3

			}else if( (d:TALES_D:電撃床破壊中 <= $b:tales_story_d ) && \
						($b:tales_story_d <  d:TALES_D:海軍大佐語り中) ){
				@テイルズＶＲウィンドウ設定 \
					[テイルズ＿独り言__j:D_シェル２中央棟１Ｆ後配電盤破壊後大佐接触前] \
					[テイルズ＿独り言__e:D_シェル２中央棟１Ｆ後配電盤破壊後大佐接触前] \
					[テイルズ＿独り言__g:D_シェル２中央棟１Ｆ後配電盤破壊後大佐接触前] \
					[テイルズ＿独り言__f:D_シェル２中央棟１Ｆ後配電盤破壊後大佐接触前] \
					[テイルズ＿独り言__i:D_シェル２中央棟１Ｆ後配電盤破壊後大佐接触前] \
					[テイルズ＿独り言__s:D_シェル２中央棟１Ｆ後配電盤破壊後大佐接触前] \
					[テイルズ＿独り言__k:D_シェル２中央棟１Ｆ後配電盤破壊後大佐接触前] \
					3

			}else if( (d:TALES_D:海軍大佐語り中 <= $b:tales_story_d ) && \
						($b:tales_story_d < d:TALES_D:エレベータ搭乗中 ) ){
				@テイルズＶＲウィンドウ設定 \
					[テイルズ＿独り言__j:D_大佐接触後ヴァンプ戦前] \
					[テイルズ＿独り言__e:D_大佐接触後ヴァンプ戦前] \
					[テイルズ＿独り言__g:D_大佐接触後ヴァンプ戦前] \
					[テイルズ＿独り言__f:D_大佐接触後ヴァンプ戦前] \
					[テイルズ＿独り言__i:D_大佐接触後ヴァンプ戦前] \
					[テイルズ＿独り言__s:D_大佐接触後ヴァンプ戦前] \
					[テイルズ＿独り言__k:D_大佐接触後ヴァンプ戦前] \
					3

			}else{
				@テイルズＶＲウィンドウ設定 \
					[テイルズ＿独り言__j:D_ヴァンプ戦中] \
					[テイルズ＿独り言__e:D_ヴァンプ戦中] \
					[テイルズ＿独り言__g:D_ヴァンプ戦中] \
					[テイルズ＿独り言__f:D_ヴァンプ戦中] \
					[テイルズ＿独り言__i:D_ヴァンプ戦中] \
					[テイルズ＿独り言__s:D_ヴァンプ戦中] \
					[テイルズ＿独り言__k:D_ヴァンプ戦中] \
					3
			}
		}

		//テイルズＥ
		case(d:TALES_NO:E) {
			if( $b:tales_story_e  < d:TALES_E:スネーク回想中 ){
				@テイルズＶＲウィンドウ設定 \
					[テイルズ＿独り言__j:E_ＡＢ連絡橋ゴルルゴン登場前] \
					[テイルズ＿独り言__e:E_ＡＢ連絡橋ゴルルゴン登場前] \
					[テイルズ＿独り言__g:E_ＡＢ連絡橋ゴルルゴン登場前] \
					[テイルズ＿独り言__f:E_ＡＢ連絡橋ゴルルゴン登場前] \
					[テイルズ＿独り言__i:E_ＡＢ連絡橋ゴルルゴン登場前] \
					[テイルズ＿独り言__s:E_ＡＢ連絡橋ゴルルゴン登場前] \
					[テイルズ＿独り言__k:E_ＡＢ連絡橋ゴルルゴン登場前] \
					4

			}else if( (d:TALES_E:Ｃ脚到着前 <= $b:tales_story_e ) && \
						($b:tales_story_e < d:TALES_E:ＡＢ連絡橋到着前 ) ){
				@テイルズＶＲウィンドウ設定 \
					[テイルズ＿独り言__j:E_回想Ｃ脚前] \
					[テイルズ＿独り言__e:E_回想Ｃ脚前] \
					[テイルズ＿独り言__g:E_回想Ｃ脚前] \
					[テイルズ＿独り言__f:E_回想Ｃ脚前] \
					[テイルズ＿独り言__i:E_回想Ｃ脚前] \
					[テイルズ＿独り言__s:E_回想Ｃ脚前] \
					[テイルズ＿独り言__k:E_回想Ｃ脚前] \
					4

			}else if( (d:TALES_E:ＡＢ連絡橋到着前 <= $b:tales_story_e ) && \
						($b:tales_story_e <  d:TALES_E:ゴルルゴン登場デモ前) ){
				@テイルズＶＲウィンドウ設定 \
					[テイルズ＿独り言__j:E_回想Ｃ脚後ゴルルゴン登場前] \
					[テイルズ＿独り言__e:E_回想Ｃ脚後ゴルルゴン登場前] \
					[テイルズ＿独り言__g:E_回想Ｃ脚後ゴルルゴン登場前] \
					[テイルズ＿独り言__f:E_回想Ｃ脚後ゴルルゴン登場前] \
					[テイルズ＿独り言__i:E_回想Ｃ脚後ゴルルゴン登場前] \
					[テイルズ＿独り言__s:E_回想Ｃ脚後ゴルルゴン登場前] \
					[テイルズ＿独り言__k:E_回想Ｃ脚後ゴルルゴン登場前] \
					4

			}else if( (d:TALES_E:ゴルルゴン登場デモ前 <= $b:tales_story_e ) && \
						($b:tales_story_e <  d:TALES_E:敵兵登場デモ前) ){
				@テイルズＶＲウィンドウ設定 \
					[テイルズ＿独り言__j:E_ゴルルゴン撮影中] \
					[テイルズ＿独り言__e:E_ゴルルゴン撮影中] \
					[テイルズ＿独り言__g:E_ゴルルゴン撮影中] \
					[テイルズ＿独り言__f:E_ゴルルゴン撮影中] \
					[テイルズ＿独り言__i:E_ゴルルゴン撮影中] \
					[テイルズ＿独り言__s:E_ゴルルゴン撮影中] \
					[テイルズ＿独り言__k:E_ゴルルゴン撮影中] \
					4

			}else if( (d:TALES_E:敵兵登場デモ前 <= $b:tales_story_e ) && \
						($b:tales_story_e <  d:TALES_E:オルガ語り中) ){
				@テイルズＶＲウィンドウ設定 \
					[テイルズ＿独り言__j:E_敵兵ラッシュ中] \
					[テイルズ＿独り言__e:E_敵兵ラッシュ中] \
					[テイルズ＿独り言__g:E_敵兵ラッシュ中] \
					[テイルズ＿独り言__f:E_敵兵ラッシュ中] \
					[テイルズ＿独り言__i:E_敵兵ラッシュ中] \
					[テイルズ＿独り言__s:E_敵兵ラッシュ中] \
					[テイルズ＿独り言__k:E_敵兵ラッシュ中] \
					4

			}else if( (d:TALES_E:対ゴルルゴンクリア前 <= $b:tales_story_e ) && \
						($b:tales_story_e <  d:TALES_E:対ゴルルゴンクリア中) ){
				@テイルズＶＲウィンドウ設定 \
					[テイルズ＿独り言__j:E_ゴルルゴン戦中] \
					[テイルズ＿独り言__e:E_ゴルルゴン戦中] \
					[テイルズ＿独り言__g:E_ゴルルゴン戦中] \
					[テイルズ＿独り言__f:E_ゴルルゴン戦中] \
					[テイルズ＿独り言__i:E_ゴルルゴン戦中] \
					[テイルズ＿独り言__s:E_ゴルルゴン戦中] \
					[テイルズ＿独り言__k:E_ゴルルゴン戦中] \
					4

			}else if( (d:TALES_E:対ＲＡＹクリア前 <= $b:tales_story_e ) && \
						($b:tales_story_e <  d:TALES_E:対ＲＡＹクリア中) ){
				@テイルズＶＲウィンドウ設定 \
					[テイルズ＿独り言__j:E_ＲＡＹ戦中] \
					[テイルズ＿独り言__e:E_ＲＡＹ戦中] \
					[テイルズ＿独り言__g:E_ＲＡＹ戦中] \
					[テイルズ＿独り言__f:E_ＲＡＹ戦中] \
					[テイルズ＿独り言__i:E_ＲＡＹ戦中] \
					[テイルズ＿独り言__s:E_ＲＡＹ戦中] \
					[テイルズ＿独り言__k:E_ＲＡＹ戦中] \
					4

			}else if( (d:TALES_E:対ソリダスクリア前 <= $b:tales_story_e ) && \
						($b:tales_story_e <  対ソリダスクリア中) ){
				@テイルズＶＲウィンドウ設定 \
					[テイルズ＿独り言__j:E_ソリダス戦中] \
					[テイルズ＿独り言__e:E_ソリダス戦中] \
					[テイルズ＿独り言__g:E_ソリダス戦中] \
					[テイルズ＿独り言__f:E_ソリダス戦中] \
					[テイルズ＿独り言__i:E_ソリダス戦中] \
					[テイルズ＿独り言__s:E_ソリダス戦中] \
					[テイルズ＿独り言__k:E_ソリダス戦中] \
					4

			}else{
			}
		}
		
		default {
		print 'ぐらばっちゃむにょへにゅーん'
		}


	}//end switch
}

