/*
	tales_e_common.rsc
	    スネークテイルズ紙芝居用各言語共通親リソースヘッダ

	2002/06/04 S.Mukaide
	$Id: tales_e_common.rsc,v 1.23 2002/08/10 11:30:24 usr03005 Exp $


*/

// フォントチェック用define
/*
-fontcheckは省略可能です。５つのパラメータは順に 
width, height, chara_skip, line_skip, flag　をあらわします。
flagが1の場合は、禁則を行わない。(日本語以外)

-fontcheck width height chara_skip line_skip flag
*/
#define	TITLE_FONT_AREA		-fontcheck 520 120 0 12 0 


//---------------------------------------
//	テイルズＥ(何かと暴れる話)
//---------------------------------------

resource テイルズ＿Ｅ d:TITLE_FONT_AREA {

	E1_スタート: << EOF
#C(101)#C1
EOF

	E2_スネーク回想: << EOF
#C(101)#C1
EOF


//分岐：
//ＶＲの結果が初期設定３位未満及び途中でやめた：E3_0→E3_1A→E3_2
//ＶＲの結果が初期設定３位以上１位未満：E3_0→E3_1B→E3_2
//ＶＲの結果が初期設定１位以上：E3_0→E3_1C→E3_2

	E3_回想ＶＲ後: << EOF
#C(101)#C1
#C2
#C3
EOF


	E4_メイ・リン登場: << EOF
#C(101)#C1#W#C(201)#W#C(101)#C2
EOF


	E4_0_メイ・リン登場: << EOF


#C(101)#C1
EOF

	E4_1_インチキ新聞後: << EOF
#C(101)#C1
EOF


	E5_Ｃ脚到着: << EOF
#C(101)#C1
EOF


	E6_ＡＢ連絡橋到着: << EOF
#C(101)#C1


EOF


E7_登場: << EOF
#C(101)#C1

#C(200)#W
#C(100)

#C2
EOF

/*
	E7_0_オルガ語り: << EOF
#C1

#C(200)#W
#C(100)

EOF
*/
	E7_0_オルガ語り: << EOF
#C(101)#C1
EOF

	E7_1_ゴルルゴン戦前: << EOF
#C(101)#C1
EOF

	ＶＲ止めた: << EOF
#C(101)#C1
EOF

//E8_0→E8_1→E8_2→E8_3
	E8_ゴルルゴンクリア: << EOF
#C(101)#C1#W#C2#W#C3#W#C4
EOF

	E9_スニーキング３面クリア: << EOF
#C(101)#C1
EOF


//E10_0→E10_1A
	E10_ハンドガン３面Ａ＿成績悪かった: << EOF
#C(101)#C1
#C2
EOF

//E10_0→E10_1B
	E10_ハンドガン３面Ｂ＿成績よかった: << EOF
#C(101)#C1
#C2
EOF


	E11_スニーキング敵全滅５面クリア: << EOF
#C(101)#C1
EOF

//こんてぬしてる
	E12_スニーキング８面クリアＡ: << EOF
#C(101)#C1
#C2
#C3
EOF

//こんてぬしてない
	E12_スニーキング８面クリアＢ: << EOF
#C(101)#C1
#C2
EOF


	E13_1_雷電テイルズ開始: << EOF
#C(101)#C1
｜
#C2
#C3
EOF

	E13_2_雷_爆弾解体２面クリア: << EOF
#C(101)#C1
｜
#C2
#C3
EOF


	E13_3_雷_武装解除２面クリア: << EOF
#C(101)#C1
｜
#C2
#C3
EOF

	E13_4_雷_ＰＳＧ１３面クリア: << EOF
#C(101)#C1
｜
#C2
#C3
EOF

E13_5_雷_敵兵排除４面クリア: << EOF
#C(101)#C1
｜
#C2
#C3
EOF

E13_6_雷_スニーキング３面クリア: << EOF
#C(101)#C1
｜
#C2
#C3
EOF


E13_7_雷_爆弾解体３面クリア: << EOF
#C(101)#C1
｜
#C2
#C3
EOF

E13_8_雷_武装解除６面クリア: << EOF
#C(101)#C1
｜
#C2
#C3
EOF

E13_9_雷_グレネード４面クリア: << EOF
#C(101)#C1
｜
#C2
#C3
EOF


E13_10_雷_敵兵排除９面クリア: << EOF
#C(101)#C1
｜
#C2
#C3
EOF




	E14_ＶＲ制御奪い返し: << EOF
#C(101)#C1
EOF

	E15_対ＲＡＹクリア: << EOF
#C(101)#C1
EOF

/*
	E16_エンディング: << EOF
#C1#W#C2#W#C3#W

#C(202)#W
#C(100)

EOF
*/

	E16_エンディング１: << EOF
#C(101)#C1#W#C2#W#C3
EOF

	E16_エンディング２: << EOF
#C(202)#W
#C(100)
EOF




}
