// w00_common.h
//
// 2001/09/17 S.Nojiri
// $Id: w00_common.h,v 1.5 2001/11/14 06:26:27 usr01717 Exp $
//


//###################################################################################
//									甲板ライト設置
//###################################################################################


	proc 甲板ライト設置 {

		chara プットテクスチャクロスフェードワールド wwww \
			-t light12_msk \
			-u light12_msk \
			-p 1800, -1900, 8020 \
			 4200, -1900, 8020 \
			-4200, -1900, 8020 \
			-1800, -1900, 8020 \
			-r 0, 0 \
			 0, 0 \
			 0, 0 \
			 0, 0 \
			-s 1300 1700

		chara プットテクスチャクロスフェードカメラドア tttt \
			-t xlit05b_alp \
			-u xlit05a_alp \
			-p 8700, 2580, -5000 \
			 8760, 2580, -4950 \
			 8820, 2580, -4900 \

			 12000, 5580, -9800 \
			 12000, 5580, -9740 \
			 12000, 5580, -9680 \

			 6000, 14580, -15890 \
			 6050, 14580, -15950 \
			 6100, 14580, -16010 \
			-s 200\
			-z 8000

		chara プットテクスチャクロスフェードカメラドア tttt \
			-t xlit05b_alp \
			-u xlit05a_alp \
			-p -8700, 2580, -5000 \
			 -8760, 2580, -4950 \
			 -8820, 2580, -4900 \

			-12000, 5580, -9800 \
			-12000, 5580, -9740 \
			-12000, 5580, -9680 \

			 -6000, 14580, -15890 \
			 -6050, 14580, -15950 \
			 -6100, 14580, -16010 \
			-s 200\
			-z 8000


#ifndef d:PAL
		if($s:登場ポイント == タンカー編スタート && $w:武器弾数[d:武器:Ｍ９] == ($w:Ｍ９初期弾数 - 1) ){	//パッドデモで壊れる奴1個取った
			chara プットテクスチャクロスフェードカメラ ssss \
				-t xlit04b_alp \
				-u xlit04a_alp \
				-v xlit05b_alp \
				-p \
				 4200, 2300, 8350 \
				 7650, 3800, 4500 \
				 6650, 8675,500 \
				 6650, 8675, 3500 \
				 6650, 8675,-2500 \
				 6650, 8675,-5600 \
				11000, 8900,-8350 \
				12650, 8900,-10500 \
				12650, 5400, -6500 \
				-s 400 400 100\
				-z 8000

		}else{	//パッドデモ撃つ前にキャンセルしてもこっちに入る。
			chara プットテクスチャクロスフェードカメラ ssss \
				-t xlit04b_alp \
				-u xlit04a_alp \
				-v xlit05b_alp \
				-p 1800, 2300, 8350 \
				 4200, 2300, 8350 \
				 7650, 3800, 4500 \
				 6650, 8675,500 \
				 6650, 8675, 3500 \
				 6650, 8675,-2500 \
				 6650, 8675,-5600 \
				11000, 8900,-8350 \
				12650, 8900,-10500 \
				12650, 5400, -6500 \
				-s 400 400 100\
				-z 8000

		}

		chara プットテクスチャクロスフェードカメラ ssss \
			-t xlit04b_alp \
			-u xlit04a_alp \
			-v xlit05b_alp \
			-p -1800, 2300, 8350 \
			 -4200, 2300, 8350 \
			 -7650, 3800, 4500 \
			 -6650, 8675,500 \
			 -6650, 8675, 3500 \
			 -6650, 8675,-2500 \
			 -6650, 8675,-5600 \
			-11000, 8900,-8350 \
			-12650, 8900,-10500 \
			-12650, 5400, -6500 \
			-s 400 400 100 \
			-z 8000

#else
		command foreach -argc 4 -repeat 10 \
			-data { \
				{0	,1800, 2300, 8350	} \
				{1	,4200	,2300	,8350	} \
				{2	,7650	,3800	,4500	} \
				{3	,6650	,8675	,500	} \
				{4	,6650	,8675	,3500	} \
				{5	,6650	,8675	,-2500	} \
				{6	,6650	,8675	,-5600	} \
				{7	,11000	,8900	,-8350	} \
				{8	,12650	,8900	,-10500	} \
				{9	,12650	,5400	,-6500	} \
/*
				{10	,8700, 2580, -5000	} \
				{11	,8760, 2580, -4950	} \
				{12	,8820, 2580, -4900	} \

				{13	,12000, 5580, -9800	} \
				{14	,12000, 5580, -9740	} \
				{15	,12000, 5580, -9680	} \

				{16	,6000, 14580, -15890	} \
				{17	,6050, 14580, -15950	} \
				{18	,6100, 14580, -16010	} \
*/
			} \
			-exec { \
				//右舷側
				@スポットライト設置 $1 $2 $3 $4
				//反転左舷側
				@スポットライト設置 ($1 + 10) (-1 * $2) $3 $4

/*
				//映りこみ
				if($1 == 0 || $1 == 1){
					@スポットライト設置 $1 $2 (-1 * $3) $4
					@スポットライト設置 ($1 + 19) (-1 * $2) (-1 * $3) $4
				}
*/
			}
#endif


	}



	proc スポットライト設置 $:ライト番号 $:Ｘ座標 $:Ｙ座標 $:Ｚ座標 {

		chara プットスポットライトオブジェ $s:w00a_壊れライト名[$1] \
			-m null null null \
			-t $2,$3,$4 200 1000 \
			-s 100,100,100 \
			-l w00a \
			-p $2,$3,$4 \
			-b 甲板ライト壊れ処理 \
			-f d:BRK_LGT_PUTW00B

#if 1
		if($f:w00a_壊れライトフラグ[$1]){
			eval($s:ローカル変数Ｓ１ = $s:w00a_壊れライト名[$1])
			mesg プットスポットライトオブジェ $s:ローカル変数Ｓ１ ライト消す
		}
#else
		@壊れ物再セットチェック $b:w00a_破壊ロード回数[$1]
		if($f:再セットフラグ) {
			eval($f:w00a_壊れライトフラグ[$1] = 0)
		}else{
			eval($s:ローカル変数Ｓ１ = $s:w00a_壊れライト名[$1])
			mesg プットスポットライトオブジェ $s:ローカル変数Ｓ１ ライト消す
		}
#endif
	}


	proc 甲板ライト壊れ処理 {

		eval($s:ローカル変数Ｓ１ = $1)

		command foreach -argc 1 -repeat 38 \
			-data { \
				{0},{1},{2},{3},{4},{5},{6},{7},{8},{9} \
				{10},{11},{12},{13},{14},{15},{16},{17},{18},{19} \
				{20},{21},{22},{23},{24},{25},{26},{27},{28},{29} \
				{30},{31},{32},{33},{34},{35},{36},{37} \
			} \
			-exec { \
				if($s:ローカル変数Ｓ１ == $s:w00a_壊れライト名[$1]){
					eval($f:w00a_壊れライトフラグ[$1] = 1)
					//eval($b:w00a_破壊ロード回数[$1] = $w:グローバルロード回数);

					mesg プットスポットライトオブジェ $s:ローカル変数Ｓ１ ライト消す
				}
			}
	}

