\/*
\	w04b_seals_param.h
\	    第２船倉兵パラメータ用ヘッダファイル
\	2001/08/07 S.Nojiri
\	$Id: w04b_seals_param.h,v 1.6 2001/09/26 06:48:10 usr01717 Exp $
\
\
\*/
\//###################################################################################
\//								船倉兵のパラメータ（共通）
\//###################################################################################
			-t 2500,7000 \
			-s 10000,-10000,-22000 -10000,-10000,-22000 \
			-p 630,-15600,-1300 -150,1930,0 256 \
				-630,-15600,-1300 -154,2192,0 256 \
			-e 敵兵発見 プロジェクタ１ プロジェクタ２ 船倉兵物音反応 最初の一人発見 ライターのぞき発見 げろっぱ げろっぱ げろっぱ 船倉兵死亡時プロック ライター落とし兵音声再生 \
			-m 2 \	//実験用全員同じ方向に顔を向ける
