/*
	w51a_common.h                     
		アーセナルギア上共通プロック

	2001/05/28 H.Yoshiike         
	$Id: w51a_common.h,v 1.2 2001/08/26 06:59:54 usr03682 Exp $                      

	
*/
// 各proc設定
//-------------------------------------------------------------------------------------
// 全マップ共通
	// アーセナル胴体設置
	// ------------------------------------
	proc アーセナル胴体設置 {
		#if d:DEBUG_PRINT 
			print 'arsenal_set'
		#endif

		chara プットオブジェ アーセナルギア -m d:KMS_NAME2 -r 0,0,0 -p 0,0,0 -s 1000,1000,1000 -l d:LT2_NAME -f 0x0010
	}

	// フォグ
	// ------------------------------------
	proc フォグ設定 {
		#if d:DEBUG_PRINT
			print 'fog_set'
		#endif

		chara フォグ 霧\
			-c 30, 38, 45 \
			-n -50000 \
			-f 640000 
	}

	// キャラ用光源(マップの設置が終わってから設定することで、キャラだけに光を当てる)
	// ------------------------------------
	proc キャラ用ライト設置 {
		#if d:DEBUG_PRINT
			print 'chara_light_set'
		#endif

		chara 環境光 環境光源 \
			 -c 24 40 38

		chara 平行光 平行光源 \
			 -c 53 58 58 \
			 -p 2127 -3979 -2153
	}

	
	// 海面
	// ------------------------------------
	proc 巨大海面セット {
		chara 巨大海面 seaseasea \
			-mipmap 3 50000 0 \
			-size 400000 400000 \
			-light_enable \
			-tex w10a_sea \
			w10a_sea03_128_alp_ovl \
			w10a_sea03_256_alp_ovl \
			w10a_sea03_32_alp_ovl \
			w10a_sea03_64_alp_ovl \
			-pos 0,-35000,0 
	}



// FIXデータはここまで
// -----------------------------------------------------------------------------------












// 以下仮キャラ用proc
// -----------------------------------------------------------------------------------
// 仮キャラ
// ------------------------------------




















// 以下デバッグ専用proc
// -----------------------------------------------------------------------------------
// デバッグキャラ
// ------------------------------------
