//----------------------------------------------------------------------------
//BP - added stdafx.h to get precompiled MGS_SysCommon.h in Windows
#include "stdafx.h"
//BP
//----------------------------------------------------------------------------
/*
	rope.c
		紐形式のモデルを、風やモデルの動きに対応させて動かす
		ロープの共通関数部

	1999/09/16 K.Kano
	$Id: rope.c,v 1.1.1.3 2002/11/19 11:43:34 Yoshizawa1 Exp $
*/


#include "rope.h"


const SAMPLE_MODEL_PARAMETER rope_sample[]={
    { /* 0:ワイヤー */
		1000*0.000001f,		/* -p */
		100*0.001f,			/* -m */
		10000*0.000001f,	/* -k */
		100*0.001f+1.0f,	/* -e */
		200,				/* -l */
		0*0.01f,			/* -w */
		0*0.01f,			/* -j */
    },
    { /* 1:紐 */
		1000*0.000001f,		/* -p */
		10*0.001f,			/* -m */
		200*0.000001f,		/* -k */
		100*0.001f+1.0f,	/* -e */
		20,					/* -l */
		0*0.01f,			/* -w */
		0*0.01f,			/* -j */
    },
    { /* 2:バンダナ１ */
		250*0.000001f,		/* -p */
		12*0.001f,			/* -m */
		350*0.000001f,		/* -k */
		100*0.001f+1.0f,	/* -e */
		20,					/* -l */
		0*0.01f,			/* -w */
		0*0.01f,			/* -j */
    },
    { /* 3:バンダナ２ */
		250*0.000001f,		/* -p */
		22*0.001f,			/* -m */
		350*0.000001f,		/* -k */
		100*0.001f+1.0f,	/* -e */
		20,					/* -l */
		0*0.01f,			/* -w */
		0*0.01f,			/* -j */
    },
    { /* 4:髪の毛 */
		250*0.000001f,		/* -p */
		22*0.001f,			/* -m */
		800*0.000001f,		/* -k */
		// 100*0.001f+1.0f,	/* -e */
		-0.7f+1.0f,			/* -e */
		20,					/* -l */
		95*0.01f,			/* -w */
		50*0.01f,			/* -j */
    },
    { /* 5:エマＩＤカード */
		250*0.000001f,		/* -p */
		12*0.001f,			/* -m */
		350*0.000001f,		/* -k */
		100*0.001f+1.0f,	/* -e */
		200,				/* -l */
		0*0.01f,			/* -w */
		0*0.01f,			/* -j */
    },
    { /* 6:大統領ネクタイ */
		250*0.000001f,		/* -p */
		150*0.001f,			/* -m */
		350*0.000001f,		/* -k */
		100*0.001f+1.0f,	/* -e */
		20,					/* -l */
		95*0.01f,			/* -w */
		50*0.01f,			/* -j */
    },
    { /* 7:バンダナ１ 風の強い日用 */
		250*0.000001f,		/* -p */
		220*0.001f,			/* -m */
		500*0.000001f,		/* -k */
		100*0.001f+1.0f,	/* -e */
		20,					/* -l */
		0*0.01f,			/* -w */
		0*0.01f,			/* -j */
    },
    { /* 8:バンダナ２ 風の強い日用 */
		250*0.000001f,		/* -p */
		300*0.001f,			/* -m */
		350*0.000001f,		/* -k */
		100*0.001f+1.0f,	/* -e */
		20,					/* -l */
		0*0.01f,			/* -w */
		0*0.01f,			/* -j */
    },
    { /* 9:ライデンドッグタグの鎖 */
		0*0.000001f,		/* -p */
		100*0.001f,			/* -m */
		10000*0.000001f,	/* -k */
		100*0.001f+1.0f,	/* -e */
		20,					/* -l */
		0*0.01f,			/* -w */
		0*0.01f,			/* -j */
    },
};


#if 0

void Rope_WorldCalc(FMATRIX *s,OBJECT *obj,MODEL_PARAMETER *p)
{
    DG_MDL *mdl=obj->objs->def->models;
    int size=obj->objs->def->n_models;
    FVECTOR *abs_rots=obj->m_ctrl->abs_rots;
    FVECTOR vec;
    int i;

    MT_QuatToMat(&(s[0]),&(abs_rots[0]));

    for(i=1;i<size;i++){
		MT_QuatToMat(&(s[i]),&(abs_rots[i]));

		vec.vx=mdl[i].tx;
		vec.vy=mdl[i].ty;
		vec.vz=mdl[i].tz;
		vec.vw=1.0f;

		vu0_Ldm0(&(s[i-1]));
		vu0_Ldv0(&vec);

		vu0_Mulv0m0v0();

		vu0_Stv0((FVECTOR *)&(s[i].m[3][0]));
    }
}

#endif


int Rope_GetModelName(int *name)
{
#if 0
    char *x;

    if( GCL_GetOption( 'n' ) != NULL ){
		x=GCL_GetNextString();
    }
    else return 0;

    for( ;x!='\0';x++,name++) *name=*x;
    *name='\0';
#else
    if( GCL_GetOption( 'n' ) != NULL ){
		*name=GCL_GetNextInt();
    }
    else return 0;
#endif

    return 1;
}
