/*
	emavoice.h
	エマ音声集

	2001/07/09 T.Morita
	$Id: emavoice.h,v 1.1 2002/02/01 06:08:31 usr01475 Exp $
*/

resource emma_voice {
vox_list:
    $t{
	t:vc120201,  //手繋_寝てる２	  「……うーん…………お兄ちゃん……」
	t:vc120202,  //手繋_寝てる３	  「あぁ！金星蟹が……！」
	t:vc120203,  //手繋_殴られた１	  「何するの」
	t:vc120204,  //手繋_殴られた２	  「痛いじゃない！」
	t:vc120205,  //手繋_殴られた４	  「サイテー」
	t:vc120206,  //手繋_LIFE少ない１  「もう……ダメ……」
	t:vc120207,  //手繋_LIFE少ない２  「うぅぅぅ……」
	t:vc120208,  //手繋_座り込み３	  「……少し……休ませて……」
	t:vc120209,  //手繋_座り込み４	  「……つかれた……」
	t:vc120210,  //手繋_いたずら１	  「……ヘンタイ！」
	t:vc120211,  //手繋_いたずら３	  「触らないで！」
	t:vc120212,  //手繋_虫１	  「虫！虫キライ」
	t:vc120213,  //手繋_虫２	  「虫ダメ！虫イヤ！虫キライ」
	t:vc120214,  //手繋_虫３	  「虫キライ私、絶対動かないから」
	t:vc120215,  //狙撃_LIFE少ない１  「あぁ……もうダメ……」
	t:vc120216,  //狙撃_LIFE少ない２  「なんとかして！」
	t:vc120217,  //狙撃_LIFE少ない４  「ふぅ……ふぅ……」
	t:vc120218,  //狙撃_LIFE回復１	  「ごめん……少し休ませて……」
	t:vc120219,  //狙撃_LIFE回復２	  「もう少しだけ……休ませて……」
	t:vc120220,  //狙撃_LIFE回復３	  「もう少し……お願い……」
	t:vc120221,  //狙撃_ライデン攻撃１「ちょっと！殺す気」
	t:vc120222,  //狙撃_ライデン攻撃３「何なのよ、あなたサイテー」
	t:vc120223,  //狙撃_ライデン攻撃４「もうイヤ」
	t:vc120224,  //狙撃_ヴァンプ１	  「うぅぅぅ……」
	t:vc120225,  //狙撃_ヴァンプ２	  「苦しい……」
	t:vc120206,  //狙撃_ヴァンプ３	  「……助けて……」
    }
}
