			//敵兵１ (51)
			t:vc04a000,t:vc04a000_len,	//0「初めてプレイヤーを発見」127f 26
			t:vc04a001,t:vc04a001_len,	//1「初めてプレイヤーを発見２」166f 34
			t:vc04a003,t:vc04a003_len,	//2「プレイヤーを発見」
			t:vc04a004,t:vc04a004_len,	//3「プレイヤーを発見２」
			t:vc04a007,t:vc04a007_len,	//4「不意にプレイヤーを発見」
			t:vc04a00a,t:vc04a00a_len,	//5「駆け込み連絡」
			t:vc04a00b,t:vc04a00b_len,	//6「ダメージを受けた」
			t:vc04a00d,t:vc04a00d_len,	//7「ホールドアップさせられた」146
			t:vc04a00f,t:vc04a00f_len,	//8「銃でダメージを受けた」
			t:vc04a010,t:vc04a010_len,	//9「仲間の死体を発見」
			t:vc04a011,t:vc04a011_len,	//a「仲間の死体を発見２」
			t:vc04a013,t:vc04a013_len,	//b「仲間が攻撃を受けた」
			t:vc04a014,t:vc04a014_len,	//c「仲間が攻撃を受けた２」
			t:vc04a017,t:vc04a017_len,	//d「侵入の痕跡を発見」
			t:vc04a01e,t:vc04a01e_len,	//e「警備の補充を頼む」
			t:vc04a01b,t:vc04a01b_len,	//f「了解」
			t:vc04a01d,t:vc04a01d_len,	//10「応答のなかった隊員は発見できず・・・
			t:vc040000,t:vc040000_len,	//11「配置に戻れ！警備を強化しろ！」
			t:vc04a029,t:vc04a029_len,	//12「異常なし」

			t:vc04a101,t:vc04a101_len,	//13「音がした？」
			t:vc04a102,t:vc04a102_len,	//14「音がした？（回避）」
			t:vc04a103,t:vc04a103_len,	//15「足音がした？」
			t:vc04a104,t:vc04a104_len,	//16「足音がした？（回避）」
			t:vc04a105,t:vc04a105_len,	//17「壊れている……」
			t:vc041106,t:vc041106_len,	//18「この本は！？」
			t:vc04a107,t:vc04a107_len,	//19「足跡がある……」
			t:vc04a108,t:vc04a108_len,	//1a「足跡がある……（回避）」
			t:vc04a109,t:vc04a109_len,	//1b「血の跡だ」
			t:vc04a110,t:vc04a110_len,	//1c「血の跡だ（回避）」
			t:vc04a111,t:vc04a111_len,	//1d「誰だ？」
			t:vc04a112,t:vc04a112_len,	//1e「誰だ？（回避）」
			t:vc04a113,t:vc04a113_len,	//1f「大丈夫か？」
			t:vc04a114,t:vc04a114_len,	//20「大丈夫か？（回避）」
			t:vc04a115,t:vc04a115_len,	//21「やられたのか？」
			t:vc04a116,t:vc04a116_len,	//22「やられたのか？（回避）」
			t:vc04a117,t:vc04a117_len,	//23「この箱は？」
			t:vc04a119,t:vc04a119_len,	//24「この箱は？（回避）」
			t:vc04a117,t:vc04a117_len,	//25「あの箱は？」
			t:vc04a119,t:vc04a119_len,	//26「あの箱は？（回避）」
			t:vc04a121,t:vc04a121_len,	//27「お前、ちょっと待て」
			t:vc04a124,t:vc04a124_len,	//28「お前、ちょっと待て（回避）」
			t:vc04a122,t:vc04a122_len,	//29「武器はどうした？」
			t:vc04a125,t:vc04a125_len,	//2a「武器はどうした？（回避）」
			t:vc04a128,t:vc04a128_len,	//2b「なんだその武器は？」
			t:vc04a131,t:vc04a131_len,	//2c「なんだその武器は？（回避）」
			t:vc04a140,t:vc04a140_len,	//2d「その血はどうした？」
			t:vc04a144,t:vc04a144_len,	//2e「その血はどうした？（回避）」
			t:vc04a148,t:vc04a148_len,	//2f「お前、何をしてる？」
			t:vc04a151,t:vc04a151_len,	//30「お前、何をしてる？（回避）」
			t:vc04a203,t:vc04a203_len,	//31「異常は無い（寝言）」
			t:vc04a015,t:vc04a015_len,	//32「敵がどこかにいる。探し出せ」
			t:vc041036,t:vc041036_len,	//33「う、はわわ」
			t:vc041037,t:vc041037_len,	//34「撃つ気か？はわわ」
			t:vc041038,t:vc041038_len,	//35「やるならやれ、はわわ」
			t:vc04a134,t:vc04a134_len,	//36「お前、何故ここにいる」
			t:vc04a137,t:vc04a137_len,	//37「お前、何故ここにいる（回避）」

			//敵兵２ (51)
			t:vc04b000,t:vc042000_len,	//「初めてプレイヤーを発見」
			t:vc04b001,t:vc042001_len,	//「初めてプレイヤーを発見２」
			t:vc04b003,t:vc042003_len,	//「プレイヤーを発見」
			t:vc04b004,t:vc042004_len,	//「プレイヤーを発見２」
			t:vc04b007,t:vc042007_len,	//「不意にプレイヤーを発見」
			t:vc04b00a,t:vc04200a_len,	//「駆け込み連絡」
			t:vc04b00b,t:vc04200b_len,	//「ダメージを受けた」
			t:vc04b00d,t:vc04200d_len,	//「ホールドアップさせられた」 146
			t:vc04b00f,t:vc04200f_len,	//「銃でダメージを受けた」
			t:vc04b010,t:vc042010_len,	//「仲間の死体を発見」
			t:vc04b011,t:vc042011_len,	//「仲間の死体を発見２」
			t:vc04b013,t:vc042013_len,	//「仲間が攻撃を受けた」
			t:vc04b014,t:vc042014_len,	//「仲間が攻撃を受けた２」
			t:vc04b017,t:vc042017_len,	//「侵入の痕跡を発見」
			t:vc04b01e,t:vc04201e_len,	//e「警備の補充を頼む」
			t:vc04b01b,t:vc04201b_len,	//「了解」
			t:vc04b01d,t:vc04201d_len,	//「応答のなかった隊員は発見で・・・」
			t:vc040001,t:vc040001_len,	//「配置に戻れ！気を抜くな！」
			t:vc04b029,t:vc042029_len,	//「異常なし」

			t:vc04b101,t:vc04b101_len,	//13「音がした？」
			t:vc04b102,t:vc04b102_len,	//14「音がした？（回避）」
			t:vc04b103,t:vc04b103_len,	//15「足音がした？」
			t:vc04b104,t:vc04b104_len,	//16「足音がした？（回避）」
			t:vc04b105,t:vc04b105_len,	//17「壊れている……」
			t:vc042106,t:vc042106_len,	//18「この本は！？」
			t:vc04b107,t:vc04b107_len,	//19「足跡がある……」
			t:vc04b108,t:vc04b108_len,	//1a「足跡がある……（回避）」
			t:vc04b109,t:vc04b109_len,	//1b「血の跡だ」
			t:vc04b110,t:vc04b110_len,	//1c「血の跡だ（回避）」
			t:vc04b111,t:vc04b111_len,	//1d「誰だ？」
			t:vc04b112,t:vc04b112_len,	//1e「誰だ？（回避）」
			t:vc04b113,t:vc04b113_len,	//1f「大丈夫か？」
			t:vc04b114,t:vc04b114_len,	//20「大丈夫か？（回避）」
			t:vc04b115,t:vc04b115_len,	//21「やられたのか？」
			t:vc04b116,t:vc04b116_len,	//22「やられたのか？（回避）」
			t:vc04b117,t:vc04b117_len,	//23「この箱は？」
			t:vc04b119,t:vc04b119_len,	//24「この箱は？（回避）」
			t:vc04b118,t:vc04b118_len,	//25「あの箱は？」
			t:vc04b120,t:vc04b120_len,	//26「あの箱は？（回避）」
			t:vc04b121,t:vc04b121_len,	//27「お前、ちょっと待て」
			t:vc04b124,t:vc04b124_len,	//28「お前、ちょっと待て（回避）」
			t:vc04b122,t:vc04b122_len,	//29「武器はどうした？」
			t:vc04b125,t:vc04b125_len,	//2a「武器はどうした？（回避）」
			t:vc04b128,t:vc04b128_len,	//2b「なんだその武器は？」
			t:vc04b131,t:vc04b131_len,	//2c「なんだその武器は？（回避）」
			t:vc04b140,t:vc04b140_len,	//2d「その血はどうした？」
			t:vc04b144,t:vc04b144_len,	//2e「その血はどうした？（回避）」
			t:vc04b148,t:vc04b148_len,	//2f「お前、何をしてる？」
			t:vc04b151,t:vc04b151_len,	//30「お前、何をしてる？（回避）」
			t:vc04b203,t:vc04b203_len,	//31「異常は無い（寝言）」
			t:vc04b01a,t:vc04b01a_len,	//32「敵は近くにいるぞ。気をつけろ」
			t:vc042036,t:vc042036_len,	//33「う、はわわ」
			t:vc042037,t:vc042037_len,	//34「撃つ気か？はわわ」
			t:vc042038,t:vc042038_len,	//35「やるならやれ、はわわ」
			t:vc04b134,t:vc04b134_len,	//36「お前、何故ここにいる」
			t:vc04b137,t:vc04b137_len,	//37「お前、何故ここにいる（回避）」

			//敵兵３ (51)
			t:vc04c000,t:vc043000_len,	//「初めてプレイヤーを発見」
			t:vc04c001,t:vc043001_len,	//「初めてプレイヤーを発見２」
			t:vc04c003,t:vc043003_len,	//「プレイヤーを発見」
			t:vc04c004,t:vc043004_len,	//「プレイヤーを発見２」
			t:vc04c007,t:vc043007_len,	//「不意にプレイヤーを発見」
			t:vc04c00a,t:vc04300a_len,	//「駆け込み連絡」
			t:vc04c00b,t:vc04300b_len,	//「ダメージを受けた」
			t:vc04c00d,t:vc04300d_len,	//「ホールドアップさせられた」 146
			t:vc04c00f,t:vc04300f_len,	//「銃でダメージを受けた」
			t:vc04c010,t:vc043010_len,	//「仲間の死体を発見」
			t:vc04c012,t:vc043012_len,	//「仲間の死体を発見２」
			t:vc04c013,t:vc043013_len,	//「仲間が攻撃を受けた」
			t:vc04c014,t:vc043014_len,	//「仲間が攻撃を受けた２」
			t:vc04c017,t:vc043017_len,	//「侵入の痕跡を発見」
			t:vc04c01e,t:vc04301e_len,	//e「警備の補充を頼む」
			t:vc04c01b,t:vc04301b_len,	//「了解」
			t:vc04c01d,t:vc04301d_len,	//「連絡が途絶えた隊員はいなかった・・・」
			t:vc040002,t:vc040002_len,	//「配置に戻れ！警戒強化だ！」
			t:vc04c029,t:vc043029_len,	//「異常なし」

			t:vc04c101,t:vc04c101_len,	//13「音がした？」
			t:vc04c102,t:vc04c102_len,	//14「音がした？（回避）」
			t:vc04c103,t:vc04c103_len,	//15「足音がした？」
			t:vc04c104,t:vc04c104_len,	//16「足音がした？（回避）」
			t:vc04c105,t:vc04c105_len,	//17「壊れている……」
			t:vc043106,t:vc043106_len,	//18「この本は！？」
			t:vc04c107,t:vc04c107_len,	//19「足跡がある……」
			t:vc04c108,t:vc04c108_len,	//1a「足跡がある……（回避）」
			t:vc04c109,t:vc04c109_len,	//1b「血の跡だ」
			t:vc04c110,t:vc04c110_len,	//1c「血の跡だ（回避）」
			t:vc04c111,t:vc04c111_len,	//1d「誰だ？」
			t:vc04c112,t:vc04c112_len,	//1e「誰だ？（回避）」
			t:vc04c113,t:vc04c113_len,	//1f「大丈夫か？」
			t:vc04c114,t:vc04c114_len,	//20「大丈夫か？（回避）」
			t:vc04c115,t:vc04c115_len,	//21「やられたのか？」
			t:vc04c116,t:vc04c116_len,	//22「やられたのか？（回避）」
			t:vc04c117,t:vc04c117_len,	//23「この箱は？」
			t:vc04c119,t:vc04c119_len,	//24「この箱は？（回避）」
			t:vc04c117,t:vc04c117_len,	//25「あの箱は？」
			t:vc04c119,t:vc04c119_len,	//26「あの箱は？（回避）」
			t:vc04c121,t:vc04c121_len,	//27「お前、ちょっと待て」
			t:vc04c124,t:vc04c124_len,	//28「お前、ちょっと待て（回避）」
			t:vc04c122,t:vc04c122_len,	//29「武器はどうした？」
			t:vc04c125,t:vc04c125_len,	//2a「武器はどうした？（回避）」
			t:vc04c128,t:vc04c128_len,	//2b「なんだその武器は？」
			t:vc04c131,t:vc04c131_len,	//2c「なんだその武器は？（回避）」
			t:vc04c140,t:vc04c140_len,	//2d「その血はどうした？」
			t:vc04c144,t:vc04c144_len,	//2e「その血はどうした？（回避）」
			t:vc04c148,t:vc04c148_len,	//2f「お前、何をしてる？」
			t:vc04c151,t:vc04c151_len,	//30「お前、何をしてる？（回避）」
			t:vc04c203,t:vc04c203_len,	//31「異常は無い（寝言）」
			t:vc04c017,t:vc04c017_len,	//32「気をつけろやつはこのエリアにいる」
			t:vc043036,t:vc043036_len,	//33「う、はわわ」
			t:vc043037,t:vc043037_len,	//34「撃つ気か？はわわ」
			t:vc043038,t:vc043038_len,	//35「やるならやれ、はわわ」
			t:vc04c134,t:vc04c134_len,	//36「お前、何故ここにいる」
			t:vc04c137,t:vc04c137_len,	//37「お前、何故ここにいる（回避）」

			//敵兵４ (51)
			t:vc04d000,t:vc04d000_len,	//「初めてプレイヤーを発見」
			t:vc04d001,t:vc04d001_len,	//「初めてプレイヤーを発見２」
			t:vc04d004,t:vc04d004_len,	//「プレイヤーを発見」
			t:vc04d005,t:vc04d005_len,	//「プレイヤーを発見２」
			t:vc04d007,t:vc04d007_len,	//「不意にプレイヤーを発見」
			t:vc04d00a,t:vc04d00a_len,	//「駆け込み連絡」
			t:vc04d00b,t:vc04d00b_len,	//「ダメージを受けた」
			t:vc04d00e,t:vc04d00e_len,	//「ホールドアップさせられた」 146
			t:vc04d00f,t:vc04d00f_len,	//「銃でダメージを受けた」
			t:vc04d010,t:vc04d010_len,	//「仲間の死体を発見」
			t:vc04d012,t:vc04d012_len,	//「仲間の死体を発見２」
			t:vc04d013,t:vc04d013_len,	//「仲間が攻撃を受けた」
			t:vc04d016,t:vc04d016_len,	//「仲間が攻撃を受けた２」
			t:vc04d017,t:vc04d017_len,	//「侵入の痕跡を発見」
			t:vc04d01e,t:vc04d01e_len,	//e「警備の補充を頼む」
			t:vc04d01b,t:vc04d01b_len,	//「了解」
			t:vc04d01d,t:vc04d01d_len,	//「応答のなかった隊員は発見できず・・・」
			t:vc040002,t:vc040002_len,	//「配置に戻れ！警戒強化だ！」
			t:vc04d029,t:vc04d029_len,	//「異常なし」

			t:vc04d101,t:vc04d101_len,	//13「音がした？」
			t:vc04d102,t:vc04d102_len,	//14「音がした？（回避）」
			t:vc04d103,t:vc04d103_len,	//15「足音がした？」
			t:vc04d104,t:vc04d104_len,	//16「足音がした？（回避）」
			t:vc04d105,t:vc04d105_len,	//17「壊れている……」
			t:vc044106,t:vc044106_len,	//18「この本は！？」
			t:vc04d107,t:vc04d107_len,	//19「足跡がある……」
			t:vc04d108,t:vc04d108_len,	//1a「足跡がある……（回避）」
			t:vc04d109,t:vc04d109_len,	//1b「血の跡だ」
			t:vc04d110,t:vc04d110_len,	//1c「血の跡だ（回避）」
			t:vc04d111,t:vc04d111_len,	//1d「誰だ？」
			t:vc04d112,t:vc04d112_len,	//1e「誰だ？（回避）」
			t:vc04d113,t:vc04d113_len,	//1f「大丈夫か？」
			t:vc04d114,t:vc04d114_len,	//20「大丈夫か？（回避）」
			t:vc04d115,t:vc04d115_len,	//21「やられたのか？」
			t:vc04d116,t:vc04d116_len,	//22「やられたのか？（回避）」
			t:vc04d117,t:vc04d117_len,	//23「この箱は？」
			t:vc04d119,t:vc04d119_len,	//24「この箱は？（回避）」
			t:vc04d118,t:vc04d118_len,	//25「あの箱は？」
			t:vc04d119,t:vc04d119_len,	//26「あの箱は？（回避）」
			t:vc04d121,t:vc04d121_len,	//27「お前、ちょっと待て」
			t:vc04d124,t:vc04d124_len,	//28「お前、ちょっと待て（回避）」
			t:vc04d122,t:vc04d122_len,	//29「武器はどうした？」
			t:vc04d125,t:vc04d125_len,	//2a「武器はどうした？（回避）」
			t:vc04d128,t:vc04d128_len,	//2b「なんだその武器は？」
			t:vc04d131,t:vc04d131_len,	//2c「なんだその武器は？（回避）」
			t:vc04d140,t:vc04d140_len,	//2d「その血はどうした？」
			t:vc04d144,t:vc04d144_len,	//2e「その血はどうした？（回避）」
			t:vc04d148,t:vc04d148_len,	//2f「お前、何をしてる？」
			t:vc04d151,t:vc04d151_len,	//30「お前、何をしてる？（回避）」
			t:vc04d203,t:vc04d203_len,	//31「異常は無い（寝言）」
			t:vc04d01a,t:vc04d01a_len,	//32「やつは近くにいるようだ油断するな」
			t:vc044036,t:vc044036_len,	//33「う、はわわ」
			t:vc044037,t:vc044037_len,	//34「撃つ気か？はわわ」
			t:vc044038,t:vc044038_len,	//35「やるならやれ、はわわ」
			t:vc04d134,t:vc04d134_len,	//36「お前、何故ここにいる」
			t:vc04d137,t:vc04d137_len,	//37「お前、何故ここにいる（回避）」

