//
//	menu_exp_j.h
//	アイテムメニュー説明文リソース日本語版
//	init.gcl からincludeされる。
//	2000/10/17	K.Takabe
//	$Id: menu_exp_j.h,v 1.1 2002/02/01 06:08:31 usr01475 Exp $

resource 武器説明 {
	素手:	//0
		''
	Ｍ９:	//1
//		'ああああああああああああああ｜' ←文字数ものさしっス。
		'Ｍ９｜'\
		'簡易麻酔銃。敵を眠らせる事が｜'\
		'できる。＃｛□、武器｝＃ボタンを押すと構え、'\
		'離すと発砲。サプレッサー、｜'\
		'レーザーポインター装備。'


	ＵＳＰ:	//2
//		'ああああああああああああああ｜' ←文字数ものさしっス。
		'ＵＳＰ｜'\
		'９ｍｍ口径ハンドガン。｜'\
		'＃｛□、武器｝＃ボタンを押すと構え、｜'\
		'離すと発砲。装弾数１５発。'\
		'サプレッサー装着可能。'


	ソコム:	//3
//		'ああああああああああああああ｜' ←文字数ものさししょ
		'ソーコム・ピストル｜'\
		'４５口径ハンドガン。｜'\
		'＃｛□、武器｝＃ボタンを押すと構え、｜'\
		'離すと発砲。装弾数１２発。'\
		'サプレッサー装着可能。'
	ＰＳＧ１:	//4
//		'ああああああああああああああ｜' ←文字数ものさしょ
		'ＰＳＧ１｜'\
		'自動狙撃銃。装備すると主観で｜'\
		'構え、＃｛□、武器｝＃ボタンを押すと発砲。｜'\
		'＃｛○、決定｝＃ボタンでスコープのズーム'\
		'イン、＃｛×、キャンセル｝＃ボタンでズームアウト。'

	ＲＧＢ６:	//5
//		'ああああああああああああああ｜' ←文字数ものさしょ
		'ＲＧＢ６｜'\
		'４０ｍｍ６連装グレネードラン｜'\
		'チャー。＃｛□、武器｝＃ボタンを押すと構え、'\
		'離すと発射。榴弾は放物線を｜'\
		'描いて飛び着弾すると爆発する。'

	ニキータ:	//6
//		'ああああああああああああああ｜' ←文字数ものさしょ
		'リモコンミサイル｜'\
		'無線誘導飛翔体。通称ニキータ。'
		'＃｛□、武器｝＃ボタンを押すと主観で構え、｜'\
		'離すと発射。発射後ミサイルを'\
		'左スティックで操作できる。｜'\

	スティンガー:	//7
//		'ああああああああああああああ｜' ←文字数ものさしょ
		'スティンガーミサイル｜'\
		'携帯用地対空ミサイル。｜'\
		'装備すると主観で構え＃｛□、武器｝＃ボタン｜'\
		'を押すと発射。照準に標的を｜'\
		'捉える事でロックオンが可能。'

	クレイモア:	//8
//		'ああああああああああああああ｜' ←文字数ものさしょ
		'クレイモア｜'\
		'対人指向性地雷。＃｛□、武器｝＃ボタンを｜'\
		'押すと設置。設置後地雷前方の｜'\
		'起爆範囲に入る物を感知すると｜'\
		'爆発する。ホフクで回収可能。'

	Ｃ４:	//9
//		'ああああああああああああああ｜' ←文字数ものさしょ
		'Ｃ４｜'\
		'軍用プラスティック爆弾。｜'\
		'無線式発火装置で爆破する。｜'\
		'＃｛□、武器｝＃ボタンを押すと設置。｜'\
		'設置後、＃｛○、パンチ｝＃ボタンを押すと爆破。'

	チャフ:	//10
//		'ああああああああああああああ｜' ←文字数ものさしっス。
		'チャフ・グレネード｜'\
		'電子妨害用手榴弾。｜'\
		'電子機器を一定時間無効に｜'\
		'できる。＃｛□、武器｝＃ボタンを押すと'\
		'構え、離すと投げる。'

	スタン:	//11
//		'ああああああああああああああ｜' ←文字数ものさしっス。
		'スタン・グレネード｜'\
		'閃光音響手榴弾。｜'\
		'敵を気絶させることができる。｜'\
		'＃｛□、武器｝＃ボタンを押すと構え、｜'\
		'離すと投げる。'

	マイク:	//12
//		'ああああああああああああああ｜' ←文字数ものさしっス。
		'指向性マイク｜'\
		'マイクを向けた方向の音を拾う。'\
		'通常は聞き取れない小さな音の｜'\
		'収音も可能。装備すると主観で｜'\
		'構え左スティックで方向を操作。'

	ブレード:	//13
//		'ああああああああああああああ｜' ←文字数ものさしっス。
		'刀｜'\
		'右スティックを動かして斬る。｜'\
		'右スティックを押し込むと突き。'\
		'Ｌ１ボタンを押している間防御。'\
		'＃｛□、武器｝＃ボタンを押すと刃と峰を反転。'

	凍結スプレー:	//14
		'冷却スプレー｜'\
		'爆弾処理用冷却スプレー。装備｜'\
		'すると主観で構え、＃｛□、武器｝＃ボタンを｜'\
		'押すと冷却剤を噴霧。ボタンを｜'\
		'押す強さで噴霧の勢いが変わる。'

	ＡＫＳ:	//15
		'ＡＫＳ−７４Ｕ｜'\
		'自動小銃。｜'\
		'＃｛□、武器｝＃ボタンを軽く押すと構え、｜'\
		'強く押すとフルオートで発砲。｜'\
		'サプレッサー装着可能。'

	マガジン:	//16
//		'ああああああああああああああ｜' ←文字数ものさしっス。
		'マガジン｜'\
		'銃の空弾倉。｜'\
		'＃｛□、武器｝＃ボタンを押すと構え、'\
		'離すと投げる。＃｛□、武器｝＃ボタンを｜'\
		'押す強さで投擲距離が変わる。'

	グレネード:	//17
//		'ああああああああああああああ｜' ←文字数ものさしっス。
		'グレネード｜'\
		'投擲用破片手榴弾。｜'\
		'＃｛□、武器｝＃ボタンを押すと構え、離すと｜'\
		'投げる。＃｛□、武器｝＃ボタンを押す強さで｜'\
		'投擲距離が変わる。'

	Ｍ４:	//18
//		'ああああああああああああああ｜' ←文字数ものさしゅばば。
		'Ｍ４｜'\
		'自動小銃。装弾数３０発。｜'\
		'＃｛□、武器｝＃ボタンを軽く押すと構え、｜'\
		'強く押すとフルオートで発砲。'

	ＰＳＧ１−Ｔ:	//19
//		'ああああああああああああああ｜' ←文字数ものさしゅばば。
		'ＰＳＧ１−Ｔ｜'\
		'麻酔弾を射出する狙撃麻酔用銃。'\
		'装備すると主観で構え＃｛□、武器｝＃ボタン｜'\
		'で発砲。＃｛○、決定｝＃ボタンでズームイン、'\
		'＃｛×、キャンセル｝＃ボタンでズームアウト。'\

	特殊マイク:	//20
//		'ああああああああああああああ｜' ←文字数ものさしゅばば。
		'指向性マイク｜'\
		'マイクを向けた方向の音を拾う。'\
		'通常は聞き取れない小さな音の｜'\
		'収音も可能。装備すると主観で｜'\
		'構え左スティックで方向を操作。'

    雑誌:	//21
//		'ああああああああああああああ｜' ←文字数ものさしゅばば。
		'雑誌｜'\
		'成人男性向けグラビア雑誌。｜'\
		'若い女性モデルの魅力的な写真｜'\
		'が満載。企画記事も見逃せない。'\
		'＃｛□、武器｝＃ボタンで設置。'

	サプレッサー付きＵＳＰ:	//22
//		'ああああああああああああああ｜' ←文字数ものさしっス。
		'ＵＳＰ｜'\
		'９ｍｍ口径ハンドガン。｜'\
		'＃｛□、武器｝＃ボタンを押すと構え、｜'\
		'離すと発砲。装弾数１５発。'\
		'サプレッサー装着。'

	サプレッサー付きＡＫＳ:	//23
		'ＡＫＳ−７４Ｕ｜'\
		'自動小銃。｜'\
		'＃｛□、武器｝＃ボタンを軽く押すと構え、｜'\
		'強く押すとフルオートで発砲。｜'\
		'サプレッサー装着。'

	サプレッサー付きソコム:	//24
//		'ああああああああああああああ｜' ←文字数ものさししょ
		'ソーコム・ピストル｜'\
		'４５口径ハンドガン。｜'\
		'＃｛□、武器｝＃ボタンを押すと構え、｜'\
		'離すと発砲。装弾数１２発。'\
		'サプレッサー装着。'

	あんたがエイムズマイク:	//25
//		'ああああああああああああああ｜' ←文字数ものさししょ
		'指向性マイク｜'\
		'マイクを向けた方向の音を拾う。'\
		'通常は聞き取れない小さな音の｜'\
		'収音も可能。装備して△ボタン｜'\
		'を押すとエイムズに呼びかける。'

} ;

resource アイテム説明 {
	素手:	//0
		''
	レーション:	//1
//		'ああああああああああああああ｜' ←文字数ものさしっス。
		'レーション｜'\
		'軍用携帯糧食。＃｛ＬＩＦＥ、ライフ｝＃を回復する。'\
		'＃｛○、決定｝＃ボタンで使用。装備すると｜'\
		'＃｛ＬＩＦＥ、ライフ｝＃が無くなった時、自動的に'\
		'使用して＃｛ＬＩＦＥ、ライフ｝＃を回復できる。'


	ダミー双眼鏡:	//2
//		'ああああああああああああああ｜' ←文字数ものさしっス。
		'双眼鏡｜'\
		'軍用双眼鏡。遠距離から｜'\
		'偵察を行う事ができる。｜'\
		'＃｛○、決定｝＃ボタンでズームイン、｜'\
		'＃｛×、キャンセル｝＃ボタンでズームアウト。'

	風邪薬:	//3
		'風邪薬｜'\
		'総合感冒薬。｜'\
		'風邪を治す事ができる。｜'\
		'ウィンドウで選んで｜'\
		'＃｛○、決定｝＃ボタンで服用。'

	止血剤:	//4
//		'ああああああああああああああ｜' ←文字数ものさしっス。
		'止血材｜'\
		'止血用吸収パッド。｜'\
		'出血している時に使うと血を｜'\
		'止める事ができる。ウィンドウ｜'\
		'で選んで＃｛○、決定｝＃ボタンで使用。'

	ジアゼパム:	//5	//タンカー編用？
//		'ああああああああああああああ｜' ←文字数ものさしっス。
		'ジアゼパム｜'\
		'ベンゾジアゼピン系抗不安薬。｜'\
		'抗不安作用以外に筋弛緩作用、｜'\
		'自律神経調節作用等もある。｜'\
		'＃｛○、決定｝＃ボタンで使用。'

	//スカルキャップついてるゴル兵服でありんす。
	ゴル兵制服:	//6
//		'ああああああああああああああ｜' ←文字数ものさしし。
		'野戦服｜'\
		'シェル１中央棟を警備している｜'\
		'敵兵士と同じ＃｛野戦服、Ｂ．Ｄ．Ｕ｝＃。装備する｜'\
		'と着用。同時にＡＫを装備すれ｜'\
		'ば敵兵士に変装する事が可能。'

	防弾チョッキ:	//7
//		'ああああああああああああああ｜' ←文字数ものさしし。
		'ボディ・アーマー｜'\
		'特殊繊維を使用した防弾衣。｜'\
		'装備すると着用。着用している｜'\
		'間、受けるダメージを半減｜'\
		'させる事ができる。'

	ステルス:	//8
//		'ゆめもきぼうもありません……｜' ←文字数ものさしし。
		'ステルス迷彩｜'\
		'装備すると作動。環境の動的｜'\
		'変化に応じて実時間光学処理を｜'\
		'実行、可視波長帯域を欺瞞して｜'\
		'敵から身を隠すことができる。'

	地雷探知器:	//9
//		'ああああああああああああああ｜' ←文字数ものさしし。
		'地雷探知器｜'\
		'化学探知を応用した地雷探知器。'\
		'装備すると作動。敷設された｜'\
		'クレイモア地雷の位置を｜'\
		'レーダーに表示する。'

	センサーＡ:	//10
//		'ああああああああああああああ｜' ←文字数ものさしし。
		'センサーＡ｜'\
		'イオン易動性分光測定式爆発物｜'\
		'探知器。装備すると作動。ファッ'\
		'トマンの仕掛けたＣ４の『匂い』'\
		'を感知しレーダーに表示する。'

	センサーＢ:	//11
//		'ああああああああああああああ｜' ←文字数ものさしし。
		'センサーＢ｜'\
		'中性子後方散乱式爆発物探知器。'\
		'装備すると作動。ファットマン｜'\
		'の仕掛けた『匂い』のしない｜'\
		'Ｃ４を感知して警告音を発する。'

	暗視ゴーグル:	//12
//		'ああああああああああああああ｜' ←文字数ものさしし。
		'暗視ゴーグル｜'\
		'微弱な光を電子的に増幅して｜'\
		'映像化する暗視装置。装備して｜'\
		'使用。暗い場所でも視界を｜'\
		'確保する事ができる。'

	サーマルゴーグル:	//13
//		'ああああああああああああああ｜' ←文字数ものさしし。
		'赤外線ゴーグル｜'\
		'熱源の分布を視覚化する暗視｜'\
		'装置。装備して使用。暗い場所｜'\
		'でも視界を確保できる。クレイ｜'\
		'モア等を可視化する事も可能。'

	双眼鏡:	//14
//		'ああああああああああああああ｜' ←文字数ものさしっス。
		'双眼鏡｜'\
		'軍用双眼鏡。遠距離から｜'\
		'偵察を行う事ができる。｜'\
		'＃｛○、決定｝＃ボタンでズームイン、｜'\
		'＃｛×、キャンセル｝＃ボタンでズームアウト。'

	デジカメ:	//15
//		'ああああああああああああああ｜' ←文字数ものさしっス。
		'デジタルカメラ｜'\
		'写真を撮る事ができる。｜'\
		'＃｛□、武器｝＃ボタンを押すと撮影。｜'\
		'＃｛○、決定｝＃ボタンでズームイン、｜'\
		'＃｛×、キャンセル｝＃ボタンでズームアウト。'

	ダンボール:	//16
//		'ああああああああああああああ｜' ←文字数ものさしっス。
		'ダンボール箱１｜'\
		'生鮮食料品輸送用の｜'\
		'ダンボール箱。｜' \
		'装備すると着用。'


	煙草:	//17
//		'ああああああああああああああ｜' ←文字数ものさしっス。
		'煙草｜'\
		'あなたの健康を損なうおそれが｜'\
		'ありますので吸い過ぎに｜'\
		'注意しましょう｜'\
		'喫煙マナーをまもりましょう'\

	カード:	//18
//		'ああああああああああああああ｜' ←文字数ものさしっス。
		'カード#1｜'\
		'レベル#1のセキュリティ・｜'\
		'カード。持っているだけで｜'\
		'セキュリティ・レベル#1までの｜'\
		'扉を開けることができる。'

	髭剃り:	//19
		'髭剃り｜'\
		'電気カミソリ。｜'\
		'剃り味滑らか。切れ味抜群。｜'\
		'スピーディーな深剃りで｜'\
		'剃り残しなし。'

	携帯電話:	//20
//		'ああああああああああああああ｜' ←文字数ものさしっス。
		'携帯電話｜'\
		'マナーモード付き携帯電話。｜'\
		'電子メールの受信も可能。｜'

	タンカー編カメラ:	//21
//		'ああああああああああああああ｜' ←文字数ものさしっス。
		'デジタルカメラ｜'\
		'＃｛□、武器｝＃ボタンで撮影。○ボタンで｜'\
		'ズームイン、×ボタンでズーム｜'\
		'アウト。Ｌ１ボタン、Ｒ１ボタン'\
		'でプレビューを左右に移動。｜'

	ダンボールＢ:	//22
//		'ああああああああああああああ｜' ←文字数ものさしっス。
		'ダンボール箱２｜'\
		'電化製品輸送用のダンボール箱。'\
		'装備すると着用。'

	ダンボールＣ:	//23
//		'ああああああああああああああ｜' ←文字数ものさしっス。
		'ダンボール箱３｜'\
		'日用品輸送用のダンボール箱。'\
		'装備すると着用。'

	濡れダンボール:	//24
//		'ああああああああああああああ｜' ←文字数ものさしっス。
		'濡れたダンボール箱｜'\
		'生鮮食料品輸送用の｜'\
		'ダンボール箱。'\
		'濡れて傷んでいる。'
		'装備すると着用。'

	振動センサー:	//25
//		'ああああああああああああああ｜' ←文字数ものさししゃ
		'生体センサー｜'\
		'生体反応を感知するセンサー。｜'\
		'装備すると作動。敵兵の接近を｜'\
		'振動で知らせる。作動中、セン｜'\
		'サー以外の振動はオフになる。'

    ダンボールＤ:	//26
		'ダンボール箱４｜'\
		'アクションフィギュア輸送用の｜'
		'ダンボール箱。｜'\
		'装備すると着用。'

    ダンボールＥ:	//27
//		'ああああああああああああああ｜' ←文字数ものさししゃ
		'ダンボール箱５｜'\
		'ゲームソフト輸送用の｜'\
		'ダンボール箱。｜'\
		'目玉の模様が特徴的。｜'
		'装備すると着用。'

	//没だよＸＸＸＸＸＸＸＸＸ
	無駄毛処理器:	//28
		''
	ソコムサプレッサ:	//29
//		'ああああああああああああああ｜' ←文字数ものさししゃ
		'ソーコム・サプレッサー｜'\
		'ソーコムに装着すると発砲時の｜'\
		'銃声を抑える事ができる。｜'\
		'ソーコムと同時に装備する事で｜'\
		'装着。装着後は取り外し不可。｜'\

	ＡＫサプレッサ:	//30
//		'ああああああああああああああ｜' ←文字数ものさししゃ
		'ＡＫ・サプレッサー｜'\
		'ＡＫに装着すると発砲時の'\
		'銃声を抑える事ができる。｜'\
		'ＡＫと同時に装備する事で｜'\
		'装着。装着後は取り外し不可。｜'\

	ダミータンカーカメラ:	//31
//		'ゆめもきぼうもありません……｜' ←文字数ものさししゃ
		'デジタルカメラ｜'\
		'＃｛□、武器｝＃ボタンで撮影。○ボタンで｜'\
		'ズームイン、×ボタンでズーム｜'\
		'アウト。Ｌ１ボタン、Ｒ１ボタン'\
		'でプレビューを左右に移動。｜'

	無限バンダナ:	//32
//		'ああああああああああああああ｜' ←文字数ものさししゃ
		'無限バンダナ｜'\
		'ソリッド・スネーク愛用の｜'\
		'バンダナ。∞というマークが｜'\
		'縫い込まれている。'

	ドッグタグ:	//33
//		'ああああああああああああああ｜' ←文字数ものさししゃ
		'ドッグタグ｜'\
		'兵士の認識票。タイトル画面｜'\
		'からSPECIALを選択しDOG ｜'\
		'TAG VIEWERに入ると取得'\
		'したドッグタグを確認できる。'

	ＭＯディスク:	//34
//		'ああああああああああああああ｜' ←文字数ものさししゃ
		'光ディスク｜'\
		'大統領から託された光ディスク。'\
		'『Ｇ．Ｗ』とアーセナルギアの｜'\
		'制御機能を破壊するコンピュー｜'\
		'タ・ウィルスが入っている。'\

	ＵＳＰサプレッサ:	//35
//		'ああああああああああああああ｜' ←文字数ものさししゃ
		'ＵＳＰ・サプレッサー｜'\
		'ＵＳＰに装着すると発砲時の｜'\
		'銃声を抑える事ができる。｜'\
		'ＵＳＰと同時に装備する事で｜'\
		'装着。装着後は取り外し不可。｜'\

	無限カツラ:			//36
		'無限ウィッグ｜'\
		'茶色のカツラ。｜'\
		'装備すると着用。｜'\
		'つむじが∞の形をしている。'

	カツラＡ:			//37
		'ウィッグＡ｜'
		'青色のカツラ。｜'\
		'装備すると着用。｜'

	カツラＢ:			//38
		'ウィッグＢ｜'
		'オレンジ色のカツラ。｜'\
		'装備すると着用。｜'

	カツラＣ:			//39
		'ウィッグＣ｜'
		'＊色のカツラ。｜'\
		'装備すると着用。｜'

	カツラＤ:			//40
		'ウィッグＤ｜'
		'＊色のカツラ。｜'\
		'装備すると着用。｜'

	//追加

	//スカルキャップ取られたあとのゴル兵服でありんす。
	スカルキャップなしゴル兵制服:	//41
//		'ああああああああああああああ｜' ←文字数ものさしし。
		'野戦服｜'\
		'シェル１中央棟を警備している｜'\
		'敵兵士と同じ＃｛野戦服、Ｂ．Ｄ．Ｕ｝＃。｜'\
		'装備すると着用。｜'\
		'スカルキャップは既にない。'

	プラント編用ジアゼパム:	//42	//プラント編用
//		'ああああああああああああああ｜' ←文字数ものさしっス。
		'ジアゼパム｜'\
		'ベンゾジアゼピン系抗不安薬。｜'\
		'狙撃銃を構えた時の手ぶれを｜'\
		'一定時間止める。ウィンドウで｜'\
		'選んで＃｛○、決定｝＃ボタンで服用。'

	フナムシ:	//43
//		'ああああああああああああああ｜' ←文字数ものさしゃ
		'フナムシ｜'\
		'原油流出事故用に遺伝子操作で｜'\
		'造られた虫。吸着した原油を｜'\
		'食べ、特殊な酵素で分解する。｜'\
		'レーションも大好物。'


} ;

resource 無線メッセージ {
  応答無し:
    '応答ありません。'
}

resource 無線相手 {
	オタコン:	//0
	'オタコン'

	オタコンＳＡＶＥ:	//1
	'ＳＡＶＥ'

	大佐:	//2
	'大佐'

	ローズ:	//3
	'ローズ'

	プリスキン:	//4
	'プリスキン'
	
	ピーター:	//5
	'スティルマン'
	
	スネーク:	//6
	'スネーク'
	
	エマ:	//7
	'エマ'

	ミスターＸ:	//8
	'ミスターＸ'
}


