//
//	p_demo.cdc
//	プラント編デモ無線らしいぞ。
//
//	2001/05/16	T.Fukushima
//	$Id: p_demo_dbg.h,v 1.1 2002/02/01 06:08:32 usr01475 Exp $



//P001_02_R01_オープニング潜入２無線デモ１
block codec RPD_P001_02_R01_オープニング潜入２無線デモ１＿vc110101 14085 d:大佐無線２潜水ライデン {
//	eval($f:rfp_タンカーやった = 1)
	@rpd_潜水ライデン顔設定１
	@rpd_大佐顔設定１
	@rpd_顔表示
	@rp_無線デフォルト前処理
	
	@vc110101
}

block codec RPD_P001_02_R01_オープニング潜入２無線デモ１＿vc110102 14085 d:大佐無線２潜水ライデン {
	@rpd_潜水ライデン顔設定１
	@rpd_大佐顔設定１
	@rpd_顔表示
	@rp_無線デフォルト前処理
	@vc110102
}
block codec RPD_P001_02_R01_オープニング潜入２無線デモ１＿vc110103 14085 d:大佐無線２潜水ライデン {
	@rpd_潜水ライデン顔設定１
	@rpd_大佐顔設定１
	@rpd_顔表示
	@rp_無線デフォルト前処理
		@vc110103
}

block codec RPD_P001_02_R01_オープニング潜入２無線デモ１＿vc110104 14085 d:大佐無線２潜水ライデン {
	@rpd_潜水ライデン顔設定１
	@rpd_大佐顔設定１
	@rpd_顔表示
	@rp_無線デフォルト前処理
		@vc110104
}

block codec RPD_P001_02_R01_オープニング潜入２無線デモ１＿vc110105 14085 d:大佐無線２潜水ライデン {
	@rpd_潜水ライデン顔設定１
	@rpd_大佐顔設定１
	@rpd_顔表示
	@rp_無線デフォルト前処理
	@vc110105
}

block codec RPD_P001_02_R01_オープニング潜入２無線デモ１＿vc110106 14085 d:大佐無線２潜水ライデン {
	@rpd_潜水ライデン顔設定１
	@rpd_大佐顔設定１
	@rpd_顔表示
	@rp_無線デフォルト前処理
	@vc110106
}

block codec RPD_P001_02_R01_オープニング潜入２無線デモ１＿vc110107 14085 d:大佐無線２潜水ライデン {
	@rpd_潜水ライデン顔設定１
	@rpd_大佐顔設定１
	@rpd_顔表示
	@rp_無線デフォルト前処理

	@vc110107
}
block codec RPD_P001_02_R01_オープニング潜入２無線デモ１＿vc110108 14085 d:大佐無線２潜水ライデン {
	@rpd_潜水ライデン顔設定１
	@rpd_大佐顔設定１
	@rpd_顔表示
	@rp_無線デフォルト前処理
	@vc110108
}


block codec RPD_P001_04_R02_オープニング潜入４無線デモ２＿vc110111 14085 d:大佐無線２潜水ライデン {
	@rp_無線デフォルト前処理
	@rpd_潜水ライデン顔設定１
	@rpd_大佐顔設定１
	@rpd_顔表示

	//むびＸＸＸＸＸＸＸＸｘ
	@vc110111
}
block codec RPD_P001_04_R02_オープニング潜入４無線デモ２＿vc110112 14085 d:大佐無線２潜水ライデン {
	@rp_無線デフォルト前処理
	@rpd_潜水ライデン顔設定１
	@rpd_大佐顔設定１
	@rpd_顔表示
	@vc110112	//ＸＸＸＸファイルまちがっとるやないけー
//	@vc110111x
}


block codec RPD_P002_02_R01_Ａ脚底部連結ハッチ２無線デモ１＿vc110201 14085 d:大佐無線２潜水ライデン {
	@rp_無線デフォルト前処理
	@rpd_潜水ライデン顔設定１
	@rpd_大佐顔設定１
	@rpd_顔表示

	@vc110201
}

block codec RPD_P003_02_R02_スネーク昇降機上昇２無線デモ１＿vc110301 14085 d:大佐無線２潜水ライデン {
	@rp_無線デフォルト前処理
//	eval($f:rfp_タンカーやった = 1)
	@rpd_潜水ライデン顔設定１
	@rpd_大佐顔設定１
	@rpd_顔表示
	
	@vc110301
}

block codec RPD_P003_02_R02_スネーク昇降機上昇２無線デモ１＿vc110302 14085 d:大佐無線２潜水ライデン {
	@rp_無線デフォルト前処理
	@rpd_潜水ライデン顔設定１
	@rpd_大佐顔設定１
	@rpd_顔表示

		@vc110302
}

block codec RPD_P003_02_R02_スネーク昇降機上昇２無線デモ１＿vc110303 14085 d:大佐無線２潜水ライデン {
	@rp_無線デフォルト前処理
	@rpd_潜水ライデン顔設定１
	@rpd_大佐顔設定１
	@rpd_顔表示

	@vc110303
}

block codec RPD_P003_02_R02_スネーク昇降機上昇２無線デモ１＿vc110304 14085 d:大佐無線２潜水ライデン {
	@rp_無線デフォルト前処理
	@rpd_潜水ライデン顔設定１
	@rpd_大佐顔設定１
	@rpd_顔表示

	@vc110304
}

block codec RPD_P003_02_R02_スネーク昇降機上昇２無線デモ１＿vc110305 14085 d:大佐無線２潜水ライデン {
	@rp_無線デフォルト前処理
	@rpd_潜水ライデン顔設定１
	@rpd_大佐顔設定１
	@rpd_顔表示

	@vc110305
}


block codec RPD_P004_02_R01_ノード初接続２無線デモ１＿vc110401 14085 d:大佐無線２潜水ライデン {
	@rp_無線デフォルト前処理
	//eval($f:rfp_タンカーやった = 1)
	@rpd_潜水ライデン顔設定１
	@rpd_大佐顔設定１
	@rpd_顔表示
	
	@vc110401
}

block codec RPD_P004_02_R01_ノード初接続２無線デモ１＿vc110402 14085 d:大佐無線２潜水ライデン {
	@rp_無線デフォルト前処理
	//eval($f:rfp_タンカーやった = 1)
	@rpd_潜水ライデン顔設定１
	@rpd_大佐顔設定１
	@rpd_顔表示
	
	@vc110402
}

block codec RPD_P004_02_R01_ノード初接続２無線デモ１＿vc110403 14085 d:大佐無線２潜水ライデン {
	@rp_無線デフォルト前処理
	//eval($f:rfp_タンカーやった = 1)
	@rpd_潜水ライデン顔設定１
	@rpd_大佐顔設定１
	@rpd_顔表示
	
	@vc110403
}

block codec RPD_P004_02_R01_ノード初接続２無線デモ１＿vc110407 14085 d:大佐無線２潜水ライデン {
	@rp_無線デフォルト前処理
	//eval($f:rfp_タンカーやった = 1)
	@rpd_潜水ライデン顔設定１
	@rpd_大佐顔設定１
	@rpd_顔表示
	@vc110407
}

block codec RPD_P004_02_R01_ノード初接続２無線デモ１＿vc110404 14085 d:大佐無線２潜水ライデン {
	@rp_無線デフォルト前処理
	//eval($f:rfp_タンカーやった = 1)
	@rpd_潜水ライデン顔設定１
	@rpd_大佐顔設定１
	@rpd_顔表示
	@vc110404
}

block codec RPD_P004_02_R01_ノード初接続２無線デモ１＿vc110405 14085 d:大佐無線２潜水ライデン {
	@rp_無線デフォルト前処理
	//eval($f:rfp_タンカーやった = 1)
	@rpd_潜水ライデン顔設定１
	@rpd_大佐顔設定１
	@rpd_顔表示
	@vc110405
}

block codec RPD_P004_02_R01_ノード初接続２無線デモ１＿vc110406 14085 d:大佐無線２潜水ライデン {
	@rp_無線デフォルト前処理
	//eval($f:rfp_タンカーやった = 1)
	@rpd_潜水ライデン顔設定１
	@rpd_ローズ顔設定１
	@rpd_顔表示
	@vc110406
}


block codec RPD_P005_03_R01ライデン昇降機上昇３無線デモ１＿vc110501 14085 d:大佐無線１ {
	@rp_無線デフォルト前処理
	@rpd_ライデン顔設定１
	@rpd_大佐顔設定１
	@rpd_顔表示

	@vc110501
}


block codec RPD_P005_05_R02_ライデン昇降機上昇５無線デモ２＿vc110511 14085 d:大佐無線１ {
	@rp_無線デフォルト前処理
	@rpd_ライデン顔設定１
	@rpd_大佐顔設定１
	@rpd_顔表示

	@vc110511
}


block codec RPD_P006_01_R01_Ａ脚金網１無線デモ１＿vc110601 14085 d:大佐無線１ {
	@rp_無線デフォルト前処理
	@rpd_ライデン顔設定１
	@rpd_大佐顔設定１
	@rpd_顔表示

	@vc110601
}


block codec RPD_P007_01_R01_Ａ脚ノード前１無線デモ１＿１＿vc110701 14085 d:大佐無線１ {
	@rp_無線デフォルト前処理
	@rpd_ライデン顔設定１
	@rpd_大佐顔設定１
	@rpd_顔表示

	@vc110701
}

block codec RPD_P007_01_R01_Ａ脚ノード前１無線デモ１＿１＿vc110702 14085 d:大佐無線１ {
	@rp_無線デフォルト前処理
	@rpd_ライデン顔設定１
	@rpd_大佐顔設定１
	@rpd_顔表示

	@vc110702
}

block codec RPD_P007_01_R01_Ａ脚ノード前１無線デモ１＿１＿vc110703 14085 d:大佐無線１ {
	@rp_無線デフォルト前処理
	@rpd_ライデン顔設定１
	@rpd_大佐顔設定１
	@rpd_顔表示
	@vc110703
}


block codec RPD_P008_01_R01_ＡＢ連絡橋１無線デモ１＿１＿vc110801 14085 d:大佐無線１ {
	@rp_無線デフォルト前処理
	@rpd_ライデン顔設定１
	@rpd_大佐顔設定１
	@rpd_顔表示
	
	@vc110801
}

block codec RPD_P008_01_R01_ＡＢ連絡橋１無線デモ１＿１＿vc110802 14085 d:大佐無線１ {
	@rp_無線デフォルト前処理
	@rpd_ライデン顔設定１
	@rpd_大佐顔設定１
	@rpd_顔表示
	
	@vc110802
}	

block codec RPD_P008_01_R01_ＡＢ連絡橋１無線デモ１＿１＿vc110803 14085 d:大佐無線１ {
	@rp_無線デフォルト前処理
	@rpd_ライデン顔設定１
	@rpd_大佐顔設定１
	@rpd_顔表示
	
	@vc110803
}


block codec RPD_P009_01_R01_サイファー遭遇１無線デモ１＿１＿vc110901 14085 d:大佐無線１ {
	@rp_無線デフォルト前処理
	@rpd_ライデン顔設定１
	@rpd_大佐顔設定１
	@rpd_顔表示

	@vc110901
}

block codec RPD_P009_01_R01_サイファー遭遇１無線デモ１＿１＿vc110902 14085 d:大佐無線１ {
	@rp_無線デフォルト前処理
	@rpd_ライデン顔設定１
	@rpd_大佐顔設定１
	@rpd_顔表示

	@vc110902
}

block codec RPD_P009_01_R01_サイファー遭遇１無線デモ１＿１＿vc110903 14085 d:大佐無線１ {
	@rp_無線デフォルト前処理
	@rpd_ライデン顔設定１
	@rpd_大佐顔設定１
	@rpd_顔表示

	@vc110903
}
	



block codec RPD_P010_04_R01_ヴァンプ遭遇４無線デモ１＿１＿vc111001 14085 d:大佐無線１ {
	@rp_無線デフォルト前処理
	@rpd_ライデン顔設定１
	@rpd_大佐顔設定１
	@rpd_顔表示

	@vc111001
}


block codec RPD_P011_01_R01_ＢＣ連絡橋ＣＡＬＬ１無線デモ１＿vc111101 14085 d:大佐無線１ {
	@rp_無線デフォルト前処理
	@rpd_ライデン顔設定１
	@rpd_ローズ顔設定１
	@rpd_顔表示

	@vc111101
}

block codec RPD_P011_01_R01_ＢＣ連絡橋ＣＡＬＬ１無線デモ１＿vc111102 14085 d:大佐無線１ {
	@rp_無線デフォルト前処理
	@rpd_ライデン顔設定１
	@rpd_ローズ顔設定１
	@rpd_顔表示

	@vc111102
}



block codec RPD_P012_02_R01_フォーチュン遭遇２無線デモ１＿vc111201 14085 d:大佐無線１ {
	@rp_無線デフォルト前処理
	@rpd_ライデン顔設定１
	@rpd_大佐顔設定１
	@rpd_顔表示

	@vc111201
}


block codec RPD_P013_01_R01_ライデン危機無線１無線デモ１＿vc111301 14085 d:大佐無線１ {
	@rp_無線デフォルト前処理
	@rpd_ライデン顔設定デフォルト
	@rpd_ローズ顔設定１
	@rpd_顔表示

	@vc111301
}



block codec RPD_P014_05_R01_ピーター遭遇５無線デモ１＿vc111401 14085 d:大佐無線１ {
	@rp_無線デフォルト前処理
	@rpd_ライデン顔設定１
	@rpd_大佐顔設定１
	@rpd_顔表示

	@vc111401
}



block codec RPD_P015_01_R1_爆弾解体最初の一つ１無線デモ１＿vc111501 14025 d:ピーター＿プリスキン {
	@rp_無線デフォルト前処理
	@rpd_ライデン顔設定１
	@rpd_ピーター顔設定１
	@rpd_顔表示

	@vc111501
}


block codec RPD_P016_01_R1_爆弾解体半分解体１無線デモ１＿vc111601 14025 d:ピーター＿プリスキン {
	@rp_無線デフォルト前処理
	@rpd_ライデン顔設定１
	@rpd_ピーター顔設定１
	@rpd_顔表示

	@vc111601
}


block codec RPD_P017_01_R01_爆弾解体中ローズその１無線デモ１＿vc111701 14085 d:大佐無線１ {
	@rp_無線デフォルト前処理
	@rpd_ライデン顔設定１
	@rpd_ローズ顔設定１
	@rpd_顔表示

	@vc111701
}


block codec RPD_P018_01_R01_爆弾解体中ローズその２無線デモ１＿vc111801 14096 d:大佐無線１ {
	@rp_無線デフォルト前処理
	@rpd_ライデン顔設定１
	@rpd_ローズ顔設定１
	@rpd_顔表示

	@vc111801
}


block codec RPD_P019_01_R01_爆弾解体中ローズその３無線デモ１＿vc111901 14096 d:大佐無線１ {
	@rp_無線デフォルト前処理
	@rpd_ライデン顔設定１
	@rpd_ローズ顔設定１
	@rpd_顔表示


	@vc111901
}

block codec RPD_P020_01_R01_地雷原１無線デモ１＿vc112001 14048 d:オルガ無線１ {
	@rp_無線デフォルト前処理
	@rpd_ライデン顔設定デフォルト
	@rpd_ノイズ顔設定１
	@rpd_顔表示

	@vc112001
}
block codec RPD_P020_01_R01_地雷原１無線デモ１＿vc112002 14048 d:オルガ無線１ {
	@rp_無線デフォルト前処理
	@rpd_ライデン顔設定デフォルト
	@rpd_ノイズ顔設定１
	@rpd_顔表示

	@vc112002
}

block codec RPD_P020_01_R01_地雷原１無線デモ１＿２＿vc112003 14085 d:大佐無線１ {
	@rp_無線デフォルト前処理
	//大佐に周波数切り替えＸＸＸ
	@rpd_ライデン顔設定デフォルト
	@rpd_大佐顔設定１
	@rpd_顔表示

	@vc112003
}


block codec RPD_P021_02_R01_爆弾解体オルガ登場２無線デモ１＿vc112101 14180 d:プリスキン無線１ {
	@rp_無線デフォルト前処理
	@rpd_ライデン顔設定デフォルト
	@rpd_プリスキン顔設定１
	@rpd_顔表示

	@vc112101
}


block codec RPD_P022_01_R01_爆弾解体最後から二つ目１無線デモ１＿vc112201 14025 d:ピーター＿プリスキン {
	@rp_無線デフォルト前処理
	@rpd_ライデン顔設定１
	@rpd_ピーター顔設定１
	@rpd_顔表示

	@vc112201
}

block codec RPD_P022_01_R01_爆弾解体最後から二つ目１無線デモ１＿vc112202 14025 d:ピーター＿プリスキン {
	@rp_無線デフォルト前処理
	@rpd_ライデン顔設定１
	@rpd_プリスキン顔表示
	@rpd_顔表示

	@vc112202
}

block codec RPD_P023_01_R01_爆弾解体最後の一つ１無線デモ１＿vc112301 14025 d:ピーター＿プリスキン {
	@rp_無線デフォルト前処理
	@rpd_ライデン顔設定１
	@rpd_ピーター顔設定１
	@rpd_顔表示

	@vc112301
}

block codec RPD_P023_01_R01_爆弾解体最後の一つ１無線デモ１＿vc112302 14025 d:ピーター＿プリスキン {
	@rp_無線デフォルト前処理
	@rpd_ライデン顔設定１
	@rpd_ピーター顔設定１
	@rpd_顔表示

	@vc112302
}

block codec RPD_P023_01_R01_爆弾解体最後の一つ１無線デモ１＿vc112303 14025 d:ピーター＿プリスキン {
	@rp_無線デフォルト前処理
	@rpd_ライデン顔設定１
	@rpd_ピーター顔設定１
	@rpd_顔表示

	@vc112303	//使えるのか……ここで試した……
}

block codec RPD_P023_01_R01_爆弾解体最後の一つ１無線デモ１＿vc112304 14025 d:ピーター＿プリスキン {
	@rp_無線デフォルト前処理
	@rpd_ライデン顔設定１
	@rpd_ピーター顔設定１
	@rpd_顔表示

	@vc112304	//私のいた貯蔵庫に……
}

block codec RPD_P023_01_R01_爆弾解体最後の一つ１無線デモ１＿vc112305 14025 d:ピーター＿プリスキン {
	@rp_無線デフォルト前処理
	@rpd_ライデン顔設定１
	@rpd_プリスキン顔設定１
	@rpd_顔表示

	@vc112305

}

block codec RPD_P024_01_R01_爆弾解体センサーＢ入手１無線デモ１＿vc112401 14025 d:ピーター＿プリスキン {
	@rp_無線デフォルト前処理
	@rpd_ライデン顔設定１
	@rpd_ピーター顔設定１
	@rpd_顔表示

	@vc112401
}
	
block codec RPD_P024_01_R01_爆弾解体センサーＢ入手１無線デモ１＿vc112407 14025 d:ピーター＿プリスキン {
	@rp_無線デフォルト前処理
	@rpd_ライデン顔設定１
	@rpd_ピーター顔設定１
	@rpd_顔表示
	@vc112407
}

block codec RPD_P024_01_R01_爆弾解体センサーＢ入手１無線デモ１＿vc112406 14025 d:ピーター＿プリスキン {
	@rp_無線デフォルト前処理
	@rpd_ライデン顔設定１
	@rpd_ピーター顔設定１
	@rpd_顔表示
	@vc112406
}

block codec RPD_P024_01_R01_爆弾解体センサーＢ入手１無線デモ１＿vc112402 14025 d:ピーター＿プリスキン {
	@rp_無線デフォルト前処理
	@rpd_ライデン顔設定１
	@rpd_ピーター顔設定１
	@rpd_顔表示

	@vc112402
}
	
block codec RPD_P024_01_R01_爆弾解体センサーＢ入手１無線デモ１＿vc112403 14025 d:ピーター＿プリスキン {
	@rp_無線デフォルト前処理
	@rpd_ライデン顔設定１
	@rpd_ピーター顔設定１
	@rpd_顔表示
		@vc112403
}

block codec RPD_P024_01_R01_爆弾解体センサーＢ入手１無線デモ１＿vc112404 14025 d:ピーター＿プリスキン {
	@rp_無線デフォルト前処理
	@rpd_ライデン顔設定１
	@rpd_ピーター顔設定１
	@rpd_顔表示
		@vc112404
}

block codec RPD_P024_01_R01_爆弾解体センサーＢ入手１無線デモ１＿vc112405 14025 d:ピーター＿プリスキン {
	@rp_無線デフォルト前処理
	@rpd_ライデン顔設定１
	@rpd_ピーター顔設定１
	@rpd_顔表示
	@vc112405
}


block codec RPD_P025_01_R01_爆弾解体昇降機下１無線デモ１＿vc112501 14025 d:ピーター＿プリスキン {
	@rp_無線デフォルト前処理
	@rpd_ライデン顔設定１
	@rpd_ピーター顔設定１
	@rpd_顔表示

	@vc112501
}

block codec RPD_P025_01_R01_爆弾解体昇降機下１無線デモ１＿vc112502 14025 d:ピーター＿プリスキン {
	@rp_無線デフォルト前処理
	@rpd_ライデン顔設定１
	@rpd_ピーター顔設定１
	@rpd_顔表示

	@vc112502
	earthq 0
}



block codec RPD_P026_01_R01_爆弾解体終了１無線デモ１＿vc112601 14085 d:大佐無線１ {
	@rp_無線デフォルト前処理
	@rpd_ライデン顔設定１
	@rpd_大佐顔設定１
	@rpd_顔表示

	@vc112601
}



block codec RPD_P027_01_R01_爆弾解体後昇降機ホール１無線デモ１＿vc112701 14085 d:大佐無線１ {
	@rp_無線デフォルト前処理
	@rpd_ライデン顔設定１
	@rpd_大佐顔設定１
	@rpd_顔表示

	@vc112701
}


block codec RPD_P030_01_R01_フォーチュン戦中無線無線デモ１＿vc113001 14085 d:大佐無線１ {
	@rp_無線デフォルト前処理
	@rpd_ライデン顔設定１
	@rpd_大佐顔設定１
	@rpd_顔表示

	@vc113001
}

block codec RPD_P030_01_R01_フォーチュン戦中無線無線デモ１＿vc113002 14085 d:大佐無線１ {
	@rp_無線デフォルト前処理
	@rpd_ライデン顔設定１
	@rpd_大佐顔設定１
	@rpd_顔表示
		@vc113002
}

block codec RPD_P030_01_R01_フォーチュン戦中無線無線デモ１＿vc113003 14085 d:大佐無線１ {
	@rp_無線デフォルト前処理
	@rpd_ライデン顔設定１
	@rpd_大佐顔設定１
	@rpd_顔表示
		@vc113003
}

block codec RPD_P030_01_R01_フォーチュン戦中無線無線デモ１＿vc113004 14085 d:大佐無線１ {
	@rp_無線デフォルト前処理
	@rpd_ライデン顔設定１
	@rpd_大佐顔設定１
	@rpd_顔表示
		@vc113004
}

block codec RPD_P030_01_R01_フォーチュン戦中無線無線デモ１＿vc113005 14085 d:大佐無線１ {
	@rp_無線デフォルト前処理
	@rpd_ライデン顔設定１
	@rpd_大佐顔設定１
	@rpd_顔表示
		@vc113005
}

block codec RPD_P030_01_R01_フォーチュン戦中無線無線デモ１＿vc113006 14085 d:大佐無線１ {
	@rp_無線デフォルト前処理
	@rpd_ライデン顔設定１
	@rpd_大佐顔設定１
	@rpd_顔表示
	@vc113006
}

block codec RPD_P035_01_R01_ファットマン爆弾解体終了１無線デモ１＿vc113501 14085 d:大佐無線１ {
	@rp_無線デフォルト前処理
	@rpd_ライデン顔設定１
	@rpd_大佐顔設定１
	@rpd_顔表示

	@vc113501
}

	//周波数変更ＸＸＸＸＸＸＸＸｘ
block codec RPD_P035_01_R01_ファットマン爆弾解体終了１無線デモ１＿２＿vc113502 14180 d:プリスキン無線１ {
	@rp_無線デフォルト前処理
	@rpd_ライデン顔設定１
	@rpd_プリスキン顔設定１
	@rpd_顔表示

	@vc113502
}

block codec RPD_P036_03_R01_忍者登場３無線デモ１＿vc113601 14048 d:オルガ無線１ {
	@rp_無線デフォルト前処理
	@rpd_ライデン顔設定１
	@rpd_忍者顔設定１
	@rpd_顔表示

	@vc113601
}


block codec RPD_P036_08_R02_忍者登場８無線デモ２＿vc113611 14048 d:オルガ無線１ {
	@rp_無線デフォルト前処理
	@rpd_ライデン顔設定１
	@rpd_忍者顔設定１
	@rpd_顔表示

	@vc113611
}


block codec RPD_P036_10_R03_忍者登場１０無線デモ３＿vc113621 14048 d:オルガ無線１ {
	@rp_無線デフォルト前処理
	@rpd_ライデン顔設定１
	@rpd_忍者顔設定１
	@rpd_顔表示

	@vc113621
}


block codec RPD_P036_13_R04_忍者登場１３無線デモ４＿vc113631 14085 d:大佐無線１ {
	@rp_無線デフォルト前処理
	@rpd_ライデン顔設定１
	@rpd_大佐顔設定１
	@rpd_顔表示

	@vc113631
}



block codec RPD_P037_01_R01_スネークの遺体１無線デモ１＿vc113701 14096 d:大佐無線１ {
	@rp_無線デフォルト前処理
	@rpd_ライデン顔設定デフォルト
	@rpd_ローズ顔設定１
	@rpd_顔表示

	@vc113701
}



block codec RPD_P040_02_R02_エイムズ発見２無線デモ１＿vc114001 14072 d:エイムズ無線１ {
	@rp_無線デフォルト前処理
	@rpd_ライデン顔設定デフォルト
	@rpd_エイムズ顔設定１
	@rpd_顔表示

	@vc114001
}


block codec RPD_P040_06_R02_エイムズ発見６無線デモ２＿１＿vc114011 14072 d:エイムズ無線１ {
	@rp_無線デフォルト前処理
	@rpd_ライデン顔設定デフォルト
	@rpd_エイムズ顔設定１
	@rpd_顔表示

	@vc114011
}

block codec RPD_P040_06_R02_エイムズ発見６無線デモ２＿１＿vc114013 14072 d:エイムズ無線１ {
	@rp_無線デフォルト前処理
	@rpd_ライデン顔設定デフォルト
	@rpd_エイムズ顔設定１
	@rpd_顔表示

	@vc114013	//例のアレ。元ムービー
}

block codec RPD_P040_06_R02_エイムズ発見６無線デモ２＿１＿vc114012 14072 d:エイムズ無線１ {
	@rp_無線デフォルト前処理
	@rpd_ライデン顔設定デフォルト
	@rpd_エイムズ顔設定１
	@rpd_顔表示

	@vc114012	//例のアレ
}





block codec RPD_P041_02_R01_エイムズ死亡後２無線デモ１＿vc114101 14085 d:大佐無線１ {
	@rp_無線デフォルト前処理
	@rpd_ライデン顔設定デフォルト
	@rpd_大佐顔設定１
	@rpd_顔表示

	@vc114101
}



block codec RPD_P042_01_R01_シェル１シェル２連絡橋１無線デモ１＿vc114201 14180 d:プリスキン無線１ {
	@rp_無線デフォルト前処理
	@rpd_ライデン顔設定デフォルト
	@rpd_プリスキン顔設定１
	@rpd_顔表示
	
	@vc114201
}


block codec RPD_P044_01_R01_赤外線センサークリア１無線デモ１＿vc114401 14180 d:プリスキン無線１ {
	@rp_無線デフォルト前処理
	@rpd_ライデン顔設定デフォルト
	@rpd_プリスキン顔設定１
	@rpd_顔表示

	@vc114401
}


//周波数変更 連続ＳＥＮＤプログラム？ＸＸＸＸＸＸ
block codec RPD_P044_01_R01_赤外線センサークリア１無線デモ１＿２＿vc114402 14085 d:大佐無線１ {
	@rp_無線デフォルト前処理
	@rpd_ライデン顔設定デフォルト
	@rpd_大佐顔設定１
	@rpd_顔表示

	@vc114402
}


block codec RPD_P046_02_R01_ハリアー戦勝利２無線デモ１＿１＿vc114601 14180 d:プリスキン無線１ {
	@rp_無線デフォルト前処理
	@rpd_ライデン顔設定デフォルト
	@rpd_プリスキン顔設定１
	@rpd_顔表示
	
	@vc114601
}


//周波数変更 連続ＳＥＮＤプログラム？ＸＸＸＸＸＸ

block codec RPD_P046_02_R01_ハリアー戦勝利２無線デモ１＿２＿vc114602 14085 d:大佐無線１ {
	@rp_無線デフォルト前処理
	@rpd_ライデン顔設定デフォルト
	@rpd_ローズ顔設定１
	@rpd_顔表示

	@vc114602
}

block codec RPD_P046_02_R01_ハリアー戦勝利２無線デモ１＿２＿vc114603 14085 d:大佐無線１ {
	@rp_無線デフォルト前処理
	@rpd_ライデン顔設定デフォルト
	@rpd_大佐顔設定１
	@rpd_顔表示

	@vc114603
}



block codec RPD_P047_05_R01_電撃床前オルガ５無線デモ１＿vc114701 14085 d:大佐無線１ {
	@rp_無線デフォルト前処理
	@rpd_ライデン顔設定デフォルト
	@rpd_大佐顔設定１
	@rpd_顔表示
	
	@vc114701
}

block codec RPD_P047_05_R01_電撃床前オルガ５無線デモ１＿vc114702 14085 d:大佐無線１ {
	@rp_無線デフォルト前処理
	@rpd_ライデン顔設定デフォルト
	@rpd_大佐顔設定１
	@rpd_顔表示
	
	@vc114702
}

block codec RPD_P047_05_R01_電撃床前オルガ５無線デモ１＿vc114703 14085 d:大佐無線１ {
	@rp_無線デフォルト前処理
	@rpd_ライデン顔設定デフォルト
	@rpd_大佐顔設定１
	@rpd_顔表示

	@vc114703
}



block codec RPD_P049_02_R01_大統領２無線機デモ１＿vc114901 14137 d:大統領無線１ {
	@rp_無線デフォルト前処理
	@rpd_ライデン顔設定デフォルト
	@rpd_大統領顔設定１
	@rpd_顔表示
	
	@vc114901
}

block codec RPD_P049_02_R01_大統領２無線機デモ１＿vc114902 14137 d:大統領無線１ {
	@rp_無線デフォルト前処理
	@rpd_ライデン顔設定デフォルト
	@rpd_大統領顔設定１
	@rpd_顔表示
	
	@vc114902
}


block codec RPD_P049_02_R01_大統領５無線機デモ２＿vc114911 14137 d:大統領無線１ {
	@rp_無線デフォルト前処理
	@rpd_ライデン顔設定デフォルト
	@rpd_大統領顔設定１
	@rpd_顔表示

	@vc114911
}


block codec RPD_P049_08_R03_大統領８無線機デモ３＿vc114921 14137 d:大統領無線１ {
	@rp_無線デフォルト前処理
	@rpd_ライデン顔設定デフォルト
	@rpd_大統領顔設定１
	@rpd_顔表示
	
	@vc114921
}


block codec RPD_P049_10_R04_大統領１０無線機デモ４＿vc114931 14137 d:大統領無線１ {
	@rp_無線デフォルト前処理
	@rpd_ライデン顔設定デフォルト
	@rpd_大統領顔設定１
	@rpd_顔表示

	@vc114931
}



block codec RPD_P049_12_R05_大統領１２無線機デモ５＿vc114941 14085 d:大佐無線１ {
	@rp_無線デフォルト前処理
	@rpd_ライデン顔設定デフォルト
	@rpd_大佐顔設定１
	@rpd_顔表示
	
	@vc114941
}


block codec RPD_P050_01_R01_タンカー編整理１無線機デモ１＿vc115001 14180 d:プリスキン無線１ {
	@rp_無線デフォルト前処理
	@rpd_ライデン顔設定デフォルト
	@rpd_プリスキン顔設定１
	@rpd_顔表示

	@vc115001
}



block codec RPD_P050_04_R02_タンカー編整理４無線機デモ２＿vc115011 14180 d:プリスキン無線１ {
	@rp_無線デフォルト前処理
	@rpd_ライデン顔設定デフォルト
	@rpd_プリスキン顔設定１
	@rpd_顔表示

	@vc115011
}

block codec RPD_P050_06_R03_タンカー編整理６無線機デモ３＿vc115021 14180 d:プリスキン無線１ {
	@rp_無線デフォルト前処理
	@rpd_ライデン顔設定デフォルト
	@rpd_プリスキン顔設定１
	@rpd_顔表示

	@vc115021
}


block codec RPD_P051_01_R01_エマとオタコン１無線機デモ１＿vc115101 14085 d:大佐無線１ {
	@rp_無線デフォルト前処理
	@rpd_ライデン顔設定デフォルト
	@rpd_大佐顔設定１
	@rpd_顔表示

	@vc115101
}



block codec RPD_P052_01_R01_ローズ無線１無線機デモ１＿vc115201 14096 d:大佐無線１ {
	@rp_無線デフォルト前処理
	@rpd_ライデン顔設定デフォルト
	@rpd_ローズ顔設定１
	@rpd_顔表示

	@vc115201
}

block codec RPD_P053_01_R01_息継ぎ１無線機デモ１＿vc115301 14180 d:プリスキン無線１ {
	@rp_無線デフォルト前処理
	@rpd_ライデン顔設定デフォルト
	@rpd_オタコン顔設定１
	@rpd_顔表示
	
	@vc115301
}

block codec RPD_P053_01_R01_息継ぎ１無線機デモ１＿vc115302 14180 d:プリスキン無線１ {
	@rp_無線デフォルト前処理
	@rpd_ライデン顔設定デフォルト
	@rpd_オタコン顔設定１
	@rpd_顔表示
	
		@vc115302
}

block codec RPD_P053_01_R01_息継ぎ１無線機デモ１＿vc115303 14180 d:プリスキン無線１ {
	@rp_無線デフォルト前処理
	@rpd_ライデン顔設定デフォルト
	@rpd_オタコン顔設定１
	@rpd_顔表示
	@vc115303
}



block codec RPD_P057_02_R01_ヴァンプ戦終了２無線機デモ１＿vc115701 14085 d:大佐無線１ {
	@rp_無線デフォルト前処理
	@rpd_ライデン顔設定デフォルト
	@rpd_大佐顔設定１
	@rpd_顔表示

	@vc115701
}

//周波数変更プログラム！ＸＸＸＸＸＸＸＸｘｘｘ自動連続ＳＥＮＤ？

block codec RPD_P057_02_R01_ヴァンプ戦終了２無線機デモ１＿２＿vc115702 14180 d:プリスキン無線１ {
	@rp_無線デフォルト前処理
	@rpd_ライデン顔設定デフォルト
	@rpd_プリスキン顔設定１
	@rpd_顔表示
	
	@vc115702
}

block codec RPD_P057_02_R01_ヴァンプ戦終了２無線機デモ１＿２＿vc115703 14180 d:プリスキン無線１ {
	@rp_無線デフォルト前処理
	@rpd_ライデン顔設定デフォルト
	@rpd_プリスキン顔設定１
	@rpd_顔表示
	
	@vc115703
}


block codec RPD_P058_02_R01_エマ救出２無線機デモ１＿vc115801 14152 d:プリスキン無線１ {
	@rp_無線デフォルト前処理
	@rpd_ライデン顔設定デフォルト
	@rpd_エマ顔設定１
	@rpd_顔表示

	@vc115801
}


block codec RPD_P058_04_R02_エマ救出４無線機デモ２＿vc115811 14152 d:プリスキン無線１ {
	@rp_無線デフォルト前処理
	@rpd_ライデン顔設定デフォルト
	@rpd_エマ顔設定１
	@rpd_顔表示

	@vc115811
}


block codec RPD_P058_07_R03_エマ救出７無線機デモ３＿vc115821 14152 d:プリスキン無線１ {
	@rp_無線デフォルト前処理
	@rpd_ライデン顔設定デフォルト
	@rpd_エマ顔設定１
	@rpd_顔表示
	
	@vc115821
}


block codec RPD_P059_03_R01_エマ休憩３無線機デモ１＿vc115901 14085 d:大佐無線１ {
	@rp_無線デフォルト前処理
	@rpd_ライデン顔設定デフォルト
	@rpd_大佐顔設定１
	@rpd_顔表示
	
	@vc115901
}

block codec RPD_P059_03_R01_エマ休憩３無線機デモ１＿vc115902 14085 d:大佐無線１ {
	@rp_無線デフォルト前処理
	@rpd_ライデン顔設定デフォルト
	@rpd_大佐顔設定１
	@rpd_顔表示
	
	@vc115902
}

block codec RPD_P059_03_R01_エマ休憩３無線機デモ１＿vc115903 14085 d:大佐無線１ {
	@rp_無線デフォルト前処理
	@rpd_ライデン顔設定デフォルト
	@rpd_大佐顔設定１
	@rpd_顔表示

	@vc115903
}


block codec RPD_P061_01_R01_エマとオタコン１無線機デモ１＿vc116101 14180 d:プリスキン無線１ {
	@rp_無線デフォルト前処理
	@rpd_ライデン顔設定デフォルト
	@rpd_プリスキン顔設定１
	@rpd_顔表示

	@vc116101
}


block codec RPD_P061_01_R01_エマとオタコン１無線機デモ１＿vc116102 14180 d:プリスキン無線１ {
	@rp_無線デフォルト前処理
	@rpd_ライデン顔設定デフォルト
	@rpd_プリスキン顔設定１
	@rpd_顔表示

	@vc116102
}

block codec RPD_P061_01_R01_エマとオタコン１無線機デモ１＿vc116103 14180 d:プリスキン無線１ {
	@rp_無線デフォルト前処理
	@rpd_ライデン顔設定デフォルト
	@rpd_プリスキン顔設定１
	@rpd_顔表示

	@rpd_ライデン顔表示デフォルト
	@vc116103
}

block codec RPD_P062_03_R01_エマとＡＩ３無線機デモ１＿vc116201 14152 d:プリスキン無線１ {
	@rp_無線デフォルト前処理
	@rpd_ライデン顔設定デフォルト
	@rpd_エマ顔設定１
	@rpd_顔表示

	@vc116201
}


block codec RPD_P062_05_R02_エマとＡＩ５無線機デモ２＿vc116211 14152 d:プリスキン無線１ {
	@rp_無線デフォルト前処理
	@rpd_ライデン顔設定デフォルト
	@rpd_エマ顔設定１
	@rpd_顔表示
	
	@vc116211
}


block codec RPD_P064_01_R01_エマライデンローズ無線１無線機デモ１＿vc116401 14096 d:大佐無線１ {
	@rp_無線デフォルト前処理
	@rpd_ライデン顔設定デフォルト
	@rpd_ローズ顔設定１
	@rpd_顔表示
	
	@vc116401
}

block codec RPD_P065_02_R01_エマＬ脚２無線機デモ１＿vc116501 14152 d:プリスキン無線１ {
	@rp_無線デフォルト前処理
	@rpd_ライデン顔設定デフォルト
	@rpd_エマ顔設定１
	@rpd_顔表示

	@vc116501
}



block codec RPD_P065_06_R02_Ｌ脚エマ６無線機デモ２＿vc116511 14180 d:プリスキン無線１ {
	@rp_無線デフォルト前処理
	@rpd_ライデン顔設定デフォルト
	@rpd_プリスキン顔設定１
	@rpd_顔表示
	
	@vc116511
}

block codec RPD_P065_06_R02_Ｌ脚エマ６無線機デモ２＿vc116512 14180 d:プリスキン無線１ {
	@rp_無線デフォルト前処理
	@rpd_ライデン顔設定デフォルト
	@rpd_プリスキン顔設定１
	@rpd_顔表示
	
	@vc116512
}

block codec RPD_P065_06_R02_Ｌ脚エマ６無線機デモ２＿vc116513 14180 d:プリスキン無線１ {
	@rp_無線デフォルト前処理
	@rpd_ライデン顔設定デフォルト
	@rpd_プリスキン顔設定１
	@rpd_顔表示
	
	@vc116513
}

block codec RPD_P065_06_R02_Ｌ脚エマ６無線機デモ２＿vc116514 14180 d:プリスキン無線１ {
	@rp_無線デフォルト前処理
	@rpd_ライデン顔設定デフォルト
	@rpd_エマ顔設定１
	@rpd_顔表示
	
	@vc116514
}



block codec RPD_P067_01_R01_エマ狙撃１無線機デモ１＿vc116701 14180 d:プリスキン無線１ {
	@rp_無線デフォルト前処理
	@rpd_ライデン顔設定デフォルト
	@rpd_プリスキン顔設定１
	@rpd_顔表示
	
	@vc116701
}


block codec RPD_P069_02_R01_ヴァンプ狙撃終了２無線機デモ１＿vc116901 14180 d:プリスキン無線１ {
	@rp_無線デフォルト前処理
	@rpd_ライデン顔設定デフォルト
	@rpd_プリスキン顔設定１
	@rpd_顔表示

	@vc116901
}



block codec RPD_P069_04_R02_ヴァンプ狙撃終了４無線機デモ２＿vc116911 14180 d:プリスキン無線１ {
	@rp_無線デフォルト前処理
	@rpd_ライデン顔設定デフォルト
	@rpd_プリスキン顔設定１
	@rpd_顔表示

	@vc116911
}


block codec RPD_P070_10_R01_ＡＧ起動１０無線機デモ１＿vc117001 14096 d:大佐無線１ {
	@rp_無線デフォルト前処理
	@rpd_ライデン顔設定デフォルト
	noise 1 1
	@rpd_ローズ顔設定１
	@rpd_顔表示

	@vc117001
}

block codec RPD_P070_10_R01_ＡＧ起動１０無線機デモ１＿vc117002 14096 d:大佐無線１ {
	@rp_無線デフォルト前処理
	@rpd_ライデン顔設定デフォルト
	noise 1 1
	@rpd_ローズ顔設定１
	@rpd_顔表示
		@vc117002
}


block codec RPD_P070_18_R02_ＡＧ起動１８無線機デモ２＿vc117011 14048 d:オルガ素顔無線１ {
	@rp_無線デフォルト前処理
	//本当はライデン裸である。顔セット変える？ＸＸＸＸＸＸＸＸＸｘｘ
	@rpd_裸ライデン顔設定１
	@rpd_オルガ顔設定１
	@rpd_顔表示
	
	@vc117011
}



block codec RPD_P070_20_R03_ＡＧ起動２０無線機デモ３＿vc117021 14048 d:オルガ素顔無線１ {
	@rp_無線デフォルト前処理
	//本当はライデン裸である。顔セット変える？ＸＸＸＸＸＸＸＸＸｘｘ
	@rpd_裸ライデン顔設定１
	@rpd_オルガ顔設定１
	@rpd_顔表示

	@vc117021
}


block codec RPD_P070_23_R04_ＡＧ起動２３無線機デモ４＿vc117031 14096 d:大佐無線３裸ライデン {
	@rp_無線デフォルト前処理
	//本当はライデン裸である。顔セット変える？ＸＸＸＸＸＸＸＸＸｘｘ
	@rpd_裸ライデン顔設定１
	@rpd_ローズ顔設定１
	@rpd_顔表示
	
	@vc117031
}


block codec RPD_P071_01_R01_拷問部屋脱出１無線機デモ１＿vc117102 14085 d:大佐無線３裸ライデン {
	@rp_無線デフォルト前処理
	//本当はライデン裸である。顔セット変える？ＸＸＸＸＸＸＸＸＸｘｘ
	@rpd_裸ライデン顔設定１
	@rpd_大佐顔設定１
	@rpd_顔表示
	@vc117102
}
	
block codec RPD_P071_01_R01_拷問部屋脱出１無線機デモ１＿vc117103 14085 d:大佐無線３裸ライデン {
	@rp_無線デフォルト前処理
	//本当はライデン裸である。顔セット変える？ＸＸＸＸＸＸＸＸＸｘｘ
	@rpd_裸ライデン顔設定１
	@rpd_大佐顔設定１
	@rpd_顔表示
	@vc117103
}


block codec RPD_P072_01_R01_大佐混乱１無線機デモ１＿vc117201 14085 d:大佐無線５バグ大佐裸ライデン {
	@rp_無線デフォルト前処理
	@rpd_裸ライデン顔設定１
	@rpd_大佐顔設定１
	@rpd_顔表示

	
	@vc117201
}


block codec RPD_P073_01_R01_通路Ａ１無線機デモ１＿vc117301 14096 d:大佐無線５バグ大佐裸ライデン {
	@rp_無線デフォルト前処理
	//本当はライデン裸である。顔セット変える？ＸＸＸＸＸＸＸＸＸｘｘ
	@rpd_裸ライデン顔設定１
	@rpd_ローズ顔設定１
	@rpd_顔表示

	@vc117301
}


block codec RPD_P073_03_R02_通路Ａ３無線機デモ２＿vc117311 14180 d:スネーク無線１ {
	@rp_無線デフォルト前処理
	@rpd_ライデン顔設定デフォルト
	@rpd_スネーク顔設定１
	@rpd_顔表示

	@vc117311
}


block codec RPD_P074_02_R01_通路Ａ刀後２無線機デモ１＿vc117401 14180 d:スネーク無線１ {
	@rp_無線デフォルト前処理
	@rpd_ライデン顔設定デフォルト
	@rpd_スネーク顔設定１
	@rpd_顔表示
	
	@vc117401
}

block codec RPD_P075_01_R01_オタコン無事１無線機デモ１＿vc117501 14112 d:スネーク無線１ {
	@rp_無線デフォルト前処理
	@rpd_ライデン顔設定デフォルト
	@rpd_オタコン顔設定１
	@rpd_顔表示

	@vc117501
}


block codec RPD_P076_01_R01_大佐ＡＩ１無線機デモ１＿vc117601 14112 d:スネーク無線１ {
	@rp_無線デフォルト前処理
	@rpd_ライデン顔設定デフォルト
	@rpd_オタコン顔設定１
	@rpd_顔表示

	@vc117601
}


block codec RPD_P077_01_R01_ローズ拉致１無線機デモ１＿vc117701 14085 d:スネーク＿大佐＿ローズ＿ライデン {
	@rp_無線デフォルト前処理
	@rpd_ライデン顔設定デフォルト
	@rpd_大佐顔設定１
	@rpd_顔表示

	@vc117701
}


block codec RPD_P080_19_R01_ＡＧ浮上１９無線機デモ１＿vc118002 14085 d:大佐無線５バグ大佐 {
	@rp_無線デフォルト前処理
	@rpd_ライデン顔設定デフォルト
	@rpd_大佐顔設定１
	@rpd_顔表示

//	@vc118001	//例のアレにて。
	@vc118002
}

block codec RPD_P080_19_R01_ＡＧ浮上１９無線機デモ１＿vc118011 14085 d:大佐無線５バグ大佐 {
	@rp_無線デフォルト前処理
	@rpd_ライデン顔設定デフォルト
	@rpd_大佐顔設定１
	@rpd_顔表示

	@vc118011
}



block codec RPD_P080_21_R02_ＡＧ浮上２１無線機デモ２＿vc118011 14085 d:大佐無線５バグ大佐 {
	@rp_無線デフォルト前処理
	@rpd_ライデン顔設定デフォルト
	@rpd_大佐顔設定１
	@rpd_顔表示

	@vc118011
}


block codec RPD_P080_23_R03_ＡＧ浮上２３無線機デモ３＿vc118021 14085 d:大佐無線５バグ大佐 {
	@rp_無線デフォルト前処理
	@rpd_ライデン顔設定デフォルト
	@rpd_大佐顔設定１
	@rpd_顔表示

	@vc118021
}

block codec RPD_P080_25_R04_ＡＧ浮上２５無線機デモ４＿vc118031 14085 d:大佐無線５バグ大佐 {
	@rp_無線デフォルト前処理
	@rpd_ライデン顔設定デフォルト
	@rpd_大佐顔設定１
	@rpd_顔表示
	
	@vc118031
}


