/*
	a00b_tale.h
		メリル戦（スネークテイルズ用）
	2002/06/14 S.Kaneyoshi
	$Id: a00b_tale.h,v 1.8 2002/08/20 07:43:18 usr04249 Exp $
*/

#define MISSION_TALE	1	// スネークテイルズ用プロック起動用

/*************************************************************************************/
// chara マップの前に呼ばれるproc
/*************************************************************************************/
	proc スネークテイルズ用マップ定義前設定 {
		// 共通システムの起動 $:クリア条件フラグ $:途中ステージフラグ
		@全ミッション共通システム設定 0
		//command セットルートオフセット d:SCN:スネークテイルズ -c d:SCN:通常
	}

/*************************************************************************************/
// chara マップの後に呼ばれるproc
/*************************************************************************************/
	proc スネークテイルズ用マップ定義後設定 {
	
		@ポーズ時ステージ名表示設定 d:wn_航海甲板左舷ウイング
		
		// 全マップ共通基本キャラ設定
		command マップ設定 ブリッジ屋上部 -s {
			//@スネークテイルズ用サウンド設定
			@スネークテイルズ用変数設定
			//@スネークテイルズ用コマンダー設定
			//@スネークテイルズ用ＢＧＭ設定			// プレイヤー→敵兵→BGMの順で呼ぶ
			@スネークテイルズ用アイテム設置
		}
		
	}

/*************************************************************************************/
// クリアしたときの処理(空でＯＫ)
/*************************************************************************************/
proc スネークテイルズ用クリア時処理 {
	#if d:DEBUG_PRINT
		print 'game clear'
	#endif
}

/*************************************************************************************/
// サウンドに関する設定
/*************************************************************************************/

	proc スネークテイルズ用サウンド設定 {
		#if d:DEBUG_PRINT
			print 'sound_set-bomb_misson'
		#endif

		chara サウンドマネージャー ＳＤマネ -pak 0
		@サウンド効果音設定
	}

	proc スネークテイルズ用ＢＧＭ設定 {
		#if d:DEBUG_PRINT
			print 'bgm_set-bomb_misson'
		#endif
		chara ＢＧＭマネージャー ＢＧＭマネ
	}

/*************************************************************************************/
// 変数初期化
/*************************************************************************************/

	proc スネークテイルズ用変数設定 {
		#if d:DEBUG_PRINT
			print 'stage_var_set-tale_misson'
		#endif
		
		
		chara プロック連続実行 ＵＳＰ連続君 -time -1 -exec {
			if( $w:武器弾数Ｒ[ d:武器:ＵＳＰ ] != -1 && \
				$w:武器弾数Ｒ[ d:武器:ＵＳＰ ] < 30 ) {
				@ＵＳＰ弾チェック ＵＳＰ弾 -4300 12000 -8850
			}
		}
	}
	
	proc ＵＳＰ弾チェック $:名前 $:Ｘ $:Ｙ $:Ｚ {
		
		if( $$f:ＵＳＰ弾フラグ == 0 && \
			`command カメラ視界チェック -camera 0x03 \
				-bound	($:Ｘ - 1000)	($:Ｙ) 		($:Ｚ-1000) \
						($:Ｘ + 1000)	($:Ｙ+1000) ($:Ｚ+1000)` == 0 ){
			
			#if d:DEBUG_PRINT
				print 'ＵＳＰ弾チェック プロック'
			#endif
			
			$$f:ＵＳＰ弾フラグ = 1;
			
			chara アイテム $:名前 -b 0 -p $:Ｘ $:Ｙ $:Ｚ \
				-k handgun_amo_ibox \			// モデル：箱本体
				-s handgun_amo_ibox_sh \		// モデル：箱影
				-l usp_amo_label \				// モデル：ラベル
				-f d:アイテム種別:武器弾 \		// ＩＤ：from ..../scn/equip.h
				-i d:武器:ＵＳＰ \				// ＩＤ：from ..../scn/equip.h
				-n 15 \							// 個数
				-h 300 \
				-r 0 \
				-m ブリッジ屋上部 \
				-x {
					$$f:ＵＳＰ弾フラグ = 0;
				}
		}
	}
	
	


/**************************************************************************************/
// アイテム関連
/**************************************************************************************/

	proc スネークテイルズ用アイテム取得時番号設定 $:ボックス名 {
		#if d:DEBUG_PRINT
			print 'item_no_set'
		#endif

		if($:ボックス名 == ＵＳＰ本体) {
			eval($b:w01a_取得ロード回数[0] = $w:グローバルロード回数);
		} else if ($:ボックス名 == ＵＳＰ弾) {
			eval($b:w01a_取得ロード回数[1] = $w:グローバルロード回数);
		} else if ($:ボックス名 == Ｍ９弾) {
			eval($b:w01a_取得ロード回数[2] = $w:グローバルロード回数);
		}

		#if d:DEBUG_PRINT
			print $:ボックス名
			print $w:グローバルロード回数
		#endif
	}

	proc スネークテイルズ用アイテム設置 {
		if( $w:アイテム数Ｒ[ d:アイテム:レーション ] == 0 ) {
			@レーション_初期設置 レーション -10250,12000,-10250 d:アイテム水飛沫有
		}
	}
