/*
	a46a_d_common.h
	    メタル戦	オルタナティブミッション用デモ／ゲーム共通プロック

	2002/06/17 S.Mukaide
	$Id: a46a_d_common.h,v 1.1 2002/06/17 11:25:05 usr03379 Exp $                      

	
*/




//###################################################################################
//									 エフェクト
//###################################################################################

	proc フォグ設定 {
		#if d:DEBUG_PRINT
			print 'fog_set'
		#endif

		chara フォグ 霧\
			-c  0, 16, 15 \
			-n 0 \
			-f 110000

	}

	proc もやもや設定 {
		chara	ＲＡＹステージ環境設定 もやもや君
	}

	proc 雷設定 {
		chara 新雷フラッシュ \
			thunder -probability 360 -thunder_disable
	}


