
proc enter_codec_debug_mode_p_vc {
	eval($f:rfp_enter_codec_debug_mode_p_demo_vc = 1)
	restart
}

proc clear_flag_p_vc {
//	eval($f:rfp_enter_codec_debug_mode_p_demo_vc = 0)
	eval($f:rfp_enter_p_vc_P001_02_R01nt_P006_01_R01 = 0)
	eval($f:rfp_enter_p_vc_P007_01_R01_P016_01_R01 = 0)
	eval($f:rfp_enter_p_vc_P017_01_R01_P026_01_R01 = 0)
	eval($f:rfp_enter_p_vc_P027_01_R01_P040_02_R02 = 0)
	eval($f:rfp_enter_p_vc_P040_06a_R02a_P049_02_R01 = 0)
	eval($f:rfp_enter_p_vc_P049_05_R02_P052_01_R01 = 0)
	eval($f:rfp_enter_p_vc_P053_01_R01_P062_05_R02 = 0)
	eval($f:rfp_enter_p_vc_P064_01_R01_P070_23_R04 = 0)
	eval($f:rfp_enter_p_vc_P071_01_R01_P080_21_R02 = 0)
	eval($f:rfp_enter_p_vc_P080_23_R03_P080_25_R04 = 0)
}


proc exit_codec_debug_mode_p_vc {
	@clear_flag_p_vc
	eval($f:rfp_enter_codec_debug_mode_p_demo_vc = 0)
	eval($f:rfp_enter_codec_debug_mode_p = 0)
	restart
}

proc back_to_root_p_vc_demo {
	@clear_flag_p_vc
	restart
}



/*---------------------------------------------------------
このへんに呼び出しプロックを書いちゃうぞ
---------------------------------------------------------*/
proc rp_d_P001_02_R01オープニング潜入２無線デモ１＿vc110101 {
	eval($w:タンカー編クリア回数 = 0)	//ＸＸＸＸＸ
	command 無線設定 \
	-call 14085 \
		t:RPD_P001_02_R01_オープニング潜入２無線デモ１＿vc110101 \
		d:CODEC_DIRECT 終わり_p
}

proc rp_d_P001_02_R01オープニング潜入２無線デモ１＿vc110102 {
	eval($w:タンカー編クリア回数 = 1)	//ＸＸＸＸＸ
	command 無線設定 \
	-call 14085 \
		t:RPD_P001_02_R01_オープニング潜入２無線デモ１＿vc110102 \
		d:CODEC_DIRECT 終わり_p
}

proc rp_d_P001_02_R01オープニング潜入２無線デモ１＿vc110103 {
	eval($w:タンカー編クリア回数 = 1)	//ＸＸＸＸＸ
	command 無線設定 \
	-call 14085 \
		t:RPD_P001_02_R01_オープニング潜入２無線デモ１＿vc110103 \
		d:CODEC_DIRECT 終わり_p
}

proc rp_d_P001_02_R01オープニング潜入２無線デモ１＿vc110104 {
	eval($w:タンカー編クリア回数 = 1)	//ＸＸＸＸＸ
	command 無線設定 \
	-call 14085 \
		t:RPD_P001_02_R01_オープニング潜入２無線デモ１＿vc110104 \
		d:CODEC_DIRECT 終わり_p
}
proc rp_d_P001_02_R01オープニング潜入２無線デモ１＿vc110105 {
	eval($w:タンカー編クリア回数 = 1)	//ＸＸＸＸＸ
	command 無線設定 \
	-call 14085 \
		t:RPD_P001_02_R01_オープニング潜入２無線デモ１＿vc110105 \
		d:CODEC_DIRECT 終わり_p
}
proc rp_d_P001_02_R01オープニング潜入２無線デモ１＿vc110106 {
	eval($w:タンカー編クリア回数 = 1)	//ＸＸＸＸＸ
	command 無線設定 \
	-call 14085 \
		t:RPD_P001_02_R01_オープニング潜入２無線デモ１＿vc110106 \
		d:CODEC_DIRECT 終わり_p
}
proc rp_d_P001_02_R01オープニング潜入２無線デモ１＿vc110107 {
	eval($w:タンカー編クリア回数 = 1)	//ＸＸＸＸＸ
	command 無線設定 \
	-call 14085 \
		t:RPD_P001_02_R01_オープニング潜入２無線デモ１＿vc110107 \
		d:CODEC_DIRECT 終わり_p
}
proc rp_d_P001_02_R01オープニング潜入２無線デモ１＿vc110108 {
	eval($w:タンカー編クリア回数 = 1)	//ＸＸＸＸＸ
	command 無線設定 \
	-call 14085 \
		t:RPD_P001_02_R01_オープニング潜入２無線デモ１＿vc110108 \
		d:CODEC_DIRECT 終わり_p
}

// ------------------------------------------------
proc rp_d_P001_04_R02オープニング潜入４無線デモ２＿vc110111 {
	command 無線設定 \
	-call 14085 \
		t:RPD_P001_04_R02_オープニング潜入４無線デモ２＿vc110111 \
		d:CODEC_DIRECT 終わり_p
}

proc rp_d_P001_04_R02オープニング潜入４無線デモ２＿vc110112 {
	command 無線設定 \
	-call 14085 \
		t:RPD_P001_04_R02_オープニング潜入４無線デモ２＿vc110112 \
		d:CODEC_DIRECT 終わり_p
}

// ------------------------------------------------
proc	rp_d_P002_02_R01Ａ脚底部連結ハッチ２無線デモ１＿vc110201 {
	command 無線設定 \
	-call 14085 \
		t:RPD_P002_02_R01_Ａ脚底部連結ハッチ２無線デモ１＿vc110201 \
		d:CODEC_DIRECT 終わり_p
}
// ------------------------------------------------
proc	rp_d_P003_02_R02スネーク昇降機上昇２無線デモ１＿vc110301 {
	eval($w:タンカー編クリア回数 = 0)	//ＸＸＸＸＸＸＸＸＸ
	command 無線設定 \
	-call 14085 \
		t:RPD_P003_02_R02_スネーク昇降機上昇２無線デモ１＿vc110301 \
		d:CODEC_DIRECT 終わり_p
}
proc	rp_d_P003_02_R02スネーク昇降機上昇２無線デモ１＿vc110302 {
	eval($w:タンカー編クリア回数 = 0)	//ＸＸＸＸＸＸＸＸＸ
	command 無線設定 \
	-call 14085 \
		t:RPD_P003_02_R02_スネーク昇降機上昇２無線デモ１＿vc110302 \
		d:CODEC_DIRECT 終わり_p
}
proc	rp_d_P003_02_R02スネーク昇降機上昇２無線デモ１＿vc110303 {
	eval($w:タンカー編クリア回数 = 0)	//ＸＸＸＸＸＸＸＸＸ
	command 無線設定 \
	-call 14085 \
		t:RPD_P003_02_R02_スネーク昇降機上昇２無線デモ１＿vc110303 \
		d:CODEC_DIRECT 終わり_p
}
proc	rp_d_P003_02_R02スネーク昇降機上昇２無線デモ１＿vc110304 {
	eval($w:タンカー編クリア回数 = 0)	//ＸＸＸＸＸＸＸＸＸ
	command 無線設定 \
	-call 14085 \
		t:RPD_P003_02_R02_スネーク昇降機上昇２無線デモ１＿vc110304 \
		d:CODEC_DIRECT 終わり_p
}
proc	rp_d_P003_02_R02スネーク昇降機上昇２無線デモ１＿vc110305 {
	eval($w:タンカー編クリア回数 = 0)	//ＸＸＸＸＸＸＸＸＸ
	command 無線設定 \
	-call 14085 \
		t:RPD_P003_02_R02_スネーク昇降機上昇２無線デモ１＿vc110305 \
		d:CODEC_DIRECT 終わり_p
}

// ------------------------------------------------
proc	rp_d_P004_02_R01ノード初接続２無線デモ１＿vc110401 {
	eval($w:タンカー編クリア回数 = 1)	//ＸＸＸＸＸＸＸＸＸ
	command 無線設定 \
	-call 14085 \
		t:RPD_P004_02_R01_ノード初接続２無線デモ１＿vc110401 \
		d:CODEC_DIRECT 終わり_p
}
proc	rp_d_P004_02_R01ノード初接続２無線デモ１＿vc110402 {
	eval($w:タンカー編クリア回数 = 1)	//ＸＸＸＸＸＸＸＸＸ
	command 無線設定 \
	-call 14085 \
		t:RPD_P004_02_R01_ノード初接続２無線デモ１＿vc110402 \
		d:CODEC_DIRECT 終わり_p
}
proc	rp_d_P004_02_R01ノード初接続２無線デモ１＿vc110403 {
	eval($w:タンカー編クリア回数 = 1)	//ＸＸＸＸＸＸＸＸＸ
	command 無線設定 \
	-call 14085 \
		t:RPD_P004_02_R01_ノード初接続２無線デモ１＿vc110403 \
		d:CODEC_DIRECT 終わり_p
}
proc	rp_d_P004_02_R01ノード初接続２無線デモ１＿vc110407 {
	eval($w:タンカー編クリア回数 = 1)	//ＸＸＸＸＸＸＸＸＸ
	command 無線設定 \
	-call 14085 \
		t:RPD_P004_02_R01_ノード初接続２無線デモ１＿vc110407 \
		d:CODEC_DIRECT 終わり_p
}
proc	rp_d_P004_02_R01ノード初接続２無線デモ１＿vc110404 {
	eval($w:タンカー編クリア回数 = 1)	//ＸＸＸＸＸＸＸＸＸ
	command 無線設定 \
	-call 14085 \
		t:RPD_P004_02_R01_ノード初接続２無線デモ１＿vc110404 \
		d:CODEC_DIRECT 終わり_p
}
proc	rp_d_P004_02_R01ノード初接続２無線デモ１＿vc110405 {
	eval($w:タンカー編クリア回数 = 1)	//ＸＸＸＸＸＸＸＸＸ
	command 無線設定 \
	-call 14085 \
		t:RPD_P004_02_R01_ノード初接続２無線デモ１＿vc110405 \
		d:CODEC_DIRECT 終わり_p
}
proc	rp_d_P004_02_R01ノード初接続２無線デモ１＿vc110406 {
	eval($w:タンカー編クリア回数 = 1)	//ＸＸＸＸＸＸＸＸＸ
	command 無線設定 \
	-call 14085 \
		t:RPD_P004_02_R01_ノード初接続２無線デモ１＿vc110406 \
		d:CODEC_DIRECT 終わり_p
}
// ------------------------------------------------
proc	rp_d_P005_03_R01ライデン昇降機上昇３無線デモ１＿vc110501 {
	command 無線設定 \
	-call 14085 \
		t:RPD_P005_03_R01ライデン昇降機上昇３無線デモ１＿vc110501 \
		d:CODEC_DIRECT 終わり_p
}
// ------------------------------------------------
proc	rp_d_P005_05_R02ライデン昇降機上昇５無線デモ２＿vc110511 {
	command 無線設定 \
	-call 14085 \
		t:RPD_P005_05_R02_ライデン昇降機上昇５無線デモ２＿vc110511 \
		d:CODEC_DIRECT 終わり_p 
}

// ------------------------------------------------
proc	rp_d_P006_01_R01Ａ脚金網１無線デモ１＿vc110601 {
	command 無線設定 \
	-call 14112 \
		t:RPD_P006_01_R01_Ａ脚金網１無線デモ１＿vc110601 \
		d:CODEC_DIRECT 終わり_p
}
// ------------------------------------------------
proc	rp_d_P007_01_R01Ａ脚ノード前１無線デモ１＿vc110701 {
	command 無線設定 \
	-call 14112 \
		t:RPD_P007_01_R01_Ａ脚ノード前１無線デモ１＿１＿vc110701 \
		d:CODEC_DIRECT 終わり_p
}
proc	rp_d_P007_01_R01Ａ脚ノード前１無線デモ１＿vc110702 {
	command 無線設定 \
	-call 14112 \
		t:RPD_P007_01_R01_Ａ脚ノード前１無線デモ１＿１＿vc110702 \
		d:CODEC_DIRECT 終わり_p
}
proc	rp_d_P007_01_R01Ａ脚ノード前１無線デモ１＿vc110703 {
	command 無線設定 \
	-call 14112 \
		t:RPD_P007_01_R01_Ａ脚ノード前１無線デモ１＿１＿vc110703 \
		d:CODEC_DIRECT 終わり_p
}
// ------------------------------------------------
proc	rp_d_P008_01_R01ＡＢ連絡橋１無線デモ１＿vc110801 {
	command 無線設定 \
	-call 14112 \
		t:RPD_P008_01_R01_ＡＢ連絡橋１無線デモ１＿１＿vc110801 \
		d:CODEC_DIRECT 終わり_p
}
proc	rp_d_P008_01_R01ＡＢ連絡橋１無線デモ１＿vc110802 {
	command 無線設定 \
	-call 14112 \
		t:RPD_P008_01_R01_ＡＢ連絡橋１無線デモ１＿１＿vc110802 \
		d:CODEC_DIRECT 終わり_p
}
proc	rp_d_P008_01_R01ＡＢ連絡橋１無線デモ１＿vc110803 {
	command 無線設定 \
	-call 14112 \
		t:RPD_P008_01_R01_ＡＢ連絡橋１無線デモ１＿１＿vc110803 \
		d:CODEC_DIRECT 終わり_p
}

proc	rp_d_P009_01_R01_サイファー遭遇１無線デモ１＿vc110901 {
	command 無線設定 \
	-call 14112 \
		t:RPD_P009_01_R01_サイファー遭遇１無線デモ１＿１＿vc110901 \
		d:CODEC_DIRECT 終わり_p
}
proc	rp_d_P009_01_R01_サイファー遭遇１無線デモ１＿vc110902 {
	command 無線設定 \
	-call 14112 \
		t:RPD_P009_01_R01_サイファー遭遇１無線デモ１＿１＿vc110902 \
		d:CODEC_DIRECT 終わり_p
}
proc	rp_d_P009_01_R01_サイファー遭遇１無線デモ１＿vc110903 {
	command 無線設定 \
	-call 14112 \
		t:RPD_P009_01_R01_サイファー遭遇１無線デモ１＿１＿vc110903 \
		d:CODEC_DIRECT 終わり_p
}

// ------------------------------------------------
proc	rp_d_P010_04_R01ヴァンプ遭遇４無線デモ１＿vc111001 {
	command 無線設定 \
	-call 14112 \
		t:RPD_P010_04_R01_ヴァンプ遭遇４無線デモ１＿１＿vc111001 \
		d:CODEC_DIRECT 終わり_p
}
// ------------------------------------------------
proc	rp_d_P011_01_R01ＢＣ連絡橋ＣＡＬＬ１無線デモ１＿vc111101 {
	command 無線設定 \
	-call 14112 \
		t:RPD_P011_01_R01_ＢＣ連絡橋ＣＡＬＬ１無線デモ１＿vc111101 \
		d:CODEC_DIRECT 終わり_p
}
// ------------------------------------------------
proc	rp_d_P012_02_R01_フォーチュン遭遇２無線デモ１＿vc111201 {
	command 無線設定 \
	-call 14112 \
		t:RPD_P012_02_R01_フォーチュン遭遇２無線デモ１＿vc111201 \
		d:CODEC_DIRECT 終わり_p
}
// ------------------------------------------------
proc	rp_d_P013_01_R01_ライデン危機無線１無線デモ１＿vc111301 {
	command 無線設定 \
	-call 14112 \
		t:RPD_P013_01_R01_ライデン危機無線１無線デモ１＿vc111301 \
		d:CODEC_DIRECT 終わり_p
}
// ------------------------------------------------
proc	rp_d_P014_05_R01ピーター遭遇５無線デモ１＿vc111401 {
	command 無線設定 \
	-call 14085 \
		t:RPD_P014_05_R01_ピーター遭遇５無線デモ１＿vc111401 \
		d:CODEC_DIRECT 終わり_p
}
// ------------------------------------------------
proc	rp_d_P015_01_R1爆弾解体最初の一つ１無線デモ１＿vc111501 {
	command 無線設定 \
	-call 14085 \
		t:RPD_P015_01_R1_爆弾解体最初の一つ１無線デモ１＿vc111501 \
		d:CODEC_DIRECT 終わり_p
}
// ------------------------------------------------
proc	rp_d_P016_01_R1爆弾解体半分解体１無線デモ１＿vc111601 {
	command 無線設定 \
	-call 14112 \
		t:RPD_P016_01_R1_爆弾解体半分解体１無線デモ１＿vc111601 \
		d:CODEC_DIRECT 終わり_p
}
// ------------------------------------------------
proc	rp_d_P017_01_R01爆弾解体中ローズその１無線デモ１＿vc111701 {
	command 無線設定 \
	-call 14112 \
		t:RPD_P017_01_R01_爆弾解体中ローズその１無線デモ１＿vc111701 \
		d:CODEC_DIRECT 終わり_p
}
// ------------------------------------------------
proc	rp_d_P018_01_R01爆弾解体中ローズその２無線デモ１＿vc111801 {
	command 無線設定 \
	-call 14112 \ 
		t:RPD_P018_01_R01_爆弾解体中ローズその２無線デモ１＿vc111801 \
		d:CODEC_DIRECT 終わり_p
}
// ------------------------------------------------
proc	rp_d_P019_01_R01爆弾解体中ローズその３無線デモ１＿vc111901 {
	command 無線設定 \
	-call 14112 \
		t:RPD_P019_01_R01_爆弾解体中ローズその３無線デモ１＿vc111901 \
		d:CODEC_DIRECT 終わり_p
}

proc	rp_d_P020_01_R01_地雷原１無線デモ１＿vc112001 {
	command 無線設定 \
	-call 14112 \
		t:RPD_P020_01_R01_地雷原１無線デモ１＿vc112001 \
		d:CODEC_DIRECT 終わり_p
}
proc	rp_d_P020_01_R01_地雷原１無線デモ１＿vc112002 {
	command 無線設定 \
	-call 14112 \
		t:RPD_P020_01_R01_地雷原１無線デモ１＿vc112002 \
		d:CODEC_DIRECT 終わり_p
}

proc	rp_d_P020_01_R01_地雷原１無線デモ１＿２＿vc112003 {
	command 無線設定 \
	-call 14112 \
		t:RPD_P020_01_R01_地雷原１無線デモ１＿２＿vc112003 \
		d:CODEC_DIRECT 終わり_p
}

proc	rp_d_P021_02_R01_爆弾解体オルガ登場２無線デモ１＿vc112101 {
	command 無線設定 \
	-call 14112 \
		t:RPD_P021_02_R01_爆弾解体オルガ登場２無線デモ１＿vc112101 \
		d:CODEC_DIRECT 終わり_p
}

// ------------------------------------------------
proc	rp_d_P022_01_R01爆弾解体最後から二つ目１無線デモ１＿vc112201 {
	command 無線設定 \
	-call 14112 \
		t:RPD_P022_01_R01_爆弾解体最後から二つ目１無線デモ１＿vc112201 \
		d:CODEC_DIRECT 終わり_p
}
proc	rp_d_P022_01_R01爆弾解体最後から二つ目１無線デモ１＿vc112202 {
	command 無線設定 \
	-call 14112 \
		t:RPD_P022_01_R01_爆弾解体最後から二つ目１無線デモ１＿vc112202 \
		d:CODEC_DIRECT 終わり_p
}
// ------------------------------------------------
proc	rp_d_P023_01_R01爆弾解体最後の一つ１無線デモ１＿vc112301 {
	command 無線設定 \
	-call 14112 \
		t:RPD_P023_01_R01_爆弾解体最後の一つ１無線デモ１＿vc112301 \
		d:CODEC_DIRECT 終わり_p
}

proc	rp_d_P023_01_R01爆弾解体最後の一つ１無線デモ１＿vc112302 {
	command 無線設定 \
	-call 14112 \
		t:RPD_P023_01_R01_爆弾解体最後の一つ１無線デモ１＿vc112302 \
		d:CODEC_DIRECT 終わり_p
}
proc	rp_d_P023_01_R01爆弾解体最後の一つ１無線デモ１＿vc112303 {
	command 無線設定 \
	-call 14112 \
		t:RPD_P023_01_R01_爆弾解体最後の一つ１無線デモ１＿vc112303 \
		d:CODEC_DIRECT 終わり_p
}
proc	rp_d_P023_01_R01爆弾解体最後の一つ１無線デモ１＿vc112304 {
	command 無線設定 \
	-call 14112 \
		t:RPD_P023_01_R01_爆弾解体最後の一つ１無線デモ１＿vc112304 \
		d:CODEC_DIRECT 終わり_p
}
proc	rp_d_P023_01_R01爆弾解体最後の一つ１無線デモ１＿vc112305 {
	command 無線設定 \
	-call 14112 \
		t:RPD_P023_01_R01_爆弾解体最後の一つ１無線デモ１＿vc112305 \
		d:CODEC_DIRECT 終わり_p
}

// ------------------------------------------------
proc	rp_d_P024_01_R01爆弾解体センサーＢ入手１無線デモ１＿vc112401 {
	command 無線設定 \
	-call 14112 \
		t:RPD_P024_01_R01_爆弾解体センサーＢ入手１無線デモ１＿vc112401 \
		d:CODEC_DIRECT 終わり_p
}
proc	rp_d_P024_01_R01爆弾解体センサーＢ入手１無線デモ１＿vc112407 {
	command 無線設定 \
	-call 14112 \
		t:RPD_P024_01_R01_爆弾解体センサーＢ入手１無線デモ１＿vc112407 \
		d:CODEC_DIRECT 終わり_p
}
proc	rp_d_P024_01_R01爆弾解体センサーＢ入手１無線デモ１＿vc112406 {
	command 無線設定 \
	-call 14112 \
		t:RPD_P024_01_R01_爆弾解体センサーＢ入手１無線デモ１＿vc112406 \
		d:CODEC_DIRECT 終わり_p
}
proc	rp_d_P024_01_R01爆弾解体センサーＢ入手１無線デモ１＿vc112402 {
	command 無線設定 \
	-call 14112 \
		t:RPD_P024_01_R01_爆弾解体センサーＢ入手１無線デモ１＿vc112402 \
		d:CODEC_DIRECT 終わり_p
}
proc	rp_d_P024_01_R01爆弾解体センサーＢ入手１無線デモ１＿vc112403 {
	command 無線設定 \
	-call 14112 \
		t:RPD_P024_01_R01_爆弾解体センサーＢ入手１無線デモ１＿vc112403 \
		d:CODEC_DIRECT 終わり_p
}
proc	rp_d_P024_01_R01爆弾解体センサーＢ入手１無線デモ１＿vc112404 {
	command 無線設定 \
	-call 14112 \
		t:RPD_P024_01_R01_爆弾解体センサーＢ入手１無線デモ１＿vc112404 \
		d:CODEC_DIRECT 終わり_p
}
proc	rp_d_P024_01_R01爆弾解体センサーＢ入手１無線デモ１＿vc112405 {
	command 無線設定 \
	-call 14112 \
		t:RPD_P024_01_R01_爆弾解体センサーＢ入手１無線デモ１＿vc112405 \
		d:CODEC_DIRECT 終わり_p
}
// ------------------------------------------------
proc	rp_d_P025_01_R01爆弾解体昇降機下１無線デモ１＿vc112501 {
	command 無線設定 \
	-call 14112 \
		t:RPD_P025_01_R01_爆弾解体昇降機下１無線デモ１＿vc112501 \
		d:CODEC_DIRECT 終わり_p
}
proc	rp_d_P025_01_R01爆弾解体昇降機下１無線デモ１＿vc112502 {
	command 無線設定 \
	-call 14112 \
		t:RPD_P025_01_R01_爆弾解体昇降機下１無線デモ１＿vc112502 \
		d:CODEC_DIRECT 終わり_p
}
// ------------------------------------------------
proc	rp_d_P026_01_R01爆弾解体終了１無線デモ１＿vc112601 {
	command 無線設定 \
	-call 14112 \
		t:RPD_P026_01_R01_爆弾解体終了１無線デモ１＿vc112601 \
		d:CODEC_DIRECT 終わり_p
}

// ------------------------------------------------
proc	rp_d_P027_01_R01爆弾解体後昇降機ホール１無線デモ１＿vc112701 {
	command 無線設定 \
	-call 14112 \
		t:RPD_P027_01_R01_爆弾解体後昇降機ホール１無線デモ１＿vc112701 \
		d:CODEC_DIRECT 終わり_p
}
// ------------------------------------------------
proc	rp_d_P030_01_R01フォーチュン戦中無線無線デモ１＿vc113001 {
	command 無線設定 \
	-call 14112 \
		t:RPD_P030_01_R01_フォーチュン戦中無線無線デモ１＿vc113001 \
		d:CODEC_DIRECT 終わり_p
}
proc	rp_d_P030_01_R01フォーチュン戦中無線無線デモ１＿vc113002 {
	command 無線設定 \
	-call 14112 \
		t:RPD_P030_01_R01_フォーチュン戦中無線無線デモ１＿vc113002 \
		d:CODEC_DIRECT 終わり_p
}
proc	rp_d_P030_01_R01フォーチュン戦中無線無線デモ１＿vc113003 {
	command 無線設定 \
	-call 14112 \
		t:RPD_P030_01_R01_フォーチュン戦中無線無線デモ１＿vc113003 \
		d:CODEC_DIRECT 終わり_p
}
proc	rp_d_P030_01_R01フォーチュン戦中無線無線デモ１＿vc113004 {
	command 無線設定 \
	-call 14112 \
		t:RPD_P030_01_R01_フォーチュン戦中無線無線デモ１＿vc113004 \
		d:CODEC_DIRECT 終わり_p
}
proc	rp_d_P030_01_R01フォーチュン戦中無線無線デモ１＿vc113005 {
	command 無線設定 \
	-call 14112 \
		t:RPD_P030_01_R01_フォーチュン戦中無線無線デモ１＿vc113005 \
		d:CODEC_DIRECT 終わり_p
}
proc	rp_d_P030_01_R01フォーチュン戦中無線無線デモ１＿vc113006 {
	command 無線設定 \
	-call 14112 \
		t:RPD_P030_01_R01_フォーチュン戦中無線無線デモ１＿vc113006 \
		d:CODEC_DIRECT 終わり_p
}
// ------------------------------------------------
proc	rp_d_P035_01_R01ファットマン爆弾解体終了１無線デモ１＿vc113501 {
	command 無線設定 \
	-call 14112 \
		t:RPD_P035_01_R01_ファットマン爆弾解体終了１無線デモ１＿vc113501 \
		d:CODEC_DIRECT 終わり_p
}

proc	rp_d_P035_01_R01ファットマン爆弾解体終了１無線デモ１＿２＿vc113502 {
	command 無線設定 \
	-call 14112 \
		t:RPD_P035_01_R01_ファットマン爆弾解体終了１無線デモ１＿２＿vc113502 \
		d:CODEC_DIRECT 終わり_p
}

// ------------------------------------------------
proc	rp_d_P036_03_R01忍者登場３無線デモ１＿vc113601 {
	command 無線設定 \
	-call 14112 \
		t:RPD_P036_03_R01_忍者登場３無線デモ１＿vc113601 \
		d:CODEC_DIRECT 終わり_p
}
// ------------------------------------------------
proc	rp_d_P036_08_R02忍者登場８無線デモ２＿vc113611 {
	command 無線設定 \
	-call 14112 \
		t:RPD_P036_08_R02_忍者登場８無線デモ２＿vc113611 \
		d:CODEC_DIRECT 終わり_p
}
// ------------------------------------------------
proc	rp_d_P036_10_R03忍者登場１０無線デモ３＿vc113621 {
	command 無線設定 \
	-call 14112 \
		t:RPD_P036_10_R03_忍者登場１０無線デモ３＿vc113621 \
		d:CODEC_DIRECT 終わり_p
}
// ------------------------------------------------
proc	rp_d_P036_13_R04忍者登場１３無線デモ４＿vc113631 {
	command 無線設定 \
	-call 14112 \
		t:RPD_P036_13_R04_忍者登場１３無線デモ４＿vc113631 \
		d:CODEC_DIRECT 終わり_p
}
// ------------------------------------------------
proc	rp_d_P037_01_R01スネークの遺体１無線デモ１＿vc113701 {
	command 無線設定 \
	-call 14112 \
		t:RPD_P037_01_R01_スネークの遺体１無線デモ１＿vc113701 \
		d:CODEC_DIRECT 終わり_p
}
// ------------------------------------------------
proc	rp_d_P040_02_R02エイムズ発見２無線デモ１＿vc114001 {
	command 無線設定 \
	-call 14112 \
		t:RPD_P040_02_R02_エイムズ発見２無線デモ１＿vc114001 \
		d:CODEC_DIRECT 終わり_p
}

// ------------------------------------------------
proc	rp_d_P040_06_R02エイムズ発見６無線デモ２＿１＿vc114011 {
	command 無線設定 \
	-call 14112 \
		t:RPD_P040_06_R02_エイムズ発見６無線デモ２＿１＿vc114011 \
		d:CODEC_DIRECT 終わり_p
}
proc	rp_d_P040_06_R02エイムズ発見６無線デモ２＿１＿vc114013 {
	command 無線設定 \
	-call 14112 \
		t:RPD_P040_06_R02_エイムズ発見６無線デモ２＿１＿vc114013 \
		d:CODEC_DIRECT 終わり_p
}

proc	rp_d_P040_06_R02エイムズ発見６無線デモ２＿１＿vc114012 {
	command 無線設定 \
	-call 14112 \
		t:RPD_P040_06_R02_エイムズ発見６無線デモ２＿１＿vc114012 \
		d:CODEC_DIRECT 終わり_p
}

// ------------------------------------------------
// ------------------------------------------------
proc	rp_d_P041_02_R01エイムズ死亡後２無線デモ１＿vc114101 {
	command 無線設定 \
	-call 14112 \
		t:RPD_P041_02_R01_エイムズ死亡後２無線デモ１＿vc114101 \
		d:CODEC_DIRECT 終わり_p
}
// ------------------------------------------------
proc	rp_d_P042_01_R01シェル１シェル２連絡橋１無線デモ１＿vc114201 {
	command 無線設定 \
	-call 14112 \
		t:RPD_P042_01_R01_シェル１シェル２連絡橋１無線デモ１＿vc114201 \
		d:CODEC_DIRECT 終わり_p
}
// ------------------------------------------------
proc	rp_d_P044_01_R01赤外線センサークリア１無線デモ１＿vc114401 {
	command 無線設定 \
	-call 14112 \
		t:RPD_P044_01_R01_赤外線センサークリア１無線デモ１＿vc114401 \
		d:CODEC_DIRECT 終わり_p
}

proc	rp_d_P044_01_R01赤外線センサークリア１無線デモ１＿２＿vc114402 {
	command 無線設定 \
	-call 14112 \
		t:RPD_P044_01_R01_赤外線センサークリア１無線デモ１＿２＿vc114402 \
		d:CODEC_DIRECT 終わり_p
}

// ------------------------------------------------
proc	rp_d_P046_02_R01ハリアー戦勝利２無線デモ１＿vc114601 {
	command 無線設定 \
	-call 14112 \
		t:RPD_P046_02_R01_ハリアー戦勝利２無線デモ１＿１＿vc114601 \
		d:CODEC_DIRECT 終わり_p
}

proc	rp_d_P046_02_R01ハリアー戦勝利２無線デモ１＿２＿vc114602 {
	command 無線設定 \
	-call 14112 \
		t:RPD_P046_02_R01_ハリアー戦勝利２無線デモ１＿２＿vc114602 \
		d:CODEC_DIRECT 終わり_p
}
proc	rp_d_P046_02_R01ハリアー戦勝利２無線デモ１＿２＿vc114603 {
	command 無線設定 \
	-call 14112 \
		t:RPD_P046_02_R01_ハリアー戦勝利２無線デモ１＿２＿vc114603 \
		d:CODEC_DIRECT 終わり_p
}

// ------------------------------------------------
proc	rp_d_P047_05_R01電撃床前オルガ５無線デモ１＿vc114701 {
	command 無線設定 \
	-call 14112 \
		t:RPD_P047_05_R01_電撃床前オルガ５無線デモ１＿vc114701 \
		d:CODEC_DIRECT 終わり_p
}
proc	rp_d_P047_05_R01電撃床前オルガ５無線デモ１＿vc114702 {
	command 無線設定 \
	-call 14112 \
		t:RPD_P047_05_R01_電撃床前オルガ５無線デモ１＿vc114702 \
		d:CODEC_DIRECT 終わり_p
}
proc	rp_d_P047_05_R01電撃床前オルガ５無線デモ１＿vc114703 {
	command 無線設定 \
	-call 14112 \
		t:RPD_P047_05_R01_電撃床前オルガ５無線デモ１＿vc114703 \
		d:CODEC_DIRECT 終わり_p
}
// ------------------------------------------------
proc	rp_d_P049_02_R01大統領２無線機デモ１＿vc114901 {
	command 無線設定 \
	-call 14112 \
		t:RPD_P049_02_R01_大統領２無線機デモ１＿vc114901 \
		d:CODEC_DIRECT 終わり_p
}
proc	rp_d_P049_02_R01大統領２無線機デモ１＿vc114902 {
	command 無線設定 \
	-call 14112 \
		t:RPD_P049_02_R01_大統領２無線機デモ１＿vc114902 \
		d:CODEC_DIRECT 終わり_p
}


// ------------------------------------------------
proc	rp_d_P049_05_R02大統領５無線機デモ２＿vc114911 {
	command 無線設定 \
	-call 14112 \
		t:RPD_P049_02_R01_大統領５無線機デモ２＿vc114911 \
		d:CODEC_DIRECT 終わり_p
}
// ------------------------------------------------
proc	rp_d_P049_08_R03大統領８無線機デモ３＿vc114921 {
	command 無線設定 \
	-call 14112 \
		t:RPD_P049_08_R03_大統領８無線機デモ３＿vc114921 \
		d:CODEC_DIRECT 終わり_p
}
// ------------------------------------------------
proc	rp_d_P049_10_R04大統領１０無線機デモ４＿vc114931 {
	command 無線設定 \
	-call 14112 \
		t:RPD_P049_10_R04_大統領１０無線機デモ４＿vc114931 \
		d:CODEC_DIRECT 終わり_p
}
// ------------------------------------------------
proc	rp_d_P049_12_R05大統領１２無線機デモ５＿vc114941 {
	command 無線設定 \
	-call 14112 \
		t:RPD_P049_12_R05_大統領１２無線機デモ５＿vc114941 \
		d:CODEC_DIRECT 終わり_p
}
// ------------------------------------------------
proc	rp_d_P050_01_R01タンカー編整理１無線機デモ１＿vc115001 {
	command 無線設定 \
	-call 14112 \
		t:RPD_P050_01_R01_タンカー編整理１無線機デモ１＿vc115001 \
		d:CODEC_DIRECT 終わり_p
}
// ------------------------------------------------
proc	rp_d_P050_04_R02タンカー編整理４無線機デモ２＿vc115011 {
	command 無線設定 \
	-call 14112 \
		t:RPD_P050_04_R02_タンカー編整理４無線機デモ２＿vc115011 \
		d:CODEC_DIRECT 終わり_p
}
// ------------------------------------------------
proc	rp_d_P050_06_R03タンカー編整理６無線機デモ３＿vc115021 {
	command 無線設定 \
	-call 14112 \
		t:RPD_P050_06_R03_タンカー編整理６無線機デモ３＿vc115021 \
		d:CODEC_DIRECT 終わり_p
}
// ------------------------------------------------
proc	rp_d_P051_01_R01エマとオタコン１無線機デモ１＿vc115101 {
	command 無線設定 \
	-call 14112 \
		t:RPD_P051_01_R01_エマとオタコン１無線機デモ１＿vc115101 \
		d:CODEC_DIRECT 終わり_p
}

// ------------------------------------------------
proc	rp_d_P052_01_R01ローズ無線１無線機デモ１＿vc115201 {
	command 無線設定 \
	-call 14112 \
		t:RPD_P052_01_R01_ローズ無線１無線機デモ１＿vc115201 \
		d:CODEC_DIRECT 終わり_p
}
// ------------------------------------------------
proc	rp_d_P053_01_R01息継ぎ１無線機デモ１＿vc115301 {
	command 無線設定 \
	-call 14112 \
		t:RPD_P053_01_R01_息継ぎ１無線機デモ１＿vc115301 \
		d:CODEC_DIRECT 終わり_p
}
proc	rp_d_P053_01_R01息継ぎ１無線機デモ１＿vc115302 {
	command 無線設定 \
	-call 14112 \
		t:RPD_P053_01_R01_息継ぎ１無線機デモ１＿vc115302 \
		d:CODEC_DIRECT 終わり_p
}
proc	rp_d_P053_01_R01息継ぎ１無線機デモ１＿vc115303 {
	command 無線設定 \
	-call 14112 \
		t:RPD_P053_01_R01_息継ぎ１無線機デモ１＿vc115303 \
		d:CODEC_DIRECT 終わり_p
}

// ------------------------------------------------
proc	rp_d_P057_02_R01ヴァンプ戦終了２無線機デモ１＿vc115701 {
	command 無線設定 \
	-call 14112 \
		t:RPD_P057_02_R01_ヴァンプ戦終了２無線機デモ１＿vc115701 \
		d:CODEC_DIRECT 終わり_p
}

proc	rp_d_P057_02_R01ヴァンプ戦終了２無線機デモ１＿２＿vc115702 {
	command 無線設定 \
	-call 14112 \
		t:RPD_P057_02_R01_ヴァンプ戦終了２無線機デモ１＿２＿vc115702 \
		d:CODEC_DIRECT 終わり_p
}
proc	rp_d_P057_02_R01ヴァンプ戦終了２無線機デモ１＿２＿vc115703 {
	command 無線設定 \
	-call 14112 \
		t:RPD_P057_02_R01_ヴァンプ戦終了２無線機デモ１＿２＿vc115703 \
		d:CODEC_DIRECT 終わり_p
}

// ------------------------------------------------
proc	rp_d_P058_02_R01エマ救出２無線機デモ１＿vc115801 {
	command 無線設定 \
	-call 14112 \
		t:RPD_P058_02_R01_エマ救出２無線機デモ１＿vc115801 \
		d:CODEC_DIRECT 終わり_p
}
// ------------------------------------------------
proc	rp_d_P058_04_R02エマ救出４無線機デモ２＿vc115811 {
	command 無線設定 \
	-call 14112 \
		t:RPD_P058_04_R02_エマ救出４無線機デモ２＿vc115811 \
		d:CODEC_DIRECT 終わり_p
}
// ------------------------------------------------
proc	rp_d_P058_07_R03エマ救出７無線機デモ３＿vc115821 {
	command 無線設定 \
	-call 14112 \
		t:RPD_P058_07_R03_エマ救出７無線機デモ３＿vc115821 \
		d:CODEC_DIRECT 終わり_p
}
// ------------------------------------------------
proc	rp_d_P059_03_R01エマ休憩３無線機デモ１＿vc115901 {
	command 無線設定 \
	-call 14112 \
		t:RPD_P059_03_R01_エマ休憩３無線機デモ１＿vc115901 \
		d:CODEC_DIRECT 終わり_p
}
proc	rp_d_P059_03_R01エマ休憩３無線機デモ１＿vc115902 {
	command 無線設定 \
	-call 14112 \
		t:RPD_P059_03_R01_エマ休憩３無線機デモ１＿vc115902 \
		d:CODEC_DIRECT 終わり_p
}
proc	rp_d_P059_03_R01エマ休憩３無線機デモ１＿vc115903 {
	command 無線設定 \
	-call 14112 \
		t:RPD_P059_03_R01_エマ休憩３無線機デモ１＿vc115903 \
		d:CODEC_DIRECT 終わり_p
}
// ------------------------------------------------
proc	rp_d_P061_01_R01エマとオタコン１無線機デモ１＿vc116101 {
	command 無線設定 \
	-call 14112 \
		t:RPD_P061_01_R01_エマとオタコン１無線機デモ１＿vc116101 \
		d:CODEC_DIRECT 終わり_p
}
proc	rp_d_P061_01_R01エマとオタコン１無線機デモ１＿vc116102 {
	command 無線設定 \
	-call 14112 \
		t:RPD_P061_01_R01_エマとオタコン１無線機デモ１＿vc116102 \
		d:CODEC_DIRECT 終わり_p
}
proc	rp_d_P061_01_R01エマとオタコン１無線機デモ１＿vc116103 {
	command 無線設定 \
	-call 14112 \
		t:RPD_P061_01_R01_エマとオタコン１無線機デモ１＿vc116103 \
		d:CODEC_DIRECT 終わり_p
}
// ------------------------------------------------
proc	rp_d_P062_03_R01エマとＡＩ３無線機デモ１＿vc116201 {
	command 無線設定 \
	-call 14112 \
		t:RPD_P062_03_R01_エマとＡＩ３無線機デモ１＿vc116201 \
		d:CODEC_DIRECT 終わり_p
}
// ------------------------------------------------
proc	rp_d_P062_05_R02エマとＡＩ５無線機デモ２＿vc116211 {
	command 無線設定 \
	-call 14112 \
		t:RPD_P062_05_R02_エマとＡＩ５無線機デモ２＿vc116211 \
		d:CODEC_DIRECT 終わり_p
}
// ------------------------------------------------
proc	rp_d_P064_01_R01エマライデンローズ無線１無線機デモ１＿vc116401 {
	command 無線設定 \
	-call 14112 \
		t:RPD_P064_01_R01_エマライデンローズ無線１無線機デモ１＿vc116401 \
		d:CODEC_DIRECT 終わり_p
}
// ------------------------------------------------
proc	rp_d_P065_02_R01エマＬ脚２無線機デモ１＿vc116501 {
	command 無線設定 \
	-call 14112 \
		t:RPD_P065_02_R01_エマＬ脚２無線機デモ１＿vc116501 \
		d:CODEC_DIRECT 終わり_p
}
// ------------------------------------------------
proc	rp_d_P065_06_R02Ｌ脚エマ６無線機デモ２＿vc116511 {
	command 無線設定 \
	-call 14112 \
		t:RPD_P065_06_R02_Ｌ脚エマ６無線機デモ２＿vc116511 \
		d:CODEC_DIRECT 終わり_p
}
proc	rp_d_P065_06_R02Ｌ脚エマ６無線機デモ２＿vc116512 {
	command 無線設定 \
	-call 14112 \
		t:RPD_P065_06_R02_Ｌ脚エマ６無線機デモ２＿vc116512 \
		d:CODEC_DIRECT 終わり_p
}
proc	rp_d_P065_06_R02Ｌ脚エマ６無線機デモ２＿vc116513 {
	command 無線設定 \
	-call 14112 \
		t:RPD_P065_06_R02_Ｌ脚エマ６無線機デモ２＿vc116513 \
		d:CODEC_DIRECT 終わり_p
}
proc	rp_d_P065_06_R02Ｌ脚エマ６無線機デモ２＿vc116514 {
	command 無線設定 \
	-call 14112 \
		t:RPD_P065_06_R02_Ｌ脚エマ６無線機デモ２＿vc116514 \
		d:CODEC_DIRECT 終わり_p
}
// ------------------------------------------------
proc	rp_d_P067_01_R01エマ狙撃１無線機デモ１＿vc116701 {
	command 無線設定 \
	-call 14112 \
		t:RPD_P067_01_R01_エマ狙撃１無線機デモ１＿vc116701 \
		d:CODEC_DIRECT 終わり_p
}
// ------------------------------------------------
proc	rp_d_P069_02_R01ヴァンプ狙撃終了２無線機デモ１＿vc116901 {
	command 無線設定 \
	-call 14112 \
		t:RPD_P069_02_R01_ヴァンプ狙撃終了２無線機デモ１＿vc116901 \
		d:CODEC_DIRECT 終わり_p
}
// ------------------------------------------------
proc	rp_d_P069_04_R02ヴァンプ狙撃終了４無線機デモ２＿vc116911 {
	command 無線設定 \
	-call 14112 \
		t:RPD_P069_04_R02_ヴァンプ狙撃終了４無線機デモ２＿vc116911 \
		d:CODEC_DIRECT 終わり_p
}
// ------------------------------------------------
proc	rp_d_P070_10_R01ＡＧ起動１０無線機デモ１＿vc117001 {
	command 無線設定 \
	-call 14112 \
		t:RPD_P070_10_R01_ＡＧ起動１０無線機デモ１＿vc117001 \
		d:CODEC_DIRECT 終わり_p
}
proc	rp_d_P070_10_R01ＡＧ起動１０無線機デモ１＿vc117002 {
	command 無線設定 \
	-call 14112 \
		t:RPD_P070_10_R01_ＡＧ起動１０無線機デモ１＿vc117002 \
		d:CODEC_DIRECT 終わり_p
}
// ------------------------------------------------
proc	rp_d_P070_18_R02ＡＧ起動１８無線機デモ２＿vc117011 {
	command 無線設定 \
	-call 14112 \
		t:RPD_P070_18_R02_ＡＧ起動１８無線機デモ２＿vc117011 \
		d:CODEC_DIRECT 終わり_p
}
// ------------------------------------------------
proc	rp_d_P070_20_R03ＡＧ起動２０無線機デモ３＿vc117021 {
	command 無線設定 \
	-call 14112 \
		t:RPD_P070_20_R03_ＡＧ起動２０無線機デモ３＿vc117021 \
		d:CODEC_DIRECT 終わり_p
}
// ------------------------------------------------
proc	rp_d_P070_23_R04ＡＧ起動２３無線機デモ４＿vc117031 {
	command 無線設定 \
	-call 14112 \
		t:RPD_P070_23_R04_ＡＧ起動２３無線機デモ４＿vc117031 \
		d:CODEC_DIRECT 終わり_p
}
// ------------------------------------------------
proc	rp_d_P071_01_R01拷問部屋脱出１無線機デモ１＿vc117102 {
	command 無線設定 \
	-call 14112 \
		t:RPD_P071_01_R01_拷問部屋脱出１無線機デモ１＿vc117102 \
		d:CODEC_DIRECT 終わり_p
}
proc	rp_d_P071_01_R01拷問部屋脱出１無線機デモ１＿vc117103 {
	command 無線設定 \
	-call 14112 \
		t:RPD_P071_01_R01_拷問部屋脱出１無線機デモ１＿vc117103 \
		d:CODEC_DIRECT 終わり_p
}
// ------------------------------------------------
proc	rp_d_P072_01_R01大佐混乱１無線機デモ１＿vc117201 {
	command 無線設定 \
	-call 14112 \
		t:RPD_P072_01_R01_大佐混乱１無線機デモ１＿vc117201 \
		d:CODEC_DIRECT 終わり_p
}
// ------------------------------------------------
proc	rp_d_P073_01_R01通路Ａ１無線機デモ１＿vc117301 {
	command 無線設定 \
	-call 14112 \
		t:RPD_P073_01_R01_通路Ａ１無線機デモ１＿vc117301 \
		d:CODEC_DIRECT 終わり_p
}
// ------------------------------------------------
proc	rp_d_P073_03_R02通路Ａ３無線機デモ２＿vc117311 {
	command 無線設定 \
	-call 14112 \
		t:RPD_P073_03_R02_通路Ａ３無線機デモ２＿vc117311 \
		d:CODEC_DIRECT 終わり_p
}
// ------------------------------------------------
proc	rp_d_P074_02_R01通路Ａ刀後２無線機デモ１＿vc117401 {
	command 無線設定 \
	-call 14112 \
		t:RPD_P074_02_R01_通路Ａ刀後２無線機デモ１＿vc117401 \
		d:CODEC_DIRECT 終わり_p
}
// ------------------------------------------------
proc	rp_d_P075_01_R01オタコン無事１無線機デモ１＿vc117501 {
	command 無線設定 \
	-call 14112 \
		t:RPD_P075_01_R01_オタコン無事１無線機デモ１＿vc117501 \
		d:CODEC_DIRECT 終わり_p
}
// ------------------------------------------------
proc	rp_d_P076_01_R01大佐ＡＩ１無線機デモ１＿vc117601 {
	command 無線設定 \
	-call 14112 \
		t:RPD_P076_01_R01_大佐ＡＩ１無線機デモ１＿vc117601 \
		d:CODEC_DIRECT 終わり_p
}
// ------------------------------------------------
proc	rp_d_P077_01_R01ローズ拉致１無線機デモ１＿vc117701 {
	command 無線設定 \
	-call 14112 \
		t:RPD_P077_01_R01_ローズ拉致１無線機デモ１＿vc117701 \
		d:CODEC_DIRECT 終わり_p
}
// ------------------------------------------------
proc	rp_d_P080_19_R01ＡＧ浮上１９無線機デモ１＿vc118002 {
	command 無線設定 \
	-call 14112 \
		t:RPD_P080_19_R01_ＡＧ浮上１９無線機デモ１＿vc118002 \
		d:CODEC_DIRECT 終わり_p
}
proc	rp_d_P080_19_R01ＡＧ浮上１９無線機デモ１＿vc118011 {
	command 無線設定 \
	-call 14112 \
		t:RPD_P080_19_R01_ＡＧ浮上１９無線機デモ１＿vc118011 \
		d:CODEC_DIRECT 終わり_p
}
// ------------------------------------------------
proc	rp_d_P080_21_R02ＡＧ浮上２１無線機デモ２＿vc118011 {
	command 無線設定 \
	-call 14112 \
		t:RPD_P080_21_R02_ＡＧ浮上２１無線機デモ２＿vc118011 \
		d:CODEC_DIRECT 終わり_p
}
// ------------------------------------------------
proc	rp_d_P080_23_R03ＡＧ浮上２３無線機デモ３＿vc118021 {
	command 無線設定 \
	-call 14112 \
		t:RPD_P080_23_R03_ＡＧ浮上２３無線機デモ３＿vc118021 \
		d:CODEC_DIRECT 終わり_p
}
// ------------------------------------------------
proc	rp_d_P080_25_R04ＡＧ浮上２５無線機デモ４＿vc118031 {
	command 無線設定 \
	-call 14112 \
		t:RPD_P080_25_R04_ＡＧ浮上２５無線機デモ４＿vc118031 \
		d:CODEC_DIRECT 終わり_p
}
// ------------------------------------------------


/*---------------------------------------------------
セレクトキャラセットだにゅん。
----------------------------------------------------*/
proc enter_demo_p_vc {
//	eval($f:rfp_enter_demo_p_vc = 1)
	eval($f:rfp_enter_codec_debug_mode_p_demo_vc = 1)
	restart
}

proc codec_set_demo_p_vc {
	chara select demo_vc -s {
		'P001_02_R01_P006_01_R01' enter_p_vc_P001_02_R01_P006_01_R01 
		'P007_01_R01_P016_01_R01' enter_p_vc_P007_01_R01_P016_01_R01 
		'P017_01_R01_P026_01_R01' enter_p_vc_P017_01_R01_P026_01_R01 
		'P027_01_R01_P040_02_R02' enter_p_vc_P027_01_R01_P040_02_R02 
		'P040_06_R02_P049_02_R01' enter_p_vc_P040_06a_R02a_P049_02_R01 
		'P049_05_R02_P052_01_R01' enter_p_vc_P049_05_R02_P052_01_R01 
		'P053_01_R01_P062_05_R02' enter_p_vc_P053_01_R01_P062_05_R02 
		'P064_01_R01_P070_23_R04' enter_p_vc_P064_01_R01_P070_23_R04 
		'P071_01_R01_P080_21_R02' enter_p_vc_P071_01_R01_P080_21_R02 
		'P080_23_R03_P080_25_R04' enter_p_vc_P080_23_R03_P080_25_R04 
//		'back' back_to_root_p_vc_demo
		'exit' exit_codec_debug_mode_p_vc
	}
}


proc enter_p_vc_P001_02_R01_P006_01_R01 {
//	eval($f:rfp_enter_demo_p = 0)
	eval($f:rfp_enter_p_vc_P001_02_R01nt_P006_01_R01 = 1)
	restart
}

proc enter_p_vc_P007_01_R01_P016_01_R01 {
//	eval($f:rfp_enter_demo_p = 0)
	eval($f:rfp_enter_p_vc_P007_01_R01_P016_01_R01 = 1)
	restart
}

proc enter_p_vc_P017_01_R01_P026_01_R01 {
//	eval($f:rfp_enter_demo_p = 0)
	eval($f:rfp_enter_p_vc_P017_01_R01_P026_01_R01 = 1)
	restart
}

proc enter_p_vc_P027_01_R01_P040_02_R02 {
//	eval($f:rfp_enter_demo_p = 0)
	eval($f:rfp_enter_p_vc_P027_01_R01_P040_02_R02 = 1)
	restart
}

proc enter_p_vc_P040_06a_R02a_P049_02_R01 {
//	eval($f:rfp_enter_demo_p = 0)
	eval($f:rfp_enter_p_vc_P040_06a_R02a_P049_02_R01 = 1)
	restart
}

proc enter_p_vc_P049_05_R02_P052_01_R01 {
//	eval($f:rfp_enter_demo_p = 0)
	eval($f:rfp_enter_p_vc_P049_05_R02_P052_01_R01 = 1)
	restart
}
proc enter_p_vc_P053_01_R01_P062_05_R02 {
//	eval($f:rfp_enter_demo_p = 0)
	eval($f:rfp_enter_p_vc_P053_01_R01_P062_05_R02 = 1)
	restart
}
proc enter_p_vc_P064_01_R01_P070_23_R04 {
//	eval($f:rfp_enter_demo_p = 0)
	eval($f:rfp_enter_p_vc_P064_01_R01_P070_23_R04 = 1)
	restart
}
proc enter_p_vc_P071_01_R01_P080_21_R02 {
//	eval($f:rfp_enter_demo_p = 0)
	eval($f:rfp_enter_p_vc_P071_01_R01_P080_21_R02 = 1)
	restart
}

proc enter_p_vc_P080_23_R03_P080_25_R04 {
//	eval($f:rfp_enter_demo_p = 0)
	eval($f:rfp_enter_p_vc_P080_23_R03_P080_25_R04 = 1)
	restart
}




proc codec_set_p_vc_P001_02_R01nt_P006_01_R01 {
	chara select P001_02_R01nt_P006_01_R01 -s {
		'P001_02_R01_vc110101' rp_d_P001_02_R01オープニング潜入２無線デモ１＿vc110101
		'P001_02_R01_vc110102' rp_d_P001_02_R01オープニング潜入２無線デモ１＿vc110102
		'P001_02_R01_vc110103' rp_d_P001_02_R01オープニング潜入２無線デモ１＿vc110103
		'P001_02_R01_vc110104' rp_d_P001_02_R01オープニング潜入２無線デモ１＿vc110104
		'P001_02_R01_vc110105' rp_d_P001_02_R01オープニング潜入２無線デモ１＿vc110105
		'P001_02_R01_vc110106' rp_d_P001_02_R01オープニング潜入２無線デモ１＿vc110106
		'P001_02_R01_vc110107' rp_d_P001_02_R01オープニング潜入２無線デモ１＿vc110107
		'P001_02_R01_vc110108' rp_d_P001_02_R01オープニング潜入２無線デモ１＿vc110108
		'P001_04_R02_vc110111' rp_d_P001_04_R02オープニング潜入４無線デモ２＿vc110111 
		'P001_04_R02_vc110112' rp_d_P001_04_R02オープニング潜入４無線デモ２＿vc110112 
		'P002_02_R01_vc110201' rp_d_P002_02_R01Ａ脚底部連結ハッチ２無線デモ１＿vc110201 
		'P003_02_R02_vc110301' rp_d_P003_02_R02スネーク昇降機上昇２無線デモ１＿vc110301
		'P003_02_R02_vc110302' rp_d_P003_02_R02スネーク昇降機上昇２無線デモ１＿vc110302
		'P003_02_R02_vc110303' rp_d_P003_02_R02スネーク昇降機上昇２無線デモ１＿vc110303
		'P003_02_R02_vc110304' rp_d_P003_02_R02スネーク昇降機上昇２無線デモ１＿vc110304
		'P003_02_R02_vc110305' rp_d_P003_02_R02スネーク昇降機上昇２無線デモ１＿vc110305
		'P004_02_R01_vc110401' rp_d_P004_02_R01ノード初接続２無線デモ１＿vc110401 
		'P004_02_R01_vc110402' rp_d_P004_02_R01ノード初接続２無線デモ１＿vc110402 
		'P004_02_R01_vc110403' rp_d_P004_02_R01ノード初接続２無線デモ１＿vc110403 
		'P004_02_R01_vc110407' rp_d_P004_02_R01ノード初接続２無線デモ１＿vc110407 
		'P004_02_R01_vc110404' rp_d_P004_02_R01ノード初接続２無線デモ１＿vc110404 
		'P004_02_R01_vc110405' rp_d_P004_02_R01ノード初接続２無線デモ１＿vc110405 
		'P004_02_R01_vc110406' rp_d_P004_02_R01ノード初接続２無線デモ１＿vc110406 
		'P005_03_R01_vc110501' rp_d_P005_03_R01ライデン昇降機上昇３無線デモ１＿vc110501 
		'P005_05_R02_vc110511' rp_d_P005_05_R02ライデン昇降機上昇５無線デモ２＿vc110511 
		'P006_01_R01_vc110601' rp_d_P006_01_R01Ａ脚金網１無線デモ１＿vc110601 
		'back' back_to_root_p_vc_demo
		'exit' exit_codec_debug_mode_p_vc
	}
}

proc codec_set_p_vc_P007_01_R01_P016_01_R01 {
	chara select P007_01_R01_P016_01_R01 -s {
		'P007_01_R01_vc110701' rp_d_P007_01_R01Ａ脚ノード前１無線デモ１＿vc110701 
		'P007_01_R01_vc110702' rp_d_P007_01_R01Ａ脚ノード前１無線デモ１＿vc110702 
		'P007_01_R01_vc110703' rp_d_P007_01_R01Ａ脚ノード前１無線デモ１＿vc110703 
		'P008_01_R01_vc110801' rp_d_P008_01_R01ＡＢ連絡橋１無線デモ１＿vc110801 
		'P008_01_R01_vc110802' rp_d_P008_01_R01ＡＢ連絡橋１無線デモ１＿vc110802 
		'P008_01_R01_vc110803' rp_d_P008_01_R01ＡＢ連絡橋１無線デモ１＿vc110803 
		'P009_01_R01_vc110901' rp_d_P009_01_R01_サイファー遭遇１無線デモ１＿vc110901 
		'P009_01_R01_vc110902' rp_d_P009_01_R01_サイファー遭遇１無線デモ１＿vc110902 
		'P009_01_R01_vc110903' rp_d_P009_01_R01_サイファー遭遇１無線デモ１＿vc110903 
		'P010_04_R01_vc111001' rp_d_P010_04_R01ヴァンプ遭遇４無線デモ１＿vc111001 
		'P011_01_R01_vc111101' rp_d_P011_01_R01ＢＣ連絡橋ＣＡＬＬ１無線デモ１＿vc111101 
		'P012_02_R01_vc111201' rp_d_P012_02_R01_フォーチュン遭遇２無線デモ１＿vc111201 
		'P013_01_R01_vc111301' rp_d_P013_01_R01_ライデン危機無線１無線デモ１＿vc111301 
		'P014_05_R01_vc111401' rp_d_P014_05_R01ピーター遭遇５無線デモ１＿vc111401 
		'P015_01_R01_vc111501' rp_d_P015_01_R1爆弾解体最初の一つ１無線デモ１＿vc111501 
		'P016_01_R01_vc111601' rp_d_P016_01_R1爆弾解体半分解体１無線デモ１＿vc111601 
		'back' back_to_root_p_vc_demo
		'exit' exit_codec_debug_mode_p_vc
	}
}

proc codec_set_p_vc_P017_01_R01_P026_01_R01 {
	chara select P017_01_R01_P026_01_R01 -s {
		'P017_01_R01_vc111701' rp_d_P017_01_R01爆弾解体中ローズその１無線デモ１＿vc111701 
		'P018_01_R01_vc111801' rp_d_P018_01_R01爆弾解体中ローズその２無線デモ１＿vc111801 
		'P019_01_R01_vc111901' rp_d_P019_01_R01爆弾解体中ローズその３無線デモ１＿vc111901
		'P020_01_R01_1_vc112001' rp_d_P020_01_R01_地雷原１無線デモ１＿vc112001 
		'P020_01_R01_1_vc112002' rp_d_P020_01_R01_地雷原１無線デモ１＿vc112002 
		'P020_01_R01_2_vc112003' rp_d_P020_01_R01_地雷原１無線デモ１＿２＿vc112003
		'P021_02_R01_vc112101' rp_d_P021_02_R01_爆弾解体オルガ登場２無線デモ１＿vc112101 
		'P022_01_R01_vc112201' rp_d_P022_01_R01爆弾解体最後から二つ目１無線デモ１＿vc112201 
		'P022_01_R01_vc112202' rp_d_P022_01_R01爆弾解体最後から二つ目１無線デモ１＿vc112202 
		'P023_01_R01_vc112301' rp_d_P023_01_R01爆弾解体最後の一つ１無線デモ１＿vc112301 
		'P023_01_R01_vc112302' rp_d_P023_01_R01爆弾解体最後の一つ１無線デモ１＿vc112302
		'P023_01_R01_vc112303' rp_d_P023_01_R01爆弾解体最後の一つ１無線デモ１＿vc112303
		'P023_01_R01_vc112304' rp_d_P023_01_R01爆弾解体最後の一つ１無線デモ１＿vc112304
		'P023_01_R01_vc112305' rp_d_P023_01_R01爆弾解体最後の一つ１無線デモ１＿vc112305
		'P024_01_R01_vc112401' rp_d_P024_01_R01爆弾解体センサーＢ入手１無線デモ１＿vc112401 
		'P024_01_R01_vc112407' rp_d_P024_01_R01爆弾解体センサーＢ入手１無線デモ１＿vc112407 
		'P024_01_R01_vc112406' rp_d_P024_01_R01爆弾解体センサーＢ入手１無線デモ１＿vc112406 
		'P024_01_R01_vc112402' rp_d_P024_01_R01爆弾解体センサーＢ入手１無線デモ１＿vc112402 
		'P024_01_R01_vc112403' rp_d_P024_01_R01爆弾解体センサーＢ入手１無線デモ１＿vc112403 
		'P024_01_R01_vc112404' rp_d_P024_01_R01爆弾解体センサーＢ入手１無線デモ１＿vc112404 
		'P024_01_R01_vc112405' rp_d_P024_01_R01爆弾解体センサーＢ入手１無線デモ１＿vc112405 
		'P025_01_R01_vc112501' rp_d_P025_01_R01爆弾解体昇降機下１無線デモ１＿vc112501 
		'P025_01_R01_vc112502' rp_d_P025_01_R01爆弾解体昇降機下１無線デモ１＿vc112502 
		'P026_01_R01_vc112601' rp_d_P026_01_R01爆弾解体終了１無線デモ１＿vc112601 
		'back' back_to_root_p_vc_demo
		'exit' exit_codec_debug_mode_p_vc
	}
}

proc codec_set_p_vc_P027_01_R01_P040_02_R02 {
	chara select P027_01_R01_P040_02_R02 -s {
		'P027_01_R01_vc112701' rp_d_P027_01_R01爆弾解体後昇降機ホール１無線デモ１＿vc112701 
		'P030_01_R01_vc113001' rp_d_P030_01_R01フォーチュン戦中無線無線デモ１＿vc113001 
		'P030_01_R01_vc113002' rp_d_P030_01_R01フォーチュン戦中無線無線デモ１＿vc113002 
		'P030_01_R01_vc113003' rp_d_P030_01_R01フォーチュン戦中無線無線デモ１＿vc113003 
		'P030_01_R01_vc113004' rp_d_P030_01_R01フォーチュン戦中無線無線デモ１＿vc113004 
		'P030_01_R01_vc113005' rp_d_P030_01_R01フォーチュン戦中無線無線デモ１＿vc113005 
		'P030_01_R01_vc113006' rp_d_P030_01_R01フォーチュン戦中無線無線デモ１＿vc113006 
		'P035_01_R01_vc113501' rp_d_P035_01_R01ファットマン爆弾解体終了１無線デモ１＿vc113501 
		'P035_01_R01_2_vc113502' rp_d_P035_01_R01ファットマン爆弾解体終了１無線デモ１＿２＿vc113502 
		'P036_03_R01_vc113601' rp_d_P036_03_R01忍者登場３無線デモ１＿vc113601 
		'P036_08_R02_vc113611' rp_d_P036_08_R02忍者登場８無線デモ２＿vc113611 
		'P036_10_R03_vc113621' rp_d_P036_10_R03忍者登場１０無線デモ３＿vc113621 
		'P036_13_R04_vc113631' rp_d_P036_13_R04忍者登場１３無線デモ４＿vc113631 
		'P037_01_R01_vc113701' rp_d_P037_01_R01スネークの遺体１無線デモ１＿vc113701 
		'P040_02_R02_vc114001' rp_d_P040_02_R02エイムズ発見２無線デモ１＿vc114001 
		'back' back_to_root_p_vc_demo
		'exit' exit_codec_debug_mode_p_vc
	}
}

proc codec_set_p_vc_P040_06a_R02a_P049_02_R01 {
	chara select P040_06a_R02a_P049_02_R01 -s {
		'P040_06_R02_vc114011' rp_d_P040_06_R02エイムズ発見６無線デモ２＿１＿vc114011
		'P040_06_R02_vc114013' rp_d_P040_06_R02エイムズ発見６無線デモ２＿１＿vc114013
		'P040_06_R02_vc114012' rp_d_P040_06_R02エイムズ発見６無線デモ２＿１＿vc114012
		'P041_02_R01_vc114101' rp_d_P041_02_R01エイムズ死亡後２無線デモ１＿vc114101 
		'P042_01_R01_vc114201' rp_d_P042_01_R01シェル１シェル２連絡橋１無線デモ１＿vc114201 
		'P044_01_R01_1_vc114401' rp_d_P044_01_R01赤外線センサークリア１無線デモ１＿vc114401 
		'P044_01_R01_2_vc114402' rp_d_P044_01_R01赤外線センサークリア１無線デモ１＿２＿vc114402 
		'P046_02_R01_1_vc114601' rp_d_P046_02_R01ハリアー戦勝利２無線デモ１＿vc114601 
		'P046_02_R01_2_vc114602' rp_d_P046_02_R01ハリアー戦勝利２無線デモ１＿２＿vc114602 
		'P046_02_R01_2_vc114603' rp_d_P046_02_R01ハリアー戦勝利２無線デモ１＿２＿vc114603 
		'P047_05_R01_vc114701' rp_d_P047_05_R01電撃床前オルガ５無線デモ１＿vc114701 
		'P047_05_R01_vc114702' rp_d_P047_05_R01電撃床前オルガ５無線デモ１＿vc114702 
		'P047_05_R01_vc114703' rp_d_P047_05_R01電撃床前オルガ５無線デモ１＿vc114703 
		'P049_02_R01_vc114901' rp_d_P049_02_R01大統領２無線機デモ１＿vc114901 
		'P049_02_R01_vc114902' rp_d_P049_02_R01大統領２無線機デモ１＿vc114902 
		'back' back_to_root_p_vc_demo
		'exit' exit_codec_debug_mode_p_vc
	}
}

proc codec_set_p_vc_P049_05_R02_P052_01_R01 {
	chara select P049_05_R02_P052_01_R01 -s {
		'P049_05_R02_vc114911' rp_d_P049_05_R02大統領５無線機デモ２＿vc114911 
		'P049_08_R03_vc114921' rp_d_P049_08_R03大統領８無線機デモ３＿vc114921 
		'P049_10_R04_vc114931' rp_d_P049_10_R04大統領１０無線機デモ４＿vc114931 
		'P049_12_R05_vc114941' rp_d_P049_12_R05大統領１２無線機デモ５＿vc114941 
		'P050_01_R01_vc115001' rp_d_P050_01_R01タンカー編整理１無線機デモ１＿vc115001 
		'P050_04_R02_vc115011' rp_d_P050_04_R02タンカー編整理４無線機デモ２＿vc115011 
		'P050_06_R03_vc115021' rp_d_P050_06_R03タンカー編整理６無線機デモ３＿vc115021 
		'P051_01_R01_vc115101' rp_d_P051_01_R01エマとオタコン１無線機デモ１＿vc115101 
		'P052_01_R01_vc115201' rp_d_P052_01_R01ローズ無線１無線機デモ１＿vc115201 
		'back' back_to_root_p_vc_demo
		'exit' exit_codec_debug_mode_p_vc
	}
}

proc codec_set_p_vc_P053_01_R01_P062_05_R02 {
	chara select P053_01_R01_P062_05_R02 -s {
		'P053_01_R01_vc115301' rp_d_P053_01_R01息継ぎ１無線機デモ１＿vc115301 
		'P053_01_R01_vc115302' rp_d_P053_01_R01息継ぎ１無線機デモ１＿vc115302 
		'P053_01_R01_vc115303' rp_d_P053_01_R01息継ぎ１無線機デモ１＿vc115303 
		'P057_02_R01_1_vc115701' rp_d_P057_02_R01ヴァンプ戦終了２無線機デモ１＿vc115701 
		'P057_02_R01_2_vc115702' rp_d_P057_02_R01ヴァンプ戦終了２無線機デモ１＿２＿vc115702 
		'P057_02_R01_2_vc115703' rp_d_P057_02_R01ヴァンプ戦終了２無線機デモ１＿２＿vc115703 
		'P058_02_R01_vc115801' rp_d_P058_02_R01エマ救出２無線機デモ１＿vc115801 
		'P058_04_R02_vc115811' rp_d_P058_04_R02エマ救出４無線機デモ２＿vc115811 
		'P058_07_R03_vc115821' rp_d_P058_07_R03エマ救出７無線機デモ３＿vc115821 
		'P059_03_R01_vc115901' rp_d_P059_03_R01エマ休憩３無線機デモ１＿vc115901 
		'P059_03_R01_vc115902' rp_d_P059_03_R01エマ休憩３無線機デモ１＿vc115902 
		'P059_03_R01_vc115903' rp_d_P059_03_R01エマ休憩３無線機デモ１＿vc115903 
		'P061_01_R01_vc116101' rp_d_P061_01_R01エマとオタコン１無線機デモ１＿vc116101 
		'P061_01_R01_vc116102' rp_d_P061_01_R01エマとオタコン１無線機デモ１＿vc116102 
		'P061_01_R01_vc116103' rp_d_P061_01_R01エマとオタコン１無線機デモ１＿vc116103 
		'P062_03_R01_vc116201' rp_d_P062_03_R01エマとＡＩ３無線機デモ１＿vc116201 
		'P062_05_R02_vc116211' rp_d_P062_05_R02エマとＡＩ５無線機デモ２＿vc116211 
		'back' back_to_root_p_vc_demo
		'exit' exit_codec_debug_mode_p_vc
	}
}

proc codec_set_p_vc_P064_01_R01_P070_23_R04 {
	chara select P064_01_R01_P070_23_R04 -s {
		'P064_01_R01_vc116401' rp_d_P064_01_R01エマライデンローズ無線１無線機デモ１＿vc116401 
		'P065_02_R01_vc116501' rp_d_P065_02_R01エマＬ脚２無線機デモ１＿vc116501 
		'P065_06_R02_vc116511' rp_d_P065_06_R02Ｌ脚エマ６無線機デモ２＿vc116511 
		'P065_06_R02_vc116512' rp_d_P065_06_R02Ｌ脚エマ６無線機デモ２＿vc116512 
		'P065_06_R02_vc116513' rp_d_P065_06_R02Ｌ脚エマ６無線機デモ２＿vc116513 
		'P065_06_R02_vc116514' rp_d_P065_06_R02Ｌ脚エマ６無線機デモ２＿vc116514 
		'P067_01_R01_vc116701' rp_d_P067_01_R01エマ狙撃１無線機デモ１＿vc116701 
		'P069_02_R01_vc116901' rp_d_P069_02_R01ヴァンプ狙撃終了２無線機デモ１＿vc116901 
		'P069_04_R02_vc116911' rp_d_P069_04_R02ヴァンプ狙撃終了４無線機デモ２＿vc116911 
		'P070_10_R01_vc117001' rp_d_P070_10_R01ＡＧ起動１０無線機デモ１＿vc117001 
		'P070_10_R01_vc117002' rp_d_P070_10_R01ＡＧ起動１０無線機デモ１＿vc117002 
		'P070_18_R02_vc117011' rp_d_P070_18_R02ＡＧ起動１８無線機デモ２＿vc117011 
		'P070_20_R03_vc117021' rp_d_P070_20_R03ＡＧ起動２０無線機デモ３＿vc117021 
		'P070_23_R04_vc117031' rp_d_P070_23_R04ＡＧ起動２３無線機デモ４＿vc117031 
		'back' back_to_root_p_vc_demo
		'exit' exit_codec_debug_mode_p_vc
	}
}

proc codec_set_p_vc_P071_01_R01_P080_21_R02 {
	chara select P071_01_R01_P080_21_R02 -s {
		'P071_01_R01_vc117102' rp_d_P071_01_R01拷問部屋脱出１無線機デモ１＿vc117102 
		'P071_01_R01_vc117103' rp_d_P071_01_R01拷問部屋脱出１無線機デモ１＿vc117103 
		'P072_01_R01_vc117201' rp_d_P072_01_R01大佐混乱１無線機デモ１＿vc117201 
		'P073_01_R01_vc117301' rp_d_P073_01_R01通路Ａ１無線機デモ１＿vc117301 
		'P073_03_R02_vc117311' rp_d_P073_03_R02通路Ａ３無線機デモ２＿vc117311 
		'P074_02_R01_vc117401' rp_d_P074_02_R01通路Ａ刀後２無線機デモ１＿vc117401 
		'P075_01_R01_vc117501' rp_d_P075_01_R01オタコン無事１無線機デモ１＿vc117501 
		'P076_01_R01_vc117601' rp_d_P076_01_R01大佐ＡＩ１無線機デモ１＿vc117601 
		'P077_01_R01_vc117701' rp_d_P077_01_R01ローズ拉致１無線機デモ１＿vc117701 
		'P080_19_R01_vc118002' rp_d_P080_19_R01ＡＧ浮上１９無線機デモ１＿vc118002 
		'P080_19_R01_vc118011' rp_d_P080_19_R01ＡＧ浮上１９無線機デモ１＿vc118011 
		'P080_21_R02_vc118011' rp_d_P080_21_R02ＡＧ浮上２１無線機デモ２＿vc118011 
		'back' back_to_root_p_vc_demo
		'exit' exit_codec_debug_mode_p_vc
	}
}

proc codec_set_p_vc_P080_23_R03_P080_25_R04 {
	chara select P080_23_R03_P080_25_R04 -s {
		'P080_23_R03_vc118021' rp_d_P080_23_R03ＡＧ浮上２３無線機デモ３＿vc118021 
		'P080_25_R04_vc118031' rp_d_P080_25_R04ＡＧ浮上２５無線機デモ４＿vc118031 
		'back' back_to_root_p_vc_demo
		'exit' exit_codec_debug_mode_p_vc
	}
}




proc codec_debug_list_set_p_demo_vc {
	if($f:rfp_enter_p_vc_P001_02_R01nt_P006_01_R01){
		@codec_set_p_vc_P001_02_R01nt_P006_01_R01

	}else if($f:rfp_enter_p_vc_P007_01_R01_P016_01_R01){
		@codec_set_p_vc_P007_01_R01_P016_01_R01

	}else if($f:rfp_enter_p_vc_P017_01_R01_P026_01_R01){
		@codec_set_p_vc_P017_01_R01_P026_01_R01

	}else if($f:rfp_enter_p_vc_P027_01_R01_P040_02_R02){
		@codec_set_p_vc_P027_01_R01_P040_02_R02
		 
	}else if($f:rfp_enter_p_vc_P040_06a_R02a_P049_02_R01){
		@codec_set_p_vc_P040_06a_R02a_P049_02_R01 

	}else if($f:rfp_enter_p_vc_P049_05_R02_P052_01_R01){
		@codec_set_p_vc_P049_05_R02_P052_01_R01

	}else if($f:rfp_enter_p_vc_P053_01_R01_P062_05_R02){
		@codec_set_p_vc_P053_01_R01_P062_05_R02

	}else if($f:rfp_enter_p_vc_P064_01_R01_P070_23_R04){
		@codec_set_p_vc_P064_01_R01_P070_23_R04

	}else if($f:rfp_enter_p_vc_P071_01_R01_P080_21_R02){
		@codec_set_p_vc_P071_01_R01_P080_21_R02

	}else if($f:rfp_enter_p_vc_P080_23_R03_P080_25_R04){
		@codec_set_p_vc_P080_23_R03_P080_25_R04
		 

	}else {
		@clear_flag_p
		@codec_set_demo_p_vc
//		@codec_debug_list_set_p
	}
}


