resource sname {
	dogtage_location_data:
	'船尾甲板',
	'船橋一階居住区',
	'船橋一階リフレッシュルーム',
	'船橋二階居住区',
	'船橋三階居住区',
	'船橋四階居住区',
	'船橋五階操舵室',
	'航海甲板ウィング',
	'機関室',
	'第二甲板右舷',
	'第二甲板左舷',
	'第一船倉',
	'第二船倉',
	'第三船倉',
	'Ａ脚底部海底ドック',
	'Ａ脚屋上',
	'Ａ脚ポンプ室',
	'ＡＢ連絡橋',
	'Ｂ脚変電室',
	'ＢＣ連絡橋',
	'Ｃ脚食堂',
	'ＣＤ連絡橋',
	'Ｄ脚第一沈殿池',
	'ＤＥ連絡橋',
	'Ｅ脚集配場',
	'Ｅ脚ヘリポート',
	'ＥＦ連絡橋',
	'Ｆ脚倉庫',
	'ＦＡ連絡橋',
	'シェル１中央棟１Ｆ',
	'シェル１中央棟Ｂ１',
	'シェル１中央棟Ｂ１集会場',
	'シェル１中央棟Ｂ２電算室',
	'ＤＧ連絡橋',
	'ＤＧ連絡橋〜ＬＧ連絡橋',
	'Ｌ脚外周〜ＫＬ連絡橋',
	'ＫＬ連絡橋',
	'Ｌ脚汚水処理場',
	'シェル２中央棟１Ｆ空気清浄室',
	'シェル２中央棟Ｂ１第一濾過室',
	'シェル２中央棟Ｂ１第二濾過室',
	'Ｌ脚下部オイルフェンス',
	'アーセナルギア胃',
	'アーセナルギア空腸',
	'アーセナルギア上行結腸',
	'アーセナルギア回腸',
	'アーセナルギアＳ状結腸',
	'アーセナルギア直腸',
	'フェデラルホール',
};
