			//敵兵１ (51)
			t:vc04f000,t:vc04f000_len,	//0「初めてプレイヤーを発見」127f 26
			t:vc04f001,t:vc04f001_len,	//1「初めてプレイヤーを発見２」166f 34
			t:vc04f003,t:vc04f003_len,	//2「プレイヤーを発見」
			t:vc04f004,t:vc04f004_len,	//3「プレイヤーを発見２」
			t:vc04f007,t:vc04f007_len,	//4「不意にプレイヤーを発見」
			t:vc04f00a,t:vc04f00a_len,	//5「駆け込み連絡」
			t:vc04f00b,t:vc04f00b_len,	//6「ダメージを受けた」
			t:vc04f00d,t:vc04f00d_len,	//7「ホールドアップさせられた」146
			t:vc04f00f,t:vc04f00f_len,	//8「銃でダメージを受けた」
			t:vc04f010,t:vc04f010_len,	//9「仲間の死体を発見」
			t:vc04f011,t:vc04f011_len,	//a「仲間の死体を発見２」
			t:vc04f013,t:vc04f013_len,	//b「仲間が攻撃を受けた」
			t:vc04f014,t:vc04f014_len,	//c「仲間が攻撃を受けた２」
			t:vc04f017,t:vc04f017_len,	//d「侵入の痕跡を発見」
			t:vc04f01e,t:vc04f01e_len,	//e「警備の補充を頼む」
			t:vc04f01b,t:vc04f01b_len,	//f「了解」
			t:vc04f01d,t:vc04f01d_len,	//10「応答のなかった隊員は発見できず・・・
			t:vc046000,t:vc046000_len,	//11「配置に戻れ！警備を強化しろ！」
			t:vc04f029,t:vc04f029_len,	//12「異常なし」

			t:vc04f101,t:vc04f101_len,	//13「音がした？」
			t:vc04f102,t:vc04f102_len,	//14「音がした？（回避）」
			t:vc04f103,t:vc04f103_len,	//15「足音がした？」
			t:vc04f104,t:vc04f104_len,	//16「足音がした？（回避）」
			t:vc04f105,t:vc04f105_len,	//17「壊れている……」
			t:vc04e106,t:vc04e106_len,	//18「この本は！？」
			t:vc04f107,t:vc04f107_len,	//19「足跡がある……」
			t:vc04f108,t:vc04f108_len,	//1a「足跡がある……（回避）」
			t:vc04f109,t:vc04f109_len,	//1b「血の跡だ」
			t:vc04f110,t:vc04f110_len,	//1c「血の跡だ（回避）」
			t:vc04f111,t:vc04f111_len,	//1d「誰だ？」
			t:vc04f112,t:vc04f112_len,	//1e「誰だ？（回避）」
			t:vc04f113,t:vc04f113_len,	//1f「大丈夫か？」
			t:vc04f114,t:vc04f114_len,	//20「大丈夫か？（回避）」
			t:vc04f115,t:vc04f115_len,	//21「やられたのか？」
			t:vc04f116,t:vc04f116_len,	//22「やられたのか？（回避）」
			t:vc04f117,t:vc04f117_len,	//23「この箱は？」
			t:vc04f119,t:vc04f119_len,	//24「この箱は？（回避）」
			t:vc04f117,t:vc04f117_len,	//25「あの箱は？」
			t:vc04f119,t:vc04f119_len,	//26「あの箱は？（回避）」
			t:vc04f121,t:vc04f121_len,	//27「お前、ちょっと待て」
			t:vc04f124,t:vc04f124_len,	//28「お前、ちょっと待て（回避）」
			t:vc04f122,t:vc04f122_len,	//29「武器はどうした？」
			t:vc04f125,t:vc04f125_len,	//2a「武器はどうした？（回避）」
			t:vc04f128,t:vc04f128_len,	//2b「なんだその武器は？」
			t:vc04f131,t:vc04f131_len,	//2c「なんだその武器は？（回避）」
			t:vc04f140,t:vc04f140_len,	//2d「その血はどうした？」
			t:vc04f144,t:vc04f144_len,	//2e「その血はどうした？（回避）」
			t:vc04f148,t:vc04f148_len,	//2f「お前、何をしてる？」
			t:vc04f151,t:vc04f151_len,	//30「お前、何をしてる？（回避）」
			t:vc04f203,t:vc04f203_len,	//31「異常は無い（寝言）」
			t:vc04f015,t:vc04f015_len,	//32「敵がどこかにいる。探し出せ」
			t:vc04e036,t:vc04e036_len,	//33「う、はわわ」
			t:vc04e037,t:vc04e037_len,	//34「撃つ気か？はわわ」
			t:vc04e038,t:vc04e038_len,	//35「やるならやれ、はわわ」
			t:vc04f134,t:vc04f134_len,	//36「お前、何故ここにいる」
			t:vc04f137,t:vc04f137_len,	//37「お前、何故ここにいる（回避）」
