//
//	menu_exp.h
//	アイテムメニュー説明文リソース
//
//	2000/10/17	K.Takabe
//	$Id: menu_exp.h,v 1.17 2000/11/20 02:43:34 usr03005 Exp $

resource 武器説明 {
	素手:
		''
	Ｍ９:
//		'ああああああああああああああ｜' ←文字数ものさしっス。
		'Ｍ９｜'\
/*
		'簡易麻酔銃。□ボタンを押すと｜'\
		'構え、離すと撃つ。命中した｜'\
		'場所によって麻酔が効くまでの｜'
		'時間が違ってくる。'
*/
		'簡易麻酔銃。敵を眠らせる事が｜'\
		'出来る。＃｛□、武器｝＃ボタンを押すと構え、'\
		'離すと発砲。サプレッサー、｜'\
		'レーザーポインター装備。'


	ＵＳＰ:
//		'ああああああああああああああ｜' ←文字数ものさしっス。
		'ＵＳＰ｜'\
		'９ｍｍ口径ハンドガン。｜'\
		'＃｛□、武器｝＃ボタンを押すと構え、離すと｜'\
		'発砲。装弾数１５発。銃声で敵に'\
		'気づかれる事があるので注意。'


	ソコム:
		'ソコム'
	ファマス:
		'ファマス'
	ＰＳＧ１:
		'ＰＳＧ１'
	ＳＰＰ１Ｍ:
		'ＳＰＰ１Ｍ'
	ＲＧＢ６:
		'ＲＧＢ６'
	ニキータ:
		'ニキータ'
	スティンガー:
		'スティンガー'
	クレイモア:
		'クレイモア'
	Ｃ４:
		'Ｃ４'
	ステルスカメラ:
		'ステルスカメラ'
	風船:
		'風船'
	チャフ:
//		'ああああああああああああああ｜' ←文字数ものさしっス。
		'チャフ・グレネード｜'\
		'電子妨害用手榴弾。｜'\
		'電子機器を一定時間無効に｜'\
		'出来る。＃｛□、武器｝＃ボタンを押すと構え、'\
		'離すと投げる。'

	スタン:
//		'ああああああああああああああ｜' ←文字数ものさしっス。
		'スタン・グレネード｜'\
		'閃光音響手榴弾。｜'\
		'敵を気絶させることが出来る。｜'\
		'＃｛□、武器｝＃ボタンを押すと構え、｜'\
		'離すと投げる。'

	マイク:
		''
	ブレード:
		''
	凍結スプレー:
		''
	溶解スプレー:
		''
	消化器:
		''
	ロボット:
		''
	ＡＫＳ:
		''
	マガジン:
//		'ああああああああああああああ｜' ←文字数ものさしっス。
		'マガジン｜'\
		'銃の空弾倉。｜'\
		'＃｛□、武器｝＃ボタンを押すと構え、'\
		'離すと投げる。＃｛□、武器｝＃ボタンを｜'\
		'押す強さで投擲距離が変わる。'

	グレネード:
		''
	Ｍ４:
		''
} ;

resource アイテム説明 {
	素手:
		''
	レーション:
//		'ああああああああああああああ｜' ←文字数ものさしっス。
		'レーション｜'\
/*
		'軍用携帯糧食。ＬＩＦＥを回復｜'\
		'出来る。○ボタンで使用。装備｜'\
		'するとＬＩＦＥが無くなった時、'\
		'自動的に使用しＬＩＦＥを回復する。'
*/

/*
		'軍用携帯糧食。ＬＩＦＥを回復出来る。○ボタンで使用。装備しているとＬＩＦＥがゼロになった時、自動的に使用してＬＩＦＥを回復する。'
*/
//		'ああああああああああああああ｜' ←文字数ものさしっス。
		'軍用携帯糧食。＃｛ＬＩＦＥ、ライフ｝＃を回復する。'\
		'＃｛○、決定｝＃ボタンで使用。装備すると｜'\
		'＃｛ＬＩＦＥ、ライフ｝＃が無くなった時、自動的に'\
		'使用して＃｛ＬＩＦＥ、ライフ｝＃を回復出来る。'


	ダミー双眼鏡:
//		'ああああああああああああああ｜' ←文字数ものさしっス。
		'双眼鏡｜'\
		'軍用双眼鏡。遠距離から｜'\
		'偵察を行う事が出来る。｜'\
		'＃｛○、決定｝＃ボタンでズームイン、｜'\
		'＃｛×、キャンセル｝＃ボタンでズームアウト。'

	銃ライト２:
		''
	トライパック:
		'トライパック'
	止血剤:
//		'ああああああああああああああ｜' ←文字数ものさしっス。
		'止血剤｜'\
		'止血用吸収パッド。｜'\
		'出血している時に使うと｜'\
		'血を止める事が出来る。｜'\
		'＃｛○、決定｝＃ボタンで使用。'

	耳栓:
		'耳栓'
		'体験版では出ないハズっす'

	ジアゼパム:
//		'ああああああああああああああ｜' ←文字数ものさしっス。
		'ジアゼパム｜'\
		'ベンゾジアゼピン系抗不安薬。｜'\
		'抗不安作用以外に筋弛緩作用、｜'\
		'自律神経調節作用等もある。｜'\
		'＃｛○、決定｝＃ボタンで使用。'

	ゴル兵制服:
		''
	ペンギン:
		''
	防弾チョッキ:
		''
	ステルス:
		''
	地雷探知器:
		''
	センサーＡ:
		''
	センサーＢ:
		''
	暗視ゴーグル:
		''
	サーマルゴーグル:
		''
	Ｘ線ゴーグル:
		''
	双眼鏡:
//		'ああああああああああああああ｜' ←文字数ものさしっス。
		'双眼鏡｜'\
		'軍用双眼鏡。遠距離から｜'\
		'偵察を行う事が出来る。｜'\
		'＃｛○、決定｝＃ボタンでズームイン、｜'\
		'＃｛×、キャンセル｝＃ボタンでズームアウト。'

	デジカメ:
		''
	ダンボール:
//		'ああああああああああああああ｜' ←文字数ものさしっス。
		'ダンボール箱｜'\
		'輸送用のダンボール箱。'
		'ＴＨＥ ＯＲＡＮＧＥと書いてある。'

	煙草:
//		'ああああああああああああああ｜' ←文字数ものさしっス。
		'煙草｜'\
		'あなたの健康を損なうおそれが｜'\
		'ありますので吸い過ぎに｜'\
		'注意しましょう｜'\
		'喫煙マナーをまもりましょう'\

	カード:
		''
	髭剃り:
		''
	マンティスマスク:
		''
	携帯電話:
		''
	タンカー編カメラ:
		'カメラ'
	雑誌:
		''
	ダンボールＢ:
//		'ああああああああああああああ｜' ←文字数ものさしっス。
		'ダンボール箱｜'\
		'ダンボールで出来た箱。'
	ダンボールＣ:
//		'ああああああああああああああ｜' ←文字数ものさしっス。
		'ダンボール箱｜'\
		'ダンボールで出来た箱。'
	濡れダンボール:
//		'ああああああああああああああ｜' ←文字数ものさしっス。
		'ダンボール箱｜'\
		'輸送用のダンボール箱。'
		'ＴＨＥ ＯＲＡＮＧＥと書いてある。'
		'濡れて傷んでいる。'

	振動センサー:
//		'ああああああああああああああ｜' ←文字数ものさしっス。
		'生体センサー｜'\
		'生体反応を感知するセンサー。｜'\
		'装備すると、敵兵の接近を｜'\
		'振動で知らせる。センサー'
		'以外の振動はオフになる。'
} ;

resource 無線メッセージ {
  応答無し:
    '応答ありません。'
}
