/*
	ファイル名		option_j.rsc
	作成日			2001/08/07
	作者			S.Kaneyoshi
	$Id: option_j.rsc,v 1.8 2002/10/07 09:40:38 usr04761 Exp $
*/

resource オプションの説明日本語 {
VIB:
	'バイブレーション（振動）のＯＮ／ＯＦＦを設定します',
RAD:
	'レーダーのタイプを設定します',
BLD:
	'血の表示のＯＮ／ＯＦＦを設定します',
SND:
	'ステレオ／モノラルの選択をします',
P5_1CH:
	'一部のデモシーンを「ドルビーデジタル5.1ch」で再生',
CAP:
	'字幕のＯＮ／ＯＦＦを設定します',
OWN:
	'主観操作のタイプを設定します',
ITEM:
	'アイテム表示のタイプを設定します',
QUICK:
	'クイックチェンジのタイプを設定します',
SCRADJ:
	'画面位置の調整を行います',
CLRADJ:
	'明度調整画面を表示します',
EXIT:
	'前画面へ戻ります',
COLORADJ:
	'モニター本体の明るさ設定を調整して、|'
	'赤色のラインより下のグレースケールが|'
	'見えなくなるようにすると、モニターの|'
	'明るさがこのゲームを遊ぶのに最も適し|'
	'た状態になります。'
};

resource レーダーの説明日本語 {
RAD_TYPE1:
	'初心者用レーダー イントルード時も表示します',
RAD_TYPE2:
	'標準レーダー イントルード時は非表示にします'
RAD_OFF:
	'レーダーをＯＦＦにします'
}

resource クイックチェンジの説明日本語 {
unequip:
	'選択した武器・装備品を装備/解除します'

previous:
	'前に装備していた武器・装備品と入れかえます'
}
