/*
	ファイル名		pre_story2_j.rsc
	作成日			2001/08/07
	作者			S.Kaneyoshi
	$Id: pre_story2_j.rsc,v 1.9 2002/06/11 04:18:23 usr04761 Exp $
*/

/*****************************************************************************/
// 真実の真実
/*****************************************************************************/
resource 真実の真実日本 {
ページ01:
'　'
'　'
'　'
'　'
'　　シャドーモセスで明かされた驚愕の陰謀'
'　　　　　　ゲイリー・マクゴールデン'
ページ02:
'極寒の地アラスカ・フォックス諸島の遥か北に位置'
'するシャドーモセス島。'
'その断崖に建てられた気象観測所の小屋の中で、私'
'は後ろ手に縛られ、麻袋を頭にすっぽりとかぶせら'
'れて座っていた。'
'外では吹雪が唸り声をあげ、暗く静まっていた。'
'私の回りを少なくとも４人の男が取り囲み、私を質'
'問責めにしている。'
'麻袋に充満するコーヒー豆の香りが、この寒さの中'
'で私にブラジル気分を味わわせる。'

ページ03:
'花を紡いだレーンにチョコレート色の肌をした少女。'
'椰子の木陰からのぞくまぶしすぎる太陽。'
'意識が朦朧としてきた。'
'正面の男がまた同じ質問をする。'
'「もう一度聞く。この光ディスクは何だ」'
'「知らねえ。拾ったんだよ」'
'「何だと、この嘘っぱち野郎！」'
'みぞおちに強烈なパンチが入った。'
'逆流してきたピーナツバターが血の味とともに'
'したたり落ちる。'
ページ04:
'この数十分の間、好きなだけ殴られ、皮膚を刃物で'
'切り刻まれたおかげで体中が痛い。'
'それでも私は断固として口を割らなかった。'
'ここで口を割ってしまったら全てが終わってしまう。'
'いままでどんな危険も省みずに体当たりの取材を続'
'けてきた私だ。'
'この程度で自分の信念を曲げる訳にはいかなかった。'
'「もういい」'
'小屋の奥から声が聞こえた。'

ページ05:
'「ディスクは回収したんだ。早いとこそいつを片づ'
'けて、こんな場所からおさらばしちまおう」'
'回収。'
'その男は「回収」と言った。'
'長年続けてきた記者の勘がピンときた。'
'つまりこの連中はあのディスクの本来の持ち主だと'
'いうことだ。'
'これで全ての謎は白日の下にさらされた。'
'光ディスクに書いてあったことに間違いはなかった。'
'やはりこれは、奴等の陰謀だったのだ！'
ページ06:
'その時！'
'突如窓ガラスが割れ、外の猛吹雪が入り込んできた'
'かと思うと、私を取り囲んでいた連中が小さく悲鳴'
'をあげて次々と床に倒れていった！'
'誰か入って来たのか？　'
'何だ、一体何が起こったのだ！？　'
'動揺する間もなく混乱は収まった。'
'私を苦しめていた連中は一瞬にして動く気配がなく'
'なった。'
'そして足音がひとつ、私の方へ近付いてくる。'
ページ07:
'誰だ？'
'私を救ってくれたのか？'
'それともこの私すらも殺そうというのか？'
'足音の主は私の前で止まった。不思議と人の気配を'
'感じない。'
'その人物は私の頭にかぶせられた麻袋に手をかけ、'
'ゆっくりと上げていった。'
'外の空気が私の顔を冷やし、薄暗い室内に目のピン'
'トが合ってきた。'
'その時、私の目の前に立っていた人物は！?'
ページ08:
'誰もが疑いもせずに暮らしているこの国の影にうご'
'めく陰謀。'
'軍が極秘に開発していた様々な恐怖の兵器。'
'遺伝子操作によって戦闘マシーンへと改造された'
'スーパー兵士たち。'
'特定の人間を確実に死に至らしめる殺人ウイルス。'
'核兵器で武装した歩く戦車。'
'そして私を襲った謎の権力集団の正体とは！？'
ページ09:
'それらは全て、私が入手した謎の光ディスクの中に'
'封印されていた「真実」だ。'
'その全てをここに明かそう。'
'我が国の政府、そしてそれを越える存在が暗躍する'
'影の世界。'
'誰もがその秘密に触れたとしても、決して口に出せ'
'なかった数々の真実を。'
'私は断言する。'
'この本に書かれている事は全て実話であると。'
ページ10:
'そして、あなたがそれを知ったとき、少なくともい'
'ままでのように平穏な気持ちでは暮らしていけない'
'だろう。'
ページ11:
'　'
'　'
'　'
'　'
'　さあ、勇気を持ってページをめくって欲しい。'
ページ12:
'　'
'　'
'　'
'　'
'　　　　　＜突如舞い込んだ郵便物＞'
ページ13:
'それらを明かすには、まず一ヶ月前の話からしなけ'
'ればならない。'
'シャドーモセス島で一命を取りとめる一ヶ月前、'
'ニューヨークの住み慣れたアパートで私は遅めの朝'
'食を取っていた。'
'子供の頃、UFOにさらわれてからというもの耳鳴り'
'が止まらない。'
'家の畑で遊んでいた私は、ぬかるみに足を取られて'
'転倒し、そのまま気を失ってしまった。'
'意識が戻ったときにはもう夜更けだった。'
ページ14:
'後頭部に出来たコブを洗面台の鏡で見ようとした時'
'気付いたのだ。'
'耳の後ろにピンで刺した程の小さい穴が空いている！'
'テレビで見たことがあった。'
'これは宇宙人にさらわれた証拠だ。'
'つまりこういうことだ、転倒してから意識が戻るま'
'での数時間、私はUFOにさらわれていたのだ！'
'だが家の誰に聞いてもUFOを見た人間はおらず、誰'
'一人私の話を信じてはくれなかった。'
ページ15:
'思えば真実を伝える記者になろうと初めて決心した'
'のはあの時だった。'
'……?'
'いや、よく聞くと耳鳴りではない。'
'玄関のブザーだった。'
'先日借金取りに壊されて以来、バリトン担当のコウ'
'モリのように可聴音域ギリギリの高音で鳴くように'
'なった。'
'ドアを開くとそこには郵便屋が立っており、私に厚'
'手の封筒を渡した。'
ページ16:
'まさか爆弾か！？'
'封筒に耳を当てて意識を集中する。'
'だがなんの音も聴こえない。'
'なるほど、最近の時限爆弾はデジタル時計を使って'
'いるからだ。'
'ましてや私が開けたとき爆発する事を意図している'
'ならそのデジタル時計すら必要ない。'
'つまり、音を出さないこの封筒は爆弾であるという'
'可能性が高いというわけだ。'
'恐らく封筒の口を開けると爆発する仕組みだろう。'
ページ17:
'では封筒の下側から開ければ良い。'
'ビリッ。'
'あっ。'
'中身は目にも留まらぬ速さで床へと落ちていった。'
'あなたも気を付けた方がいい。'
'封筒を下から開けるときは、下を上にしてから開け'
'るべきだ。'
'下のまま開ければ中のものは下に落ちる。'
'しかもそれは床に放置されていた食べかけのデリバ'
'リーピザの上に落ちた。'
ページ18:
'いつ食べたものか憶えてないが、博物館に寄贈した'
'いほど太古の代物であることは間違いない。'
'だが幸い中身は爆弾ではなかった。'
'薄いプラスチックのカバーの中にＣＤのような円盤'
'が入っている。'
'ピーナツバター付きのデータ保存用光ディスクだ。'
'七色に輝く円盤はあの日のUFOを私に思い出させる。'
'私は慎重な手つきでその光ディスクをつまみあげた。'
'ラベルが貼られていないので中身はわからない。'
'とりあえず匂うので水洗いした。'
ページ19:
'ディスクを窓際で乾かし、先ほどのピザを食べな'
'がら封筒を調べていると、１枚のコピー紙が内側に'
'張り付いていた。'
'そこにはこう書いてあった。'
'「編集部に送られてきた光ディスクを同封する。'
'　君向きの内容だ。これを元に取材をして欲しい。'
'　まとまった原稿になれば本にしよう。'
'　復帰のチャンスだぞ！'
'　　　　　　　『メガ・サプライズ！』編集長'
'　　　　　　　　　　マックス・スミスソン　　」'
ページ20:
'マックスは古い友人だ。'
'私が若い頃はよく彼のマネージメントで本を書いて'
'いたが、私が物書きをしなくなってからは交流が途'
'絶えていた。'
'復帰のチャンスとは大きなお世話だが有り難い。'
'久しぶりに本を出すか。'
'そう思うと気分が若返る。'
'だが、ここにひとつ、大きな問題があった。'
'光ディスクの中身を見る手段がないのだ！'
ページ21:
'　'
'　'
'　'
'　'
'　　　　＜そこに書かれた驚愕の事実＞'
ページ22:
'私の部屋の隣には貧乏な大学生が住んでいる。'
'パソコンを借りたいときにはいつもここを訪ねる。'
'私が彼の部屋のドアを叩き叫び続けると、彼は寝ぼ'
'けた調子でドアを開け、パソコンを貸してくれた。'
'小箱の口にディスクを入れると小さな音をたててデ'
'ータを読み込み、ディスプレイにファイルのアイコ'
'ンが表示された。'
'『シャドーモセスの真実』と書かれている。'
'だがそのファイルを見ようとしてもエラーが出て開'
'かない。'
ページ23:
'何故だ！'
'なんらかのセキュリティによってロックがかかって'
'いるのか！？　'
'何度試しても開かないファイルに怒りをおぼえキー'
'ボードのいたるところをかじっていると貧乏学生が'
'悲鳴を上げて近付いてきた。'
'彼が私のヨダレをよけながら何文字かタイピングす'
'ると、画面にはアプリケーションの脳天気なロゴが'
'表示され、そしてついに文字がびっしりと書かれた'
'テキストが私の目の前にさらされた！'
ページ24:
'『シャドーモセスの真実　'
'　　　　　　　　　ナスターシャ・ロマネンコ　』'
'　'
'そのテキストの一番上にはそう書かれていた。'
'背後から勝手にディスプレイをのぞき込む貧乏学生'
'のみぞおちを殴って気絶させると、私はその内容を'
'むさぼるように読みふけった。'
'なんという衝撃か！'
'それはまるで凍り付いたカジキで後頭部を打たれた'
'ようなショックだった。'
ページ25:
'知られざる陰謀、ハチャメチャな人体実験、冷酷な'
'軍の秘密兵器。'
'そこには常軌を逸した信じられない出来事が書きつ'
'らねてあったのだ！'
ページ26:
'　'
'　'
'　'
'　'
'　＜光ディスクに刻まれた恐るべき内容とは＞'
ページ27:
'今から二年前、アラスカ・フォックス諸島のさらに'
'北に位置するシャドーモセス島にまつわる、軍の'
'異常行為が報道されたのを有識たるあなたはご存じ'
'のことだろう。'
'オハイオ級原子力潜水艦ディスカバリーが本来の作'
'戦海域を離れシャドーモセス島近海に出現。'
'それに先んじてアラスカ方面に緊急出動していた'
'E-3C AWACSには当時の国防長官ジム・ハウスマン'
'が搭乗。'
ページ28:
'さらにその１６時間後、カレーナ基地から爆弾を積'
'んだ６機のＦ１１７ナイト・ホークがアラスカに向け'
'て離陸していたという、実際に記録が残されている'
'一連の謎の行動。'
'これらについて当時のマスコミ、ジャーナリストは'
'様々な憶測をしていた。'
'第三国の軍事侵攻、軍の一部によるクーデター。'
'この私は、とある雑誌でシャドーモセスはリトル'
'グレイ達のエアポートになっているのだとコメント'
'した。'
ページ29:
'彼等は各地に秘密基地を持つ、最も有名な宇宙人だ。'
'だがこのファイルによれば、それらは全て間違いだ'
'という。'
'そう、そこで起きていたのは史上空前のテロ行為、'
'しかも軍が生み出した最強のスーパー兵士達と脅威'
'の秘密兵器による世界人類滅亡の危機だった。'
'この日、シャドーモセス島にある核兵器廃棄所を'
'非正規戦部隊「＃｛FOXHOUND、フォックスハウンド｝＃」と次世代特殊部隊の'
'スーパー兵士たちが突然、乗っ取ってしまった。'
'そして彼等は核ミサイルを発射すると脅してきた！'
ページ30:
'では私達はなぜ、今こうして生きていられるのだろ'
'うか？　'
'それはその核兵器廃棄所にたった独りで潜入し世界'
'を救った男「ソリッド・スネーク」の活躍があった'
'おかげなのである。'
'恐ろしい事にこの事件の全貌はこんなものではない。'
'政府の陰謀、軍の秘密兵器「核武装した歩く戦車」'
'脅威のヒト遺伝子操作など、まだまだ多くの謎がこ'
'のディスクに記されている。'
ページ31:
'この書ではソリッド・スネークが任務を遂行するう'
'ち、やがて明らかになる政府の陰謀の数々を明らか'
'にしていきたいと思う。'
'だが、それらを今あなたに知らせるのは早いだろう。'
'ディスクの内容はこの＃｛作者らしき人物、ナスターシャ・ロマネンコ｝＃の単なる妄想'
'か創作である可能性も否定は出来ない。'
'では答えよう。'
'この人物は何者なのか。'
ページ32:
'　'
'　'
'　'
'　'
'＜謎の著者、ナスターシャ・ロマネンコの正体＞'
ページ33:
'手始めにインターネットでこの名前を検索してみる'
'といくつかの事実が明らかになった。'
'ナスターシャ・ロマネンコはもともと＃｛国防情報局、DIA｝＃に'
'勤務していたが退局。'
'事件当時はフリーの軍事アナリストだったようだ。'
'つまり核や軍事兵器の知識はお手のもの。'
'実際、この事件でもそこを買われて「ソリッド・ス'
'ネーク」のサポートをしていたとディスクにはある。'
'政府が巧みに隠蔽しようとしたシャドーモセス島'
'の出来事を彼女が知り尽くしているのもそのためだ。'
ページ34:
'多数ある論文や職歴を見ても彼女は大変な反核主義'
'者だったという事がわかる。'
'つまり突然頭がおかしくなったか、小説家に転身を'
'もくろんでいたのでなければ、この様なものを書く'
'人物ではないようだ。'
'では今、彼女はどうしているのだろう。'
'私は彼女の本の出版元であるグローバルエレメント'
'に電話をしてみた。'
'以下はそのやりとりの全貌である。'
ページ35:
'私　：'
'この遊園地の景品ぬいぐるみ野郎、ナスターシャ・'
'ロマネンコという女を知ってるだろ？'
'　'
'相手：'
'言葉に気をつけろポンチキ星人。食べ過ぎのヌガー'
'チョコが脳味噌と入れ替わってるぜ。'
'　'
'ガチャ。'
ページ36:
'何かある。'
'彼らは何かを隠しているのだ！'
'でなければこんな逃げる様に電話を切るはずがない。'
'入手したディスクの内容が事実ならナスターシャ・'
'ロマネンコは今、知りすぎた女として命の危険もあ'
'るはずだ。'
'どこかに姿を隠しているのか、既に殺されてしまっ'
'たのかもしれない。'
'言葉少ない電話の内容が全てを物語っている。'
'彼女は命を狙われているのだ！'
ページ37:
'それが例の事件に関わったせいだと考えればパズル'
'のピースがピタリとはまる。'
'このディスクに書かれたことは事実なのか？'
'私は自分の部屋に戻ると荷造りを始めた。'
'そう。'
'行き先はシャドーモセスだ。'
ページ38:
'　'
'　'
'　'
'　'
'　　　　　　＜そして極寒の地へ＞'
ページ39:
'わが国最北の空港で飛行機を降りると、私はいとこ'
'のジョンディーを訪ねた。'
'ジョンディーはアラスカ海域でカジキ漁業をしてい'
'る漁師だ。'
'私は彼に、漁のついでにシャドーモセス島で私を'
'降ろして欲しいと頼んだ。'
'すると突然彼の顔色は蒼白となり、こわばった目で'
'何度もまばたきを始めた！'
'「シャドーモセス島へ行けだって？　冗談じゃな'
'いよゲイリー。漁師仲間の話じゃ、あのへんは軍隊'
ページ40:
'がウヨウヨしてるってよ。あの島にちょっとでも近'
'付くと眩しいライトで照らされて、中には尋問を受'
'けた奴だっているんだぜ！」'
'私は恐れとともに、真実に近付いた手応えを感じた。'
'「なんだとてめえ。それぐらいでビビるんならお前'
'も一度UFOにさらわれてみやがれ！」'
'「俺には家族だっている。無茶は出来ないんだよ！」'
'「よし、じゃあお前が近づけるところまででいい。'
'その先は俺が泳いで行く」'
'「泳ぐ？　冷凍マグロみたいになっちまうぞ」'
ページ41:
'「なるほど…。そうか、その手があったか」'
'「ん？　何だ？」'
'「大丈夫だ。考えがある」'
'我々は一路シャドーモセスへと出港した。'
ページ42:
'　'
'　'
'　'
'　'
'　　　　　＜シャドーモセスへの道＞'
ページ43:
'船上の寒さと揺れは尋常じゃなかった。'
'私は寒さに震え、海に向かってピーナツバターを吐'
'いてはまた食べた。'
'こうして何日経っただろうか。'
'その日、海図に定規で線を引きながらジョンディー'
'が言った。'
'「悪いけど近付けるのはここまでだ。本当に行くな'
'らここで降りてくれ」'
'海図を見るとシャドーモセスまで軽く10マイル'
'はある。'
ページ44:
'だが半泣きで私を見る彼にこれ以上迷惑をかける訳'
'にはいかない。'
'私は鋼の精神力で決意した。'
'「わかった。準備を手伝ってくれ」'
'作戦はこうだ。'
'中身をくり貫いたカジキに風船を詰め込み、温度を'
'保つためにランプを設置。'
'そして最後に私が入る。'
'足だけを外に出して水を掻くことで前進し、酸素は'
'風船で補給する。'
ページ45:
'島には打ち寄せられた死骸のフリをして上陸。'
'あとは気付かれないようにカジキを抜け出してから'
'存分に調査すればいい。'
'完璧だ。'
'まるでスシ・バーの厨房の様な生臭さに耐えながら'
'私はカジキの皮を被ってデッキの端へと歩いた。'
'ウエットスーツ越しに極寒の風があたる。'
'私はジョンディーに別れを告げ、海に飛び込んだ。'
'その時！'
ページ46:
'着水の勢いでカジキの背骨が私の後頭部を強打した！'
'カジキの中でもがきながら体勢を整えようとする私。'
'だが風船が邪魔をして動きが取れない。'
'みるみる沈むカジキ。'
'がぼがぼと水を呑み込み、必死の思いで足を掻く私。'
'すると突如ランプが倒れ中の火があらわになった。'
'熱い！'
'髪を、顔を容赦なくあぶる炎！'
'こうして私はシャドーモセス島に上陸を果たした。'
ページ47:
'　'
'　'
'　'
'　'
'　　　＜そこで行われていたテロ行為とは＞'
ページ48:
'ここで少し振り返ってみるとしよう。'
'未曾有のテロ事件があったその日、この島では何が'
'起きていたのか。'
'ロマネンコのディスクによるとこうだ。'
'単なる核兵器廃棄所ではなく、陸軍の秘密演習場と'
'もなっていたというシャドーモセス島ではこの日'
'＃｛FOXHOUND、フォックスハウンド｝＃と次世代特殊部隊が演習を行っていた。'
'テロ対策として新設された次世代特殊部隊だが、'
'恐るべき事に彼らには戦闘を目的とした遺伝子強化'
'が行われていたというのだ！'
ページ49:
'我が国最強の兵士たちはこの島で突如蜂起し、現地'
'にいた民間人を人質として捕え、政府に対してある'
'要求を出した。'
'それは、＃｛FOXHOUND、フォックスハウンド｝＃の創設者であり、20世紀最強'
'とも言われた伝説の兵士、ビッグボスの遺体だった。'
'そして、２４時間以内に要求が受け入れられなければ'
'彼等は核を発射すると脅してきたのだ！'
'ここで私はピンときた。'
'遺体を要求するのはそのビッグボスも宇宙人にイン'
'プラントされているからに他ならない。'
ページ50:
'自らの実験体の回収のためにテロを装ったのである'
'と考えれば全てつじつまが合う。'
'政府はこの最強のスーパー兵士達から人質を解放し'
'核発射を阻止させるために、無謀とも思える作戦を'
'とった。'
'テロの首謀者である＃｛FOXHOUND、フォックスハウンド｝＃の元隊員であり'
'かつて武装要塞国家＃｛OUTER HEAVEN、アウターヘブン｝＃、ザンジ'
'バーランドをたったひとりで陥落させた伝説の傭兵'
'ソリッド・スネークを単独で現地に潜入させたのだ。'
'そんな無茶な！'
ページ51:
'とあなたは叫びたくなるかもしれない。'
'たった独りの傭兵に世界の未来を託すなんて、と。'
'私もそう思う。'
'だが後に我々は、この作戦の巧妙な罠に気付かされ'
'ることになる。'
ページ52:
'　'
'　'
'　'
'　'
'　　＜シャドーモセスに実在した軍事施設＞'
ページ53:
'さて、カジキに身をやつしてシャドーモセスに到'
'着した私は、愛用のカジキの皮を海に沈め岩場に隠'
'れていた。'
'氷点下の波が容赦なく打ち付ける。'
'寒い。'
'しかもカジキの背骨に攻撃された後頭部が痛む。'
'私はとりあえず波打ち際のゴミから適当な布きれを'
'取りあげ、頭に巻いて傷を抑えた。'
'海の塩が傷口に染み、しばらくその場で釣られた魚'
'のようにのたうち回った。'
ページ54:
'不気味なほどの静寂感。'
'波が打ち寄せるばかりで、ジョンディーが言ってい'
'た巡回しているはずの兵士も見あたらなければ、目'
'がつぶれそうなほどの明るいライトも見えてこない。'
'それらの話は全て、シャドーモセス島に立ち寄る'
'のを嫌がったジョンディーの作り話だったのだろう'
'か？'
'そう思いながら切り立った崖を見上げると確かに黒'
'く沈んだ巨大な建築物が目に入った。'
ページ55:
'さながら軍事要塞の様なたたずまい、それはディス'
'クにあった核兵器廃棄所、いや、極秘のメタルギア'
'＃｛REX、レックス｝＃研究施設だった！　'
'暗い夜空にも勝る漆黒の存在。'
'遥かトランシルヴァニアにたたずむ吸血鬼の居城を'
'彷彿とさせる威圧感。'
'私はただ圧倒され、その光景に吸い込まれていた。'
'その時！'
'突如背後から何者かが刀で切りつけてきた！　'
'とっさに身をかわすとそいつは私にのしかかる。'
ページ56:
'岩場に倒された私は、なんとかそいつを振り解こう'
'と格闘しながら、その身体をまさぐった。'
'ざらざらした手触り、ウエットスーツのようだがや'
'けに固い。'
'軍の暗殺者か？　'
'しかし何故急に襲ってきたのだ？'
'私は体勢を立て直すと力一杯そいつの腹を殴った。'
'しかし、私の拳は空を切った。'
'腹がない！'
'まさかこいつは…！？'
ページ57:
'カジキだった。'
'息を切らしながら起きあがると、そこには私が捨て'
'たカジキの巨体がでっぷりと横たわっていた。'
'荒波に打たれて主人の元に返ってきたのだ。'
'主人を鋭利な角で襲うとは恩知らずもいいところだ'
'が、こいつも寂しかったのかもしれない。'
'わかった、もうお前を離さない。'
'連れていけば食料にもなるだろう。'
'私はカジキを再びかぶると、施設に登れそうな場所'
'を探した。'
ページ58:
'カジキの皮が邪魔でよく見えないが、島は断崖絶壁'
'で囲まれているようだ。'
'もちろん私一人なら登るのはたやすい。'
'だがカジキには無理だ。'
'すると崖の下にぽっかり空いた洞窟が目に入った。'
'その中から何か光るものが見える。'
'もしかしたら施設の内部につながっているかもしれ'
'ない。'
'私は足場に注意しながら洞窟へと向かった。'
ページ59:
'　'
'　'
'　'
'　'
'　　＜ソリッド・スネークの無線支援要員＞'
ページ60:
'私とカジキとは異なり、オハイオ級戦略ミサイル原'
'子力潜水艦ディスカバリー号によって島に潜入した'
'ソリッド・スネーク。'
'単身乗り込んだ彼だが、無線による支援が後方にひ'
'かえていた。'
'スネークの元上官であり、ディスカバリーから作戦'
'全体の指揮をとるロイ・キャンベル大佐。'
'同じくディスカバリーのナオミ・ハンター博士。'
'彼女はテロを起した＃｛FOXHOUND、フォックスハウンド｝＃と次世代特殊部隊'
'の遺伝子治療を担当していた。'
ページ61:
'新型レーダーと最新無線機システムの開発者である'
'メイ・リンもディスカバリーに乗り込んでいた。'
'作戦遂行当時はまだ１０代だったという。'
'他に、以前＃｛FOXHOUND、フォックスハウンド｝＃でサバイバル教官を務めて'
'いたというマクドネル・ミラー。'
'自らの申し出で、アラスカの自宅から助言を行う。'
'そして、この「シャドーモセスの真実」を記した'
'ナスターシャ・ロマネンコは核やその他の兵器の専'
'門家として作戦に参加していた。'
ページ62:
'　'
'　'
'　'
'　'
'　　　　　＜人質が暗示する新型兵器＞'
ページ63:
'シャドーモセス島に潜入したスネークがまず挑ん'
'だのは人質の救出である。'
'中でも特に重要視されていた人物は二名だった。'
'結論から先に言うと、スネークは結局このどちらも'
'助けられなかったようだ。'
'いや、救出には成功したが、何故か二人とも、彼の'
'目の前で突然苦しみだし、遂には息絶えてしまった。'
'その時点では心臓発作として納得せざるを得なかっ'
'た作戦チームだが、後ほどそれは間違いであった事'
'に気付く。'
ページ64:
'その一人目DARPA（米国防高等研究計画局）の局長'
'ドナルド・アンダーソン。'
'DARPAは様々な先端兵器の開発を計画・主導する'
'国防総省の付属機関だ。'
'二人目はアームズ・テック社社長ケネス・ベイカー。'
'アームズ・テック社は国内でも三本の指に入る軍需'
'産業の大手企業である。'
'先進兵器技術のスポンサーと死の商人が人里離れた'
'軍の施設に居合わせていた……これが偶然ではない'
'ことは聡明な貴方はお気づきであろう。'
ページ65:
'そう、単なる偶然で核兵器廃棄所にたまたま居合わ'
'せる組み合わせではない。'
'ましてや寒中ピクニック友の会の会員同士だったと'
'いうわけでもないだろう。'
'私は以前、こんな話を聞いたことがある。'
'極寒の地で密かに生息している雪男ビッグフットの'
'捕獲に成功した＃｛海軍情報局、DNI｝＃はその養殖を開始し人間'
'ではあり得ないほどの怪力を持ったUMAソルジャー'
'として軍隊への導入を考えていた。'
'だがそのアイデアには致命的な落とし穴があった。'
ページ66:
'彼らには武器が持てなかったのである！'
'そこで急遽、＃｛海軍情報局、DNI｝＃はビッグフットサイズの'
'銃火器開発に着手した。'
'その開発を委託された企業の名前が確かアームズ'
'なんたらという、企業だったようなそうじゃない'
'ような記憶がある。'
'だが、それはこの話には一切関係ない。'
'この島では新型の核搭載兵器の開発が極秘裏に行わ'
'れていたのだ。'
ページ67:
'そしてその開発は演習が行えるほどまで完成に近い'
'状態だった。'
'それはどのような兵器だったのか？'
ページ68:
'　'
'　'
'　'
'　'
'　　　　　　　＜驚愕の戦闘兵器＞'
ページ69:
'『メタルギア』'
'　'
'この言葉をあなたは聞いたことがあるだろうか。'
'私がまだ現役の記者だった頃、記者連中の間でまこ'
'としやかに囁かれた秘密兵器である。'
'私はあいにくこのようなデマは信じない主義だ。'
'どのような悪地でも走破し、正確な核攻撃が行える'
'核搭載歩行戦車など恐ろしすぎる。'
'だが、それは実在したのだ！'
ページ70:
'前世紀末、南アフリカの武装要塞国家アウターヘブ'
'ン、ついで中央アジアの民族主義的軍事国家ザンジ'
'バーランドで、その開発が行われていた。'
'だが、それが脅威の新兵器として世界の表側に登場'
'することはなかった。'
'何の因果か、或いはその功績を評価しての人選だっ'
'たのか、この時もメタルギアの脅威から世界を救っ'
'たのはソリッド・スネークであった。'
'おわかりであろう。'
ページ71:
'シャドーモセス島で極秘裏に開発されていた最新'
'兵器は核搭載型歩行戦車、それも新型のメタルギア'
'＃｛REX、レックス｝＃だったのである！'
'「核兵器？　そりゃあ怖いけど、いま核兵器は削減'
'の方向にあるんだろ？　そんなものを開発してどう'
'すんのさ」'
'あなたはこう思うだろう。'
'だがそう思っているのは何も知らされていない我々'
'一般市民だけなのかもしれない。'
ページ72:
'核兵器はまだその存在意義を失っていない。'
'確実に標的に当てることができるのなら。'
ページ73:
'　'
'　'
'　'
'　'
'＜新型兵器の正体は「見えない核攻撃」だった！＞'
ページ74:
'新型メタルギア、“メタルギア＃｛REX、レックス｝＃”。'
'全高１４メートル、バルカン砲とレーザーを装備し'
'最新式の複合装甲は高性能のＨＥＡＴ（成形炸薬）'
'でも破壊は難しいという。'
'だが本当に恐ろしいのはこれからだ。'
'ここ、シャドーモセス島で開発されていたメタル'
'ギア＃｛REX、レックス｝＃の新機能、それはメタルギアに装備された'
'レールガンで核弾頭を射出するというものだった。'
ページ75:
'射出された核弾頭は大気圏外に達してから自律的に'
'姿勢を制御し、自ら弾道コースをとって目標に向か'
'うという。'
'「空をでっかいミサイルが飛んで来るんだ。どんな'
'所から撃たれても撃ち落とせば済むじゃないか」'
'あなたはこう思うかも知れない。'
'だがメタルギア＃｛REX、レックス｝＃から飛んできたミサイルは撃ち'
'落とすことが出来ないのだ。'
'いや、撃ち落とす前に、発見することすら出来ない'
'と言うのだ！　'
ページ76:
'そう言われても、あなたは半信半疑だろう。'
'　'
'では実際に撃ってみよう。'
ページ77:
'ドドーン。'
ページ78:
'　'
'ドバドバドバ。'
ページ79:
'　'
'　'
'ドバドバドバドバドバドバドバドバ。'
ページ80:
'…おわかりいただけたであろうか。'
'メタルギアは確実に目標に到着し、確実にそれを破'
'壊してしまうのだ。'
'何しろレールガンなのだ！！'
'ここまでお伝えすればもう疑う余地はないであろう。'
'このテロリスト達は、誰にも気付かれず目標へとた'
'どり着いてしまう恐怖の核兵器を搭載した新型メタ'
'ルギア、メタルギア＃｛REX、レックス｝＃によって核を発射しようと'
'していたというのだ！'
ページ81:
'　'
'　'
'　'
'　'
'　　　　　＜ついに潜入した施設内部＞'
ページ82:
'さて、一方私は精神的にも肉体的にも支え合う関係'
'となったカジキの重さに汗しながら、洞窟の中を歩'
'いていた。'
'すると明らかに人工物とわかる壁面と、整然と並ぶ'
'照明が目に入った。'
'私はついにたどり着いたのだ！　'
'かつてテロリストが蜂起し、ソリッド・スネークが'
'潜入した軍事施設、世界をも巻き込む反乱の中心と'
'なる可能性もあった場所に！'
ページ83:
'どうやら人影は見えない。'
'だが微かに、洞窟を吹き抜ける風の音にまぎれてか'
'細い声が聞こえてきた。'
'「ゲイリー、助けてくれえ…」'
'私は耳を疑った。'
'何故、初めて訪れた北の孤島で私の名を呼ぶ声がす'
'るのだ。'
'慎重にあたりを見回すと、鉄柱の立ち並んだ一角に'
'見覚えのある姿があった。'
'それは…。'
ページ84:
'ジョンディー？'
'つい数時間前、私を極寒の海に突き落としたいとこ'
'のジョンディーが、柱にしばられて座っている。'
'彼に何があったのだ！？'
'「助けてくれゲイリー…」'
'頼りない声を上げるジョンディーの方へ、私はカジ'
'キの重さにふらつきながら近付いて行った。'
'彼は私に気付くと弱々しく微笑んだ。'
'私はその隣りにかがみ込む。'
'「一体何があったんだジョンディー」'
ページ85:
'「わからねえんだ。お前を船から降ろした後、ヘリ'
'が近付いてきて…」'
'「ヘリ？」'
'「ああ、角張った黒いやつだ。それで気が付いたら'
'ここにいたんだよ。…ゲイリー…なんでまだカジキ'
'をかぶってるんだ？」'
'やはりこの裏には何かあるというのか！？　'
'誰だ。'
'軍の関係者か、それともディスクにあった大統領を'
'も凌駕する謎の権力集団が暗躍しているのか？'
ページ86:
'重い沈黙を突如銃声が引き裂いた！'
'私は反射的にカジキの中に隠れた。'
'「助けてくれゲイリー！　縄を解いてくれ！」'
'射手はどこにいるのだ？'
'弾丸は周囲の鉄柱に跳弾するため、敵がどこから撃'
'ってきているのかわからない。'
'このままではやられてしまう。'
'どうすれば…？'
'「ゲイリー、縄を解いてくれよ！」'
'「俺はカジキだ。ゲイリーじゃない」'
ページ87:
'私は駆け出した。'
'銃声をかいくぐり、上へと続く階段に。'
'一歩ずつ、力強く大地を蹴って走る私。'
'すまないジョンディー。'
'私にはまだやらなければならないことがあるのだ。'
ページ88:
'　'
'　'
'　'
'　'
'　＜ソリッド・スネーク対『最強の兵士たち』＞'
ページ89:
'スネークが取った足どりを追ってみよう。'
'彼が潜入した核兵器廃棄所はテロリストの巣窟だ。'
'当然、戦闘は避けられなかったようだ。'
'そこはまさに生死を賭けた戦場であった。'
'施設内を巡回する無数のスーパー兵士"ゲノム兵"達'
'念動力と読心能力をあやつるサイコ・マンティス'
'変装の名人デコイ・オクトパス、生身でありながら'
'バルカン砲をかかえたバルカン・レイブン、狙撃の'
'天才スナイパー・ウルフといった最強の兵士である'
'＃｛FOXHOUND、フォックスハウンド｝＃の隊員達がスネークの行く手を阻んだ。'
ページ90:
'ここでは、中でも政府の陰謀と関わりが深いと思わ'
'れる人物を紹介していこう。'
'この事件に隠された恐るべき真実が明らかになるは'
'ずだ。'
ページ91:
'　'
'　'
'　'
'　'
'　　　　　＜リボルバー・オセロット＞'
ページ92:
'「シャラシャーシカ」の異名を持つ元スペツナズ。'
'ソ連崩壊後、傭兵として各地の紛争地帯を渡り歩い'
'た後、アメリカにスカウトされて＃｛FOXHOUND、フォックスハウンド｝＃部隊'
'に入隊した。'
'「リボルバー」というコードネームが示す通り＃｛回転、リボルバー｝＃'
'式拳銃を好んで使う拳銃の名手である。'
'オセロットは人質のアームズ・テック社社長を捜索'
'していたソリッド・スネークと対決する。'
'だが戦場に乱入してきたサイボーグ忍者によってそ'
'の決着が着くことはなかった。'
ページ93:
'ステルス迷彩を装備した忍者の一刀により、右手を'
'切り落とされたオセロットはその場を退いた。'
'また彼はこの事件において、ゴルルコビッチ大佐率'
'いるロシアの私兵部隊と彼等テロ部隊との橋渡しの'
'役割も果たしていた。'
'首謀格と思われるリキッド・スネークによるプラン'
'では、テロ一味がメタルギアからの核発射を成功さ'
'せた後にロシア私兵部隊が合流、シャドーモセス'
'島に立てこもり、世界を敵にまわして戦争を行うこ'
'とになっていた。'
ページ94:
'撃墜どころか発見すらできない無尽蔵の核ミサイル'
'と千人を越えるロシア私兵部隊、次世代特殊部隊の'
'ゲノム兵、そして＃｛FOXHOUND、フォックスハウンド｝＃の最強の戦士たち…。'
'彼等は想像を絶する布陣によって、第三次世界大戦'
'とも呼べ得る大戦争を引き起すつもりだったのだ！'
ページ95:
'　'
'　'
'　'
'　'
'　　　　　　＜忍者とは何者か？＞'
ページ96:
'強化外骨格とステルス迷彩に身を包み、人間離れし'
'た動きでスネークを苦しめた彼は、テロリスト一味'
'には属さない正体不明の人物であった。'
'彼はただ、スネークとの戦闘を楽しみ、喜ぶだけの'
'ためにこのシャドーモセス島の施設内にいた様だ。'
'そして、拳を通じた忍者との闘いでスネークのひら'
'めきによって、驚くべき忍者の正体が明らかになる'
'のであった。'
'彼の正体はグレイ・フォックス。'
ページ97:
'かつて親友のソリッド・スネークに殺されたはずの'
'人物であった。'
'一度死んだはずの人間が生き返るのは珍しいことで'
'はない。'
'世界中の様々な実例がそれを証明しているのだ。'
'１９５２年、ハンガリーの農業従事者であった'
'ローランド・グレイス氏の墓地を移転する際、'
'棺の蓋の裏側から爪痕が発見された。'
'まるでそこから出ようともがいたかのような痕だっ'
'たという。'
ページ98:
'また１９１４年、日本では鍾乳洞に入ったまま行方'
'不明になっていたジンエモン・ナタカマ氏が１０年'
'後に同じ場所に現れ、家族を驚かせた。'
'しかも彼の姿は当時とまるで変わっていなかったと'
'いうのだ。'
'そう考えれば納得がいく。'
'いわばピラミッド・パワーだ。'
'グレイ・フォックスも軍による遺伝子治療の実験体'
'となるため、そのような再生を遂げさせられたに違'
'いない。'
ページ99:
'　'
'　'
'　'
'　'
'　　　　　　＜リキッド・スネーク＞'
ページ100:
'テロの首謀者と思われるこの人物の名前を聞いて'
'あなたは何かを感じ取るかもしれない。'
'世界を危機から救った英雄・＃｛固体の蛇、ソリッド・スネーク｝＃と、＃｛液体の蛇、リキッド・スネーク｝＃'
'というコードを持つこのテロ首謀者は双子同士だ。'
'しかもただの血縁関係ではない。'
'ここにも軍による恐怖の遺伝子研究が背後に蠢いて'
'いたのである。'
'彼等は『恐るべき子供達』と呼ばれた計画が生み出'
'した戦士だった！'
ページ101:
'軍が戦士を人為的に「生産」しているという噂は絶'
'えない。'
'最近私が聞いたものでは人型戦闘機械『ギジンさん』'
'というものがある。'
'外殻の研究までは完成していたが、中に人間が入ら'
'なければ作動しなかった。'
'無意味だ。'
'軍も実用化を間近にしてようやくそれに気づき、そ'
'の計画は頓挫した。'
ページ102:
'また超能力者の遺伝子によって超人部隊を作り出そ'
'うという研究も行われたらしい。'
'だが戦場にはスプーンがなかった。'
'ソリッド・スネークとリキッド・スネークは父親で'
'あるビッグボスから人為的操作を介して遺伝子を受'
'け継いだようだ。'
'彼等には生まれつきスーパー・ソルジャーとしての'
'血が流れていたのだ。'
'その二人が出会った。'
'戦いは必然だったのかもしれない。'
ページ103:
'　'
'　'
'　'
'　'
'　　　　　＜施設の屋上で見たものは＞'
ページ104:
'私は姿なき狙撃手の攻撃を逃れ、相棒の重さに絶え'
'ながら施設内の階段を上がっていた。'
'どこまで上がっても終わりのない螺旋階段。'
'私がそれ以上登るのを諦めようとした頃、ついに屋'
'上への出口が見えた。'
'扉を開けると、薄明るい闇に氷点下の風が吹き荒れ'
'ていた。'
'いまの私には心地よい。'
'カジキを横に寝かせると、私はその場に座り込んで'
'ゆっくり呼吸を整えた。'
ページ105:
'追手はここまで来るだろうか。'
'だが私はもう動けなかった。'
'ポケットからピーナツバター入りのバーボンを取り'
'出す。'
'一気に煽ると身体の中心を炎が降りていくようだ。'
'子供の頃、私はピーナツバターが大の苦手な弱虫'
'だった。'
'ある日、私は決心した。'
'そんな自分を変えるのだと。'
ページ106:
'それ以来、私はどんな食べ物にもピーナツバターを'
'つけて食べるようになった。'
'好きだったオニオン抜きのチリ・ドックにも、ガム'
'にも、惚れた女の唇にも、山盛りに塗りたくった。'
'そのおかげで、私はピーナツバターが絶望的に嫌い'
'になった。'
'この世から絶滅して欲しいほど嫌いだ。'
'世界中のピーナツバターをバミューダトライアング'
'ルに捨ててしまいたいほど憎い。'
'だから私は、今もピーナツバターがやめられない。'
ページ107:
'この先も好きになることはないだろう。'
'そう、あれはなんて歌だったか。'
'らーらららーららー'
'違う。'
'るーるるるーるるー'
'それは別の曲だ。'
'似ているから思い出せない。'
'足に雪が積もる。'
'カジキはどこだ。'
'ああ隣だ。'
ページ108:
'光がまぶしい。'
'思い出した。'
'６月２４日、UFOの記念日。'
'とても眠い。'
'なんの音だ？'
'…ヘリだ。'
'角張った黒いヘリだ。'
'私に近付いてくる。'
ページ109:
'　'
'　'
'　'
'　'
'　＜恐怖の殺人ウイルス、『＃｛FOXDIE、フォックスダイ｝＃』とは！？＞'
ページ110:
'ここで少し思い出して欲しい。'
'人質として捕らえられていたＤＡＲＰA局長ドナルド・'
'アンダーソンとアームズ・テック社の社長ケネス・'
'ベイカー。'
'彼等はソリッド・スネークが救出を試みた際、心臓'
'発作で亡くなったと私は書いた。'
'だが彼等の死の真相は殺人ウイルス＃｛FOXDIE、フォックスダイ｝＃による'
'ものだったのだ！'
'ナオミ・ハンターが＃｛FOXHOUND、フォックスハウンド｝＃で研究を行っていた'
'殺人ウイルス、＃｛FOXDIE、フォックスダイ｝＃。'
ページ111:
'それは、特定人物だけを死に至らしめるレトロウイ'
'ルスだ。'
'これがターゲットの体内にひとたび入るとその人物'
'はたちどころに死に至ってしまうという、まるで'
'人体発火現象を人為的に行うような恐怖の兵器だ。'
'ナオミ・ハンターはソリッド・スネークにこのウイ'
'ルスを注入した。'
'故に、スネークが出会ったターゲットたちは次々と'
'倒れていったのだ。'
ページ112:
'だが、＃｛FOXDIE、フォックスダイ｝＃を作戦に使用したのは彼女の決定では'
'なかった。'
'では誰の指令があったのか。'
'それは、ペンタゴンが仕組んだことだったのだ！'
ページ113:
'　'
'　'
'　'
'　'
'　　　　　　＜ペンタゴンの目的＞'
ページ114:
'ソリッド・スネークの接触によって暗殺対象者だけ'
'を亡き者にする。'
'ソリッド・スネークに与えられた任務、核発射の阻'
'止や人質の救出は全て偽りの任務だったということ'
'である。'
'ペンタゴン本来の目的は、ソリッド・スネークを'
'＃｛FOXDIE、フォックスダイ｝＃の＃｛運び屋、ベクター｝＃として利用し、現地に赴かせる事'
'で特定の人物だけを始末すること、莫大な予算を投'
'じたゲノム兵の遺体とメタルギア＃｛REX、レックス｝＃を無傷で回収'
'することだったのだ！'
ページ115:
'ペンタゴンはこの＃｛FOXDIE、フォックスダイ｝＃によって、全てを隠し'
'通せると信じていた。'
'だが、ナオミの手によって彼等の施したプログラム'
'に改竄が行われていたことが発覚。'
'それがどのような改竄であったかは不明だが、少な'
'くとも＃｛FOXDIE、フォックスダイ｝＃の信憑性は薄くなってしまった。'
'そこでペンタゴンは恐るべき行動に出た！'
ページ116:
'　'
'　'
'　'
'　'
'　　　　　＜ついに出動した爆撃機＞'
ページ117:
'＃｛FOXDIE、フォックスダイ｝＃の効果に疑問を持った当時の国防長官ジム・'
'ハウスマンは自らが作戦の指揮に乗出し、AWACS'
'でシャドーモセスへと向かっていた。'
'同時に、地表貫通式戦術核爆弾Ｂ６１-１３を搭載した'
'爆撃機がカレーナ基地を離陸。'
'国防長官はもっとも直接的な方法で事実の隠蔽を'
'図ろうとしたのだ！'
'核によって核を制す。'
'まさに旧世代の抑止論が復活したかのような行動に'
'現地のソリッド・スネークは激怒した。'
ページ118:
'彼はメタルギア＃｛REX、レックス｝＃を既に破壊し、テロ事件自体'
'は既に解決していたのだ。'
'だが、実際に核が投下されることはなかった。'
'国防長官ジム・ハウスマンの命令を止めた存在が'
'いるのだ。'
'国防長官を制すことの出来る存在、あなたはまず'
'米国大統領だと考えるだろう。'
'だが、それは違う。'
'核の投下を止めた存在。'
'それは謎の権力集団だったのだ！'
ページ119:
'大統領にさえ匹敵、或いは凌駕しかねない存在。'
'果たしてそれは何者なのか？'
ページ120:
'　'
'　'
'　'
'　'
'　　　　　　＜明かされた正体＞'
ページ121:
'意識が戻ると、私は断崖に建てられた気象観測所の'
'小屋で後ろ手に縛られ、コーヒー豆の匂いのする麻'
'袋を頭にすっぽり被せられて座っていた。'
'命がけで最北の島シャドーモセスまで来たという'
'のに、なんの収穫もないまま謎の男達に殺されてし'
'まうのか。'
'一人が私に近付くと、胸元のポケットをまさぐった。'
'まずい、そこには盗まれないように持ち歩いていた'
'ナスターシャ・ロマネンコのディスクが入っている'
'のだ！　'
ページ122:
'シャドーモセス島で起きた全てが書かれている！'
'その男はディスクを探り当て、私の元から奪い取り'
'私に聞いた。'
'「これはなんだ？」'
'私はその男を睨んで言った。'
'「おめえらにはもったいないお宝だ」'
'「お宝？　ほう?」'
'ここで話は本書の冒頭に戻る。'
'彼等は私がここに来た理由を問いつめ、「ディスク'
'は回収した」と言ったのだ。'
ページ123:
'このディスクがどのような経緯で『メガ・サプライ'
'ズ！』編集長のマックス・スミスソンの元に届き、'
'そして私の手に渡ってきたのかは不明だ。'
'だが、回収というからには元々、この者達のものだ'
'ったか、あるいは、彼等がこのディスクを最も欲す'
'る者かだ。'
'私は勇気を持って口を開いた。'
'「おめえら、ひょっとして大統領をも凌駕する謎の'
'権力集団じゃねえだろうな。吐きやがれこのステッ'
'キの形したアメの合成着色料！」'
ページ124:
'この言葉が彼等を逆上させた。'
'図星だったのだろう。'
'だがこれでディスクの内容は証明された。'
'間違いない！　'
'彼等は、彼等は大統領をも凌駕する謎の権力集団の'
'手先だったのだ！　'
'私を罵倒する声と共にホルスターから拳銃を抜き出'
'す音が聞こえた。'
'その時だ！'
ページ125:
'窓ガラスが割れる音と共に舞い込んできた救世主は、'
'私を椅子に縛り付けた奴等を一瞬にして動かぬむく'
'ろにしてしまったのだ！'
'一体誰が？　'
'私は好奇心と恐怖で吐きそうだった。'
'口の中にピーナツバターの風味が広がる。'
'その人物は静かに近付いてくると、私の頭にかぶせ'
'られた麻袋を取り除いた。'
'私は耳の奥で自分の鼓動を聞きながらゆっくりとそ'
'の人物を見上げた…だが！'
ページ126:
'だが、そこには誰もいなかったのだ！'
'気配もなく、姿もなく、だが確かにそこに存在はし'
'ていた。'
'その人物は私の手を縛っていたロープを解く。'
'そして、まるで戴冠式のような手つきで両側から私'
'の頭に触れると、後頭部の傷を抑えていた、海岸で'
'拾った布きれ、バンダナのような布きれを取り外し'
'たのである。'
'私は見えないその人物を震える手で探ろうとしたが、'
'バンダナが舞い、その人物の気配は消えてしまった。'
ページ127:
'呆然とする私をさらなる驚愕の出来事がおそった。'
'胸元に奪われたはずのディスクが存在していたのだ！'
'しかも、ポケットがやぶれるほど何枚もだ！'
'一瞬にして私を助け、ディスクを増殖させ、そして'
'姿がない救世主。'
'このような奇妙な出来事が起こった理由は一つしか'
'考えられない。'
ページ128:
'そう。'
'これはリトル・グレイの仕業だ。'
ページ129:
'　'
'　'
'　'
'　'
'　　　＜シャドーモセス探訪の後＞'
ページ130:
'かくして私はカジキとともに自らの住処である'
'ニューヨークの安アパートに戻った。'
'隣に住んでいた貧乏学生は近頃行方不明だと大家に'
'聞いた。'
'もしかしたら彼のパソコンから危険なサイトを探り'
'すぎたせいかもしれない。'
'悪いことをした。'
'いま私は古いタイプライターを取り出して、ディス'
'クと、そして私自らがシャドーモセス島で得た真'
'実を元に原稿を書いている。'
ページ131:
'それももう終わりに近付いてきた。'
'ナスターシャ・ロマネンコは危険を冒してまで、事'
'件の真相をこの光ディスクに記した。'
'それは、この事件の犠牲者、核にまつわる様々な'
'犠牲者、そして政府の陰謀に操られた不幸な者達に'
'対して、彼女が出来る唯一のことだったのかもしれ'
'ない。'
'その思いは私の手に渡り、今こうして白日の下にさ'
'らされた。'
ページ132:
'そして、バトンはあなたに渡された。'
'あなたには何が出来るだろうか。'
ページ133:
'−　本書再刊にあたって　−'
'本書は、アラスカ・フォックス諸島の更に北に実在'
'するシャドーモセス島で起きた、未曾有のテロ事'
'件解決に加わったという軍事アナリスト、ナスター'
'シャ・ロマネンコの記録を元に書かれたノンフィク'
'ションである。'
'本書刊行ののちに、原典である『シャドーモセス'
'の真実』が発売されたため、そちらでご存じの方も'
'多いであろう。'
ページ134:
'著者ゲイリー・マクゴールデンは『UFOはネッシー'
'の念力で飛んでいた』等の著作でかつて一世を風靡'
'したノンフィクション作家だ。'
'本著に書かれた内容の真偽は不明だが、カジキの皮'
'で潜入したとあるシャドーモセス島のくだりに関'
'しては疑わしく、実際の所は数マイル南に位置する'
'小さな孤島に漂着し、そこがシャドーモセス島だ'
'と信じていた可能性が高い。'
'本人は原稿を編集部に送りつけると、原稿料も受け'
'取らぬまま音信不通になってしまった。'
ページ135:
'気まぐれな彼の事だ。'
'もしかしたら既に次回作にかかっているのかもしれ'
'ないし、そう願いたいものである。'
'ともあれ、彼のシャドーモセス島探訪への疑惑が'
'本著の全てを否定してしまうものではなく、また入'
'手したとしているナスターシャ・ロマネンコのディ'
'スクに関しても否定しきれる確証はないであろう。'
'読者諸君には、大いに想像力を沸き立てて読んで頂'
'きたい。'
ページ136:
'少なくとも、私が著者にそのディスクを郵送した'
'憶えはないのだが。'
'　'
'『メガ・サプライズ！』'
'　　　　　　　　編集長　マックス・スミスソン'

}
