/*
	ファイル名		pre_story3_j.rsc
	作成日			2001/08/07
	作者			S.Kaneyoshi
	$Id: pre_story3_j.rsc,v 1.13 2002/10/09 07:47:52 usr03005 Exp $
*/

/*****************************************************************************/
// 真実
/*****************************************************************************/
resource 真実日本 {
ページ001:
'　'
'　'
'シャドーモセス島で命を落とした人々と全ての'
'核の犠牲者、そしてリチャード・エイムズに。'
'　'
'　　　　　　　　　　ナスターシャ・ロマネンコ'
'　'
'　'
'　'
'　'
ページ002:
'はじめに'
'　'
'北緯XX度XX分、東経XX度XX分。'
'シャドー・モセス島。'
'アラスカ、フォックス諸島のさらに北、地元の漁師'
'さえ訪れる事の少ないこの孤島で、その事件は起こ'
'った。米政府はその全てを否定しているが、その日'
'オハイオ級原子力潜水艦ディスカバリーが本来の作'
'戦海域を離れシャドー・モセス島に現れたことが確'
'認されている。'
ページ003:
'また、それに先んじてアラスカ方面に緊急出動して'
'いたE-3C AWACSには当時の国防長官ジム・ハウ'
'スマンが搭乗していたと言う。そしてその16時間後'
'カレーナ基地から爆装した6機のF117ナイト・ホー'
'クがアラスカに向けて離陸している事実も飛行記録'
'に記載されている。'
'　'
'一体何が起こったのか？'
'　'
'　'
ページ004:
'この軍の異常な行動に対して様々な噂が流れ、第三'
'国の軍事侵攻、軍の一部によるクーデターなど種々'
'の憶測がなされた。'
'だが、そのどれも正しくはない。'
'　'
'そこで起こったのは、現代史上最大のテロだった。'
'世界を核攻撃の危機にさらした古今未曾有のテロ。'
'しかもそれは政府が国民を偽り極秘裏に進めていた'
'幾つかのブラック・プロジェクトに起因している。'
'　'
ページ005:
'私の手元に二枚の光磁気ディスクがある。'
'一枚はその日、シャドー・モセス島で起きた全ての'
'記録だ。'
'――現代史の裏側で活動を続けてきた非正規戦部隊'
'＃｛ＦＯＸＨＯＵＮＤ、フォックスハウンド｝＃と遺伝子強化された次世代特殊部隊に'
'よる核兵器廃棄所の占拠。極秘裏に開発されていた'
'核搭載歩行戦車メタルギア＃｛ＲＥＸ、レックス｝＃。政府の陰謀。'
'そして、それらを相手にたった独りで闘いを挑み'
'世界の危機を救った男、元＃｛ＦＯＸＨＯＵＮＤ、フォックスハウンド｝＃隊員コード'
'ネーム、ソリッド・スネーク――'
ページ006:
'そしてもう一枚には、機密の暴露を恐れた政府がそ'
'の全てを闇に葬るべく行った＃｛ＦＯＸＤＩＥ、フォックスダイ｝＃作戦の詳細が収'
'められている。合衆国内には、核兵器の脅威を新た'
'な形で振りかざすことで、前世紀に確立した軍事的'
'覇権を21世紀の世界にも維持していこうと企む隠然'
'たる勢力が実在するのだ。'
'私はここにその全てを明らかにしようと思う。'
'核と言う２０世紀の生んだ負の遺産から、次の世代'
'を解放するために。'
'　　　　　　　　　　ナスターシャ・ロマネンコ'
ページ007:
'来客を告げるチャイムが鳴り、私は資料から目を上'
'げた。'
'目の前のディスプレイには、現在中東某国で再浮上'
'している核兵器開発についてのレポートが作成途中'
'のまま滞っている。UNSCOM（国連大量破壊兵器廃'
'棄特別委員会）は査察団の受け入れを要求したが'
'某国はこれを拒否。湾岸にはまたしても緊張が走っ'
'ている。私は核兵器専門の軍事アナリストとして、'
'契約先のシンクタンクから状況の評価を依頼されて'
'いた。'
ページ008:
'提出期限は明後日だ。仕事を中断されるのは愉快で'
'はなかったが、私は吸いかけの両切り煙草を灰皿'
'に押し付け、書斎を出た。'
'私の自宅は塀で囲まれており、訪問者をカメラで確'
'認してから外門を開ける仕組みになっている。郊外'
'とは言え、ここはロスアンゼルスだ。水着姿の観光'
'客の闖入を防ぐには最低限必要な設備だ。'
'だが門を映すカメラには誰の姿も無かった。誰かの'
'悪戯か、それとも装置の誤作動だろうか？'
'　'
ページ009:
'釈然としないまま書斎に戻り、仕事を再開すべく'
'PCに向かったその時、突然、背後から声がした。'
'「相変わらず不用心だな」'
'椅子を蹴って振り向くと、書斎の入り口に仕立ての'
'良いスーツをだらしなく着こなした男が立っている。'
'「リチャード！」'
'彼は私と目が合うとにやりと笑った。そして私の驚'
'きなど意に介さない様子で書斎に入り、部屋中に積'
'まれた資料を眺めて肩をすくめて見せる。'
'「整理下手なのも変わってない」'
ページ010:
'その仕種に私は懐かしさと同時に苦いものを感じた。'
'　'
'リチャード・エイムズと私はかつて結婚していたこ'
'とがある。二人とも＃｛国防情報局、DIA｝＃に勤めていた。その'
'時はお互いに若かった。長くない共同生活のほとん'
'どを衝突に費やし、やがて一緒になったのは過ちだ'
'ったと悟り始めた頃、彼は私の前から姿を消した。'
'弁護士を通じて離婚の申し出があったのは、それか'
'らしばらくしてからの事だった。リチャードには多'
'額の慰謝料を支払う用意があることを弁護士は告げ'
ページ012:
'たが、私は断った。'
'そして一度も顔を合わせる事なく離婚の手続きは終'
'了し、私達は他人となった。五年前のことだ。'
'　'
'私はDIAを退局してフリーの軍事アナリストとなり'
'それ以来、リチャードの姿は一度も見ていない。'
'噂を聞いたことも無かった。'
'「どうやって入って来たの？」'
'私はリチャードに詰め寄った。'
'　'
'　'
ページ013:
'塀を乗り越えたり、玄関の鍵をこじ開けようとすれ'
'ば当然警報が鳴るようになっている。彼は平然と答'
'えた。'
'「あんな鍵なら掛ける手間をはじめから省いた方が'
'いい。ちゃんとしたセキュリティをつけるべきだよ」'
'「不法侵入って言葉の意味は知ってる？」'
'「あいにく法律にはうとくてね」'
'そう軽く言いながら彼は、私の横からディスプレイ'
'上のレポートを覗き込んできた。'
'　'
ページ014:
'「電磁アイソトープ分離器、高速ガス遠心分離器に'
'よるウラニウム２３５取得の可能性……。例のアラブ'
'の核兵器開発についてかい？　仕事は順調そうだね。'
'結構なことだ」'
'私はリチャードを側から押しやって言った。'
'「一体、何しにきたの？」'
'彼は一歩下がって、からかうような笑みを浮かべて'
'見せた。'
'「よりを戻しに来た、とでも思ったかい？」'
'　'
ページ015:
'私の反応を楽しむようにしばしの間をおくと、彼は'
'急に事務的な口調で言った。'
'「DIAからの仕事だ」'
'そして机の上に一冊のファイルを置く。'
'「君にNESTの一員として協力してもらいたい」'
'NESTは核緊急捜索チームの略称だ。所属はDOE（ア'
'メリカ・エネルギー省）。核脅迫事件を捜査するFBI'
'に対し情報、捜査、安全確保、被害最小化、医療等'
'の技術支援を目的に1974年に設立された、核を使用'
'したテロに対するスペシャリスト集団だ。'
ページ016:
'NESTは個人的に契約したロスアラモスやローレンス'
'リバモアなどの国立研究所の科学者や核兵器関連機'
'関の軍事専門家によって構成され、核爆弾の捜索と'
'処理の権限が与えられている。'
'私も核兵器専門の軍事アナリストとしてチームに加'
'わっていた。'
'　'
'リチャードはファイルを開きながら言った。'
'「シャドー・モセス島を知っているな？」'
'私は黙って肯いた。'
ページ017:
'シャドー・モセス島。アラスカのフォックス諸島北'
'にある孤島だ。一般にはあまり知られていないが、'
'そこには核兵器廃棄所がある。'
'　'
'米露両国の戦略核弾頭の総数を3000〜3500発に削'
'減するSTART2（第二次戦略兵器削減条約）に従い、'
'前世紀末に大量の核弾頭が廃棄された。しかし解体'
'した核弾頭から取り出される核物質を貯蔵しておく'
'核物質貯蔵施設は既に飽和状態に達していた。'
'　'
ページ018:
'そこで廃棄された核弾頭を解体までの間一時保存し'
'ておく必要が生じ、シャドー・モセス島にそのため'
'の施設が作られたのだ。'
'核軍拡と言う歪んだ時代と、問題を解決せずに先送'
'りにする政治、そして現有核戦力をできるだけ維持'
'したい軍部の思惑等のひずんだ相互作用によって産'
'み落とされた施設だった。'
'　'
'リチャードはファイルの中から数枚の写真を取り出'
'し、こちらに渡した。'
ページ019:
'見れば、どれもシャドー・モセス島の核兵器廃棄所'
'を写した衛星写真のようだった。NRO（国家偵察局）'
'から提供されたものだろうか。施設のまわりに多数'
'の人影が写っている。'
'リチャードが言った。'
'「その核兵器廃棄所がテロリストに占拠された」'
'私は思わず目を上げた。'
'「テロの首謀者は＃｛ＦＯＸＨＯＵＮＤ、フォックスハウンド｝＃だ」'
'その言葉に私は息を呑んだ。'
'　'
ページ020:
'＃｛ＦＯＸＨＯＵＮＤ、フォックスハウンド｝＃。最新の装備を施され、最高の兵士に'
'よって構成された不正規戦部隊だ。だがその存在は'
'名前すら一般には知られされていない。政府が公に'
'介入することの出来ない内戦や地域紛争などのLIC'
'（低強度紛争）に投入され、破壊活動や暗殺等を遂行'
'して現代史の裏側を担ってきた影の特殊部隊だった。'
'　'
'リチャードはなおも続ける。'
'「＃｛ＦＯＸＨＯＵＮＤ、フォックスハウンド｝＃だけじゃない。合同で演習を行って'
'いた次世代特殊部隊もテロに参画している」'
ページ021:
'次世代特殊部隊は、NBC兵器に代表されるWMD'
'（大量破壊兵器）を使用したテロを念頭においた新設'
'の実力対テロ特殊部隊だった。傭兵派遣会社出身の'
'兵士を大量に登用した上、FORCE21構想の下にVR'
'訓練を積んでおり、その実戦能力はデルタフォース'
'やナイトストーカーズを上回るとも言われている。'
'さらに政府は否定しているが、戦闘を目的とした遺'
'伝子強化が行われていると言う噂もあった。'
'＃｛ＦＯＸＨＯＵＮＤ、フォックスハウンド｝＃と次世代特殊部隊。現代アメリカ最精'
'鋭の特殊部隊が核ジャックとは。'
ページ022:
'リチャードはさらに付け加えた。'
'「おまけに核兵器廃棄所にいた民間人が人質に取ら'
'れているんだ。その中にはDARPA（米国防高等研究'
'計画局）の局長ドナルド・アンダーソン、アームズ'
'・テック社の社長ケネス・ベイカーも含まれている」'
'DARPAは様々な先端兵器の開発を計画・主導する国'
'防総省の付属機関だ。そしてＡＴ社は国内で三本の'
'指に入る兵器企業。そのトップ二人が偶然辺境の核'
'兵器廃棄所に居合わせるなど考えられない。私は聞'
'いた。'
ページ023:
'「その核兵器廃棄所で何かが行われてたのね？　'
'新型兵器の演習ってところ？」'
'「さあね。オーロラでも見に来てたんじゃないか？」'
'リチャードははぐらかそうとした。私に教える気は'
'ないということだろう。しかしその態度を見て私は'
'確信した。これはただのテロではない。その裏には'
'何かがある。それを承知で私はリチャードに聞いて'
'みた。'
'「彼らの要求は？」'
'　'
ページ024:
'「＃｛ＦＯＸＨＯＵＮＤ、フォックスハウンド｝＃の創設者であり、20世紀最強とも'
'言われた伝説の兵士、ビッグボスの遺体だ」'
'「ビッグボスの遺体？　そんなものを一体？」'
'「さあね。だが24時間以内に要求が受け入れられな'
'ければ、彼等は核を発射すると言ってる」'
'リチャードは別に焦った様子もなく腕時計を見て'
'言った。'
'「あと19時間くらいかな」'
'「妙に余裕があるのね」'
'「既に国防総省は事態の収拾に向けて動いている」'
ページ025:
'そうだろうと思った。何か口にした時には、既に計'
'画を立て事を始めている。彼が他人に求めるのは事'
'後承諾だけだ。'
'「シャドー・モセス島の警備は厳しい。大規模な部'
'隊の派遣は不可能だ。……だから選び抜いた一人の'
'工作員を単独で潜入させ、人質を解放、核発射を阻'
'止させる」'
'「不可能だわ」'
'「可能さ。ソリッド・スネークなら、ね」'
'　'
ページ026:
'ソリッド・スネーク……。元＃｛ＦＯＸＨＯＵＮＤ、フォックスハウンド｝＃隊員。'
'武装要塞国家OUTER HEAVEN、ザンジバーランド'
'をたった独りで陥落させた伝説の傭兵だった。確か'
'に彼ならば成功の可能性はあるのかもしれないが…。'
'「オハイオ級原子力潜水艦ディスカバリーが既にス'
'ネークを回収して配置についている」'
'既に全ての準備は整っているというわけだ。私はリ'
'チャードの目を見て聞いた。'
'「……それで、私に何をしろと？」'
'リチャードはにやりと笑った。'
ページ027:
'「伝説とまで言われた男でも、核兵器に関しては素'
'人だ。そこで君に彼の後方支援を依頼したい。機材'
'はこちらで用意した」'
'そう言った時、ちょうど書斎に二人の男が大きな荷'
'物をを運び込んできた。どうやら衛星通信機器らし'
'い。リチャードはあごで荷物をさした。'
'「あの通信機を使って、スネークに核兵器について'
'の助言をしてほしいんだ」'
'機械を運び込むなり、すぐに技術者らしき男が通信'
'機の調整を始めた。'
ページ028:
'庭ではもう別の男達がパラボラアンテナの設置をし'
'ている。私服を着てはいるが、体つきと上着の膨ら'
'み具合から明らかに銃を携帯した軍人と分かる男達'
'もいた。選択の余地はないというわけだ。'
'しかし腑に落ちない。NESTには常に緊急出動できる'
'小人数の捜査班、SRTがある。その本部はこのカリ'
'フォルニア州の隣り、ネバダ州ラスベガスのネリス'
'空軍基地にあった。なぜ彼らに出動を要請しないの'
'か。それに、かっての私がそうであったように核兵'
'器の専門家ならDIAにも何人かいるはずだ。'
ページ029:
'部下に対し機材設置の指示を始めたリチャードに聞'
'いた。'
'「なぜ私を？」'
'リチャードは振り返って何食わぬ顔で答えた。'
'「重大な事件だからね。信用できる人間でないと頼'
'めない」'
'嘘だ、と思った。リチャード・エイムズは誰も信用'
'したりしない。だがこれ以上問い詰めてもはぐらか'
'されるだけだろう。'
'　'
ページ030:
'「私が家にいなかったらどうするつもりだったの？」'
'「君がいる場所に行くさ。何処へでもね」'
'「そうでしょうね」'
'「引き受けてくれるかい？」'
'私は深く息を吸い込んで言った。'
'「勿論よ」'
'リチャードの思惑に乗せられるのは面白くない。だ'
'が核兵器を使ったテロが行われようとしているのを'
'黙って見ているわけにはいかなかった。'
'　'
ページ031:
'核兵器は一瞬で多くの人々の人生を奪う。大人から'
'も子供からも男からも女からも……分け隔てなく。'
'これ以上犠牲者を増やさないために私に出来る事が'
'あるのならば、そのために惜しむものはなかった。'
'「決まりだな」'
'リチャードは手を打った。'
'　'
'　'
'　'
'　'
ページ032:
'「スネークはシャドー・モセス島への潜入に成功し'
'たそうだ」'
'部下からの連絡を受けたリチャードが書斎に入って'
'きた。'
'書斎の様相は既に一変していた。多数の電子機器が'
'持ち込まれ、ケーブル類で今や足の踏み場も無い。'
'技術者やDIAの人間が入れ替わり立ち代わり出入り'
'し、今やすっかり臨時指揮所といった装いになって'
'いた。'
'　'
ページ033:
'リチャードが私の肩を叩く。'
'「すぐに向うから連絡が入るはずだ。無線機の使い'
'方はもう分かってるな」'
'私は頷いた。機器のセッティングが終了するまでの'
'間、私はリチャードから機器の使用法も含め、作戦'
'全体についての説明を受けていた。'
'まずオハイオ級戦略ミサイル原子力潜水艦ディスカ'
'バリーが、シャドー・モセス島近辺まで接近、ソリ'
'ッド・スネークの搭乗したSDV（小型潜水艇）を射出'
'する。'
ページ034:
'スネークは廃棄所近くに設置された水中聴音機をあ'
'ざむくために途中でSDVを破棄、そこから泳いで島'
'に潜入することになっていた。極寒のベーリング海'
'を泳ぐとは正気の沙汰とは思えないが、最新式のス'
'ニーキング・スーツと彼の体内に注入した不凍液が'
'それを可能にするらしい。'
'また、敵地に潜入するのはソリッド・スネーク一人'
'だが、何人かの後方支援要員が無線によって様々な'
'助言を行うことになっていた。'
'　'
ページ035:
'まずディスカバリーから作戦全体の指揮をとるロイ'
'・キャンベル大佐。私も名前だけは聞いたことがあ'
'った。1999年のザンジバーランド騒乱に際しソリッ'
'ド・スネークを指揮して、かの武装要塞国家を陥落'
'させた元＃｛ＦＯＸＨＯＵＮＤ、フォックスハウンド｝＃司令官。その後退役したと聞'
'いていたが、今回の危機に際し呼び戻されたらしい。'
'ナオミ・ハンター博士。遺伝子ビジネスで有名な'
'ＡＴＧＣ社から出向している遺伝子工学の専門家。'
'＃｛ＦＯＸＨＯＵＮＤ、フォックスハウンド｝＃の遺伝子治療を担当していたという。'
'　'
ページ036:
'リチャードは＃｛ＦＯＸＨＯＵＮＤ、フォックスハウンド｝＃と次世代特殊部隊で戦闘'
'を目的とした遺伝子強化が行われていたことを至極'
'当然のように認めた。戦闘と言う目的のために人間'
'の遺伝子を改変するなど常軌を逸している。'
'さらに今作戦で使用する新型レーダーと無線機シス'
'テムの開発者であるメイ・リンもディスカバリーに'
'乗り込んでいる。彼女はＭＩＴ（マサチューセッツ工科'
'大学）の学生でありながら最新の通信システムを開'
'発した電子工学の天才らしい。'
'　'
ページ037:
'他に、以前＃｛ＦＯＸＨＯＵＮＤ、フォックスハウンド｝＃でサバイバル教官を務めて'
'いたというマクドネル・ミラー。アラスカに住む'
'彼は、シャドー・モセス島での異変を知り自ら協力'
'を申し出てきたらしい。彼は私と同じようにアラス'
'カの自宅から通信による助言をする事になっていた。'
'私を含めた五人がそれぞれの分野の知識を生かして'
'スネークを支援する。だが敵地に乗り込むのはあく'
'までスネークただ一人。困難を極める任務であると'
'いう事実は全く変わらない。'
'　'
ページ038:
'しかし、これが国防総省がこのテロに際して立案し'
'た最良の作戦なのだとリチャードは言った。'
'今にして思えば、この時点で気づくべきだったのか'
'も知れない。この無謀と思える作戦に巧妙に仕組ま'
'れた陰謀の存在に。それを看破しえなかった自分の'
'愚かさを、私もスネークも後に噛み締めることにな'
'る。'
'　'
'「来たぞ、ナスターシャ」'
'着信を示すシグナルを認めたリチャードが言った。'
ページ040:
'既に通信は繋がっている。私は頷いて無線機に向か'
'った。自然と声が引き締まった。'
'「ナスターシャ・ロマネンコだ。よろしくな、ソリ'
'ッド・スネーク」'
'「あんたが大佐の用意した核の専門家か？」'
'無線機から聞こえてきた声は、どこまでも冷静なも'
'のだった。敵地に単独で潜入しているにも関わらず、'
'焦りや緊張というものが感じられない。まるでオフ'
'ィスのデスクから電話を掛けているような平静さだ'
'った。私はその冷静さに感心しながら答えた。'
ページ041:
'「そうだ。核に関する質問があったら何でも聞いて'
'ほしい。それに、こう見えても軍事アナリストだ。'
'兵器の知識でも君をサポートできると思う。この作'
'戦には核エネルギー調査チーム（NEST）の顧問とし'
'て参加を要請されたんだ。喜んで引き受けさせても'
'らったよ。……テロリストによる核攻撃など、許す'
'わけにはいかない。協力させてくれ」'
'「……随分、勇ましい女性だな」'
'「実際に核が撃たれようとしているんだろう？」'
'　'
ページ042:
'「核の問題というのは全人類にとって常に他人事で'
'はありえないんだ。傍観など出来ない……と言って'
'も今の私に出来るのは助言をする事くらいだが……」'
'その通りだった。'
'実際にアラスカで命を危険にさらすのはスネークだ'
'けだ。私は安全なカリフォルニアから話をしている'
'だけで、それ以上の何をすることも出来ない。'
'スネークの声が緩んだ。'
'「それで十分だ」'
'　'
ページ043:
'「誰もあんたに、ここに来て戦えなどとは望んでは'
'いない。……それは俺の役目だからな……ナスター'
'シャ、よろしく頼む」'
'それは不思議と安心を感じさせる声だった。'
'「こちらこそ」'
'私はそう答えて、自分に出来うる限り彼の手助けを'
'しようと決めた。'
'私は核兵器廃棄所について、スネークが知っておく'
'べきと考えられる事項の説明を始めた。'
'　'
ページ044:
'「そのシャドーモセス島の核兵器廃棄所は2002年。'
'あくまで廃棄核弾頭を一時保存しておくための施設'
'として作られた……」'
'通信が終わった。'
'短い会話だったが、ソリッド・スネークがなぜ「不'
'可能を可能にする男」と呼ばれているか分かった気'
'がする。死地に赴いても失われない冷静さ、絶対的'
'な自信。彼ならばこの困難な任務すらやり遂げるか'
'もしれない。そう感じさせる何かが、彼にはあった。'
'ふと見るとリチャードがこちらを見ている。'
ページ045:
'「なに？」'
'「いや……仕事してる時の君も凛々しくていいな、'
'と思ってね」'
'「男勝りなところが気に入らないって、昔さんざん'
'言われた気がするけど？」'
'「時間が経てば感じ方も変わるさ」'
'「懐かしがっているだけよ。またすぐ気に入らなく'
'なるわ」'
'「……そうかもしれないな……」'
'　リチャードはまだ私を見ていた。'
ページ046:
'ソリッド・スネークは噂通りの男だった。彼は次世'
'代特殊部隊の警備を見事にかいくぐり、核兵器廃棄'
'所に侵入、DARPA局長ドナルド・アンダーソンとの'
'接触に成功した。スネークの行動は全て、その体内'
'に注入されたナノマシンと無線機によってこちらで'
'モニターされている。それを通じて私は驚くべき事'
'実を知ることになった。独房に捕らえられていたア'
'ンダーソンはスネークに、テロリストが核を発射で'
'きると断言し、シャドー・モセス島でメタルギアの'
'演習が行われていたことを語ったのだ。'
ページ047:
'メタルギア。その名に私は慄然とした。'
'山岳部や砂漠、湿地帯……場所を選ばず迅速かつ正'
'確な核攻撃を可能にする核搭載歩行戦車。これが完'
'成すれば従来核ミサイルの運用が不可能であった悪'
'地からも核攻撃が可能となるため、世界の核戦略地'
'図は全面的に書き直されざるを得なくなると言われ'
'ていた。前世紀末、南アフリカの武装要塞国家アウ'
'ターヘブン、ついで中央アジアの民族主義的軍事国'
'家ザンジバーランドで、この核搭載歩行戦車の開発'
'が行われていたと言う。'
ページ048:
'一説には試作機まで完成していたという話だが、そ'
'れが脅威の新兵器として世界の表側に登場すること'
'はなかった。その前に一人の特殊部隊員により破壊'
'されたからだ。その特殊部隊が＃｛ＦＯＸＨＯＵＮＤ、フォックスハウンド｝＃、そし'
'て特殊部隊員はソリッド・スネークと呼ばれている'
'男だ。何の因果か……。いや、リチャードは全てを'
'知っていてソリッド・スネークを招集したのだろう。'
'私は彼等の周到さに歯噛みした。'
'数年前、国防総省の高官にインタヴューした際にメ'
'タルギアについて話を向けたことがある。'
ページ049:
'その時の彼の答えは（無論、メタルギアの存在は公'
'には認めず「もしそれがあるとして」という仮定上'
'の話としてだが）我が国でメタルギアの様な兵器を'
'開発する可能性は少ないというものだった。ソ連の'
'消滅による冷戦終結後、MAD戦略を維持するための'
'核兵器はその存在理由を失いつつあり、抑止理論に'
'も疑問の声が投げかけられている。現在の「より'
'小さな局地的大国が存在する多極的な世界」では巡'
'航ミサイルやステルス爆撃機に塔載できる小型低威'
'力の核兵器の開発こそが優先される、と彼は語った。'
ページ050:
'また彼は、メタルギアはその悪路走破性の高さゆえ'
'に発見・破壊が極めて困難な核発射機構であり、そ'
'れはむしろ第三世界の覇権大国いわゆる「ごろつき'
'国家（rogue states）」にとってこそ戦略的価値の'
'ある兵器であると評価していた。そして、もしもそ'
'うした国々がメタルギアのような兵器を配備するこ'
'とになれば、軍事的均衡は大きく崩れ、国際秩序は'
'大混乱を招くことになるという懸念もあらわした。'
'それについては私も同意見だった。'
'　'
ページ051:
'冷戦時代の遺物、核軍拡時代が生んだ幻の兵器。そ'
'れがメタルギアのはずだった。しかしなぜかその無'
'用のハイテク兵器が、このアメリカで再び開発され'
'ている。国防総省は前世紀の核戦略を復活させよう'
'と言うのか、それとも以前のメタルギアとは違う何'
'かが新型にはあるのだろうか。アンダーソンの話は'
'なおも続いた。メタルギアで核を発射するには、二'
'つの起爆暗号を入力する必要があり、DARPAの局長'
'であるアンダーソン自身とアームズ・テック社の社'
'長ケネス・ベイカーが一つずつ知っているという。'
ページ052:
'だがアンダーソンは、自分の起爆コードはテロリス'
'トに知られてしまったことをスネークに告げた。'
'＃｛ＦＯＸＨＯＵＮＤ、フォックスハウンド｝＃のサイキック、サイコ・マンティスの'
'読心能力で心を読まれたのだという。そして同様に'
'ベイカーの起爆コードもマンティスに読まれている'
'だろうとも。'
'つまり、テロリストは今すぐにでもメタルギアを使'
'って核を撃つことが出来る。'
'まさに最悪の事態だった。'
'　'
ページ053:
'しかしアンダーソンは、まだ核発射を阻止する手段'
'は残されていると言う。ケネス・ベイカーの持って'
'いる起爆コード緊急解除用の鍵を使って起爆コード'
'を再入力すれば、たとえテロリストが核発射の準備'
'を整えていたとしても、それを阻止することが出来'
'るというのだ。'
'その鍵の存在に一縷の希望を託し、スネークはアン'
'ダーソンと共に脱出を試みようとした。だがその矢'
'先、無線機のスピーカーからうめき声が上がった。'
'　'
ページ054:
'アンダーソンだ。彼はスネークの眼前で突然胸をか'
'きむしりだした。そして、私達の動揺がおさまるの'
'も待たずに、彼は息絶えてしまった。ディスカバリ'
'ーからモニターしていたナオミ・ハンターの推測に'
'よれば、心臓発作ではないかということだった。'
'スネークは冷たくなったアンダーソンを独房に残し'
'て、ケネス・ベイカーの救出に向かった。'
'　'
'スネークの脱出を確認した私は、リチャードに食っ'
'て掛かった。'
ページ055:
'「どういうこと？」'
'「聞いた通りさ。シャドー・モセス島では元々＃｛ＦＯＸ、フォックス｝＃'
'＃｛ＨＯＵＮＤ、ハウンド｝＃と次世代特殊部隊によるメタルギアの実戦'
'演習が行われていた。彼等は演習中のメタルギアを'
'使って核を撃つと脅迫しているんだ」'
'「聞いてないわ」'
'「そうだろうね」'
'私はリチャードを睨みつけたが、彼は表情ひとつ変'
'えなかった。私に下りる気がないのをわかっている'
'のだ。'
ページ056:
'仮に私がこれ以上の協力を拒否したとしても、周り'
'を囲んだ国防総省の人間達がそれを許さないだろう。'
'私は目を閉じて状況を整理した。'
'「アンダーソンは？　彼はなぜ死んだの？」'
'リチャードの顔色が少し変わった。'
'「ここからでは何とも分からないな。ナオミは心臓'
'発作と言っていたが……。一応、彼の病歴を調べさ'
'せよう」'
'彼は書斎を出て行った。部下に指示を出すつもりな'
'のだろう。'
ページ057:
'無線機から聞こえてくる音声によるとスネークはベ'
'イカーを救出するため、施設のさらに奥へと潜入し'
'ようとしているようだった。'
'施設の地下でスネークはベイカーを発見した。ベイ'
'カーは鉄骨へ幾つものＣ４爆弾とともに縛り付けら'
'れていた。ベイカーを助けようとするスネーク。'
'だが、その前に＃｛ＦＯＸＨＯＵＮＤ、フォックスハウンド｝＃隊員リボルバー・オセ'
'ロットが現れた。スネークの侵入を知ったオセロット'
'は、彼がベイカーの救出に来ることを見越して罠を'
'張り待ち受けていたのだ。'
ページ058:
'＃｛ＦＯＸＨＯＵＮＤ、フォックスハウンド｝＃の遺伝子治療を担当していたナオミ・'
'ハンターによれば、リボルバー・オセロットは、元'
'スペツナズ。ソ連崩壊後、OMONやKGB第１管理本'
'部を前身とするSVRの特殊作戦部門に籍をおいて'
'たが、新体制に適応する事ができずに離脱。傭兵'
'として各地の紛争地帯を渡り歩いた後、アメリカに'
'スカウトされて＃｛ＦＯＸＨＯＵＮＤ、フォックスハウンド｝＃部隊に入隊した。'
'「リボルバー」というコードネームが示すとおり'
'リボルバー式拳銃を好んで使う拳銃の名手だった。'
'　'
ページ059:
'無線機を通じて、スネークとオセロットの銃撃戦が'
'聞こえて来る。スネークのSOCOMピストルに対し、'
'オセロットが使うのはシングル・アクション・アー'
'ミー。年代もののリボルバー式拳銃だった。シング'
'ル・アクション・アーミーの第一号が作られたのは'
'1873年。今でも少量ずつ生産されてはいるが、それ'
'はあくまでコレクションや美術品としてであり、実'
'戦で使うなど正気の沙汰ではない。しかし信じがた'
'いことにオセロットはわざと床や壁に発砲し、その'
'跳弾でスネークを狙い追いつめていく。'
ページ060:
'神懸かり的な腕前だった。私達にはそれをただ無線'
'機の前で黙って聞いているしかなかった。だがスネ'
'ークは跳弾をもかわしながらリボルバー式拳銃の最'
'大の欠点であるリロードの間隙をつくことで、次第'
'に優位に立っていく。そしてスネークがオセロット'
'に致命的な一撃を加えようとした、その時だった。'
'突然、爆音が轟いた。'
'「右手が！」'
'オセロットの悲鳴が響く。さらなる爆発がそれに続'
'いた。'
ページ061:
'「何が起こった！？」'
'リチャードが声を上げる。'
'スネークのナノマシンから電送されるデータを解析'
'するオペレーターがモニターを見ながら答える。'
'「分かりません。スネーク、オセロット、ベイカー'
'以外の反応が出現しました」'
'無線機からは、なおも爆音が轟いている。'
'「第四の反応、鉄骨をなぎ倒していきます。しかし'
'火器は使用していません！」'
'「凄い移動速度だ！人間の限界速度を超えている」'
ページ062:
'状況を報告するオペレーターの声も上ずっていた。'
'混乱が場を支配する。'
'轟音の向うからオセロットの声が響いた。'
'「ステルス迷彩か！　死に損ないが……。邪魔が入'
'った。また会おう！」'
'オセロットは逃げ出したらしい。'
'次々と続く爆発。崩れ落ちる鉄柱。その中で「それ」'
'と対峙したスネークの問いが聞こえた。'
'「誰だ」'
'「名前など無い。お前と同じだ……」'
ページ063:
'それは人間の声ではなかった。人工的な機械音声。'
'しかしそれは苦しみにあえいでいるようにも聞こえ'
'た。ベイカーのうめき声がそれに重なる。'
'「その強化骨格は……」'
'突如、「それ」が獣のような叫び声をあげた。耳を'
'つんざく雄叫び。無線機のスピーカーが悲鳴を上げ'
'る。狂った野獣のような咆哮に私は耳を覆った。'
'絶叫とも慟哭ともとれるその叫びはしばし続き、そ'
'して始まった時と同様、突然に終わった。'
'　'
ページ064:
'後に残った凍ったような静寂の中、オペレーターの'
'報告が虚ろに響いた。'
'「……第四の反応、消失しました」'
'呆然としていた皆が、その一言で正気に戻ったよう'
'に動き出した。'
'「奴の行き先は追尾できるか？」'
'「駄目です。完全に消失しました」'
'「集められるだけデータを集めろ」'
'「ナノマシンより転送されたデータから、ステルス'
'迷彩に酷似した電磁パターンが検出されました」'
ページ065:
'「ステルス迷彩に強化骨格、か……」'
'私の後ろでリチャードが呟きながら考え込んでいる。'
'私は皮肉っぽく言った。'
'「計算通りにいかないこともあるみたいね？」'
'「修正可能な範囲さ。作戦に変更はない」'
'その瞳の奥に一瞬かすかな狼狽が揺れたが、リチャ'
'ードはすぐにそれを覆い隠し、いつもの不遜な口調'
'で言った。'
'「君は君の仕事に集中してくれればいいよ」'
'スネークは「それ」を忍者と呼んでいた。'
ページ066:
'その人間離れした戦闘能力といい、一体何者なのだ'
'ろうか。'
'シャドー・モセス島ではスネークが倒れたベイカー'
'を抱き起こしていた。'
'助け起こされたベイカーとスネークの会話が聞こえ'
'てくる。ベイカーは起爆コードについて尋ねられる'
'と、うなだれながら自分の起爆コードを喋ってしま'
'ったことを告げ、折られた腕をスネークに見せた。'
'どうやらリボルバー・オセロットの拷問にあったら'
'しい。'
ページ067:
'ナオミ・ハンターによれば、オセロットはスペツナ'
'ズ時代には、強制収容所で拷問特別顧問も勤めたと'
'いう拷問のスペシャリストでもあるらしい。'
'KGB本部に併設されたルビヤンカ刑務所で培われた'
'数々の技巧の前では、何の訓練も受けていない兵器'
'会社の社長が沈黙を守り続けることは出来なかった'
'だろう。テロリストは二つの起爆コードを手にして'
'いることになる。最悪の事態だった。'
'スネークが起爆コードを緊急解除する鍵について尋'
'ねると、ベイカーはまたしても首を横に振った。'
ページ068:
'ベイカーは一緒に独房に入れられていた女兵士に託'
'したという。その女兵士が蜂起への参加を断った新'
'兵だと聞き、スネークが思わず呟いた。'
'「あの女が大佐の姪？」'
'「大佐」というのは勿論キャンベル大佐のことだろ'
'う。スネークはその正体に心当たりがあるようだ。'
'私はリチャードの顔を盗み見た。そこには何の表情'
'も浮かんでいない。彼は彼女の存在を初めから知っ'
'ていたのだろう。キャンベルの姪がシャドー・モセ'
'ス島にいることを。'
ページ069:
'鍵が手に入らなかった場合にも核発射を阻止する手'
'段があるかどうかを聞くスネークに、ベイカーはハ'
'ル・エメリッヒ博士という技術者を探すよう教えた。'
'もしテロリストが起爆コードを手にし核発射の準備'
'を整えていた場合、それを阻止しうる方法を知って'
'いるのはメタルギアの開発チーフを勤めていた彼し'
'かいない、ということだ。'
'そしてベイカーは、エメリッヒの捜索を約束したス'
'ネークに一枚の光ディスクを渡した。それには演習'
'データが収められているという。'
ページ070:
'演習データ？　'
'メタルギアの演習データのことだろうか？'
'リチャードの眉がぴくりと動くのが見えた。'
'ベイカーがスネークに言う。'
'「別にとぼけることはない。あんた、これを回収す'
'るように言われてきたんだろう？」'
'だがシャドー・モセス島でメタルギアの開発が行わ'
'れていたとしても、そのデータはＡＴ社の他の場所'
'にも残っているはずだ。しかもなぜそれを社長であ'
'るベイカー自らが持っているのだろうか？'
ページ071:
'スネークは戸惑いながらそれを受け取った。彼も私'
'同様、そのディスクの存在を知らされていなかった'
'のだろう。'
'光ディスクを渡したベイカーがスネークに懇願する。'
'「とにかく奴等を止めねばならん。アレが公になれ'
'ば我が社も私も……終わりだ……」'
'「メタルギアは既存技術じゃないのか？」'
'そう問うスネークに対しベイカーは答える。'
'「それ自体はな。だが……」'
'言い終わる前にベイカーが突然苦しみ出した。'
ページ072:
'「貴様、何かしたな……！」'
'咳き込むベイカーの呻きが聞こえてくる。'
'「まさか、例の……くっペンタゴンの役人どもめ…'
'…そうか、そういうことか……」'
'何かに思い当たったのか、もだえ苦しみながら'
'スネークにつかみ掛かろうとするベイカー。'
'だが彼は胸をかきむしり、そのまま息絶えてしまっ'
'た。それはアンダーソンの死に様に酷似していた。'
'ベイカーの死を目の当たりにし、スネークはすぐに'
'無線でキャンベルを呼び出した。'
ページ073:
'「大佐、聞いてるか？　こいつも死んだぞ！」'
'キャンベルに食って掛かるスネークだが、キャンベ'
'ルもナオミも何も分からないと言う。納得のいかな'
'いスネークに対し、逆にキャンベルは自分の姪、メ'
'リルと協力するよう頼んだ。もはや核発射を阻止す'
'るにはまず起爆コードを緊急解除するその鍵を手に'
'入れるしか方法はない。スネークはメリルと連絡を'
'とるべく、ベイカーの死体をおいてその場を立ち去'
'った。'
'　'
ページ074:
'ベイカーはDARPAの局長であるアンダーソンと癒着'
'して、表に出る事のない政府の「ブラック・バジェ'
'ット」を使用して新型メタルギア開発という巨大な'
'ブラック・プロジェクトを推進していた。後に調べ'
'たところ、数年前からアンダーソンの妻が「顧問」'
'として名を連ねる企業（勿論ペーパー・カンパニー'
'だ）の口座に定期的に数万ドル単位の入金があるこ'
'とが確認された。総計するとどのくらいの額になる'
'かは不明だが、ベイカーからアンダーソンの元に莫'
'大な賄賂が引き渡されていたことは確かなようだ。'
ページ075:
'しかしブラック・バジェットといえども有限ではな'
'い。そこで私はある噂を思い出した。アンダーソン'
'が多額の金を受け取るようになる数年前、当時の海'
'軍作戦総長がいわゆる「ペット・プロジェクト（お'
'気に入りの計画）」として、極秘裏に新型軍艦の建'
'造を進めているという噂があった。しかしそれがど'
'ういうものだったかは今となっては不明だ。計画は'
'海軍作戦総長の突然の死によって頓挫したのだ。そ'
'して、それはアームズ・テック社が新型メタルギア'
'の開発を始めた時期と重なる。'
ページ076:
'海軍作戦総長が進めていたプロジェクトに使われて'
'いたブラック・バジェットが新型メタルギア開発に'
'流用されたということだろうか。海軍作戦総長の死'
'因はあくまで自殺という発表だったが、それについ'
'ては当時様々な憶測が流れたのを覚えている。'
'とにかくアンダーソンとベイカー、二人の死は偶然'
'とは思えない。それにベイカーの死に際の言葉。彼'
'は確かに「ペンタゴン」と口にした。裏に何かある'
'に違いなかった。私はリチャードに聞いた。'
'　'
ページ077:
'「ベイカーまで死んでしまうなんて。彼の病歴も調'
'べてみる？」'
'「ああ。一応ね」'
'一見、彼に動じた様子はない。'
'「だが良かったんじゃないか？　腕の折れた爺さん'
'を連れていては、スネークも任務に差し支えるだろ'
'う」'
'「そういうところ、相変わらずね」'
'「何が？」'
'　'
ページ078:
'「偽悪趣味。何かごまかそうとする時、いつもわざ'
'と悪ぶった口をきく。何か隠してるのね」'
'リチャードはそっぽを向いた。'
'「別に。何も隠してないさ」'
'キャンベルの姪、メリルと無線機で連絡をとること'
'に成功したスネークは彼女と後に合流を図ることを'
'約し、まずはメタルギア開発者、ハル・エメリッヒ'
'博士の救出に向かった。だが辿り着いた研究室でス'
'ネークが見たものは、エメリッヒ博士に襲い掛かろ'
'うとする例の忍者の影だった。'
ページ079:
'再会は予想通り闘いとなった。'
'まるで何かを確認し合うようにお互い素手で殴り合'
'うスネークと忍者。'
'激しい拳打の応酬が無線機を通じて聞こえてくる。'
'だがそれは繰り出す拳と痛みを言葉として会話を交'
'わし合っているようにも思えた。'
'殴り合いはいつ果てるともなく続いたが、やがて忍'
'者は獣のような絶叫を上げ、その正気を失ったかの'
'ような咆哮とともに、いずこかに消え去ってしまっ'
'た。'
ページ080:
'私達は一度ならず二度までも忍者という存在に振り'
'回され、そしてまた何も掴めなかった。しかしスネ'
'ークは闘いを通じてその正体に思い当たったらしい。'
'彼は無線でキャンベルを呼び出した。'
'「グレイ・フォックス……奴はグレイ・フォックス'
'だ。大佐、間違いない」'
'キャンベルの声にも動揺が走る。'
'「そんな馬鹿な。彼はザンジバーランドで君に……」'
'「そう、殺されたはず。でも生きていたのよ」'
'ナオミ・ハンターが突然割って入った。'
ページ081:
'ナオミによると、彼女が＃｛ＦＯＸＨＯＵＮＤ、フォックスハウンド｝＃で遺伝子治療'
'を担当するようになる前、前任者のクラーク博士に'
'より遺伝子治療の人体実験が行われていたらしい。'
'その被験者となっていたのが隊内で唯一FOXの称号'
'を許され、名実ともに＃｛ＦＯＸＨＯＵＮＤ、フォックスハウンド｝＃最高の兵士と呼'
'ばれていたグレイ・フォックスだった。ザンジバー'
'ランドで瀕死の状態のまま回収された彼は、その優'
'れた身体能力と戦闘技術に目をつけられ、書類上は'
'戦死したことにされて開発中の強化骨格や遺伝子治'
'療の実験体となっていたのだという。'
ページ082:
'いつもの冷静さとは裏腹に妙に感情的に語るナオミ'
'に私は違和感を覚えた。'
'忍者の正体を知りながらなぜ今まで黙っていた、と'
'問うスネークに対し、ナオミは'
'「機密事項、だったから……」'
'とだけ言葉少なに答えた。'
'その実験体（グレイ・フォックス）は記録上では二年'
'前、実験を行っていた研究所の爆発事故で亡くなっ'
'たことになっていたという。'
'　'
ページ083:
'私はリチャードに聞いた。'
'「本当？」'
'「何が？」'
'「研究所の爆発事故よ」'
'「ああ。記録では、爆発の原因は不明。所長のクラ'
'ーク博士は死亡。グレイ・フォックスについては強'
'化骨格の断片のみが回収された、とあった」'
'「あなたも知ってて黙ってたのね」'
'「機密事項、だからね」'
'リチャードはナオミの口調を真似て言った。'
ページ084:
'忍者が去った後、スネークはエメリッヒ博士の保護'
'に成功した。'
'驚いたことに、彼はメタルギアを核搭載型の歩行戦'
'車としてではなく、移動型のTMD（戦域ミサイル防'
'衛）と聞かされて開発していたのだと言う。純然た'
'る核攻撃用の兵器を弾道ミサイル撃墜の防衛兵器だ'
'と開発者自身が思い込み開発していたとは、なんと'
'もおめでたい話だ。'
'自分が騙されていたと知ったエメリッヒ博士は、積'
'極的にスネークへの協力を申し出た。'
ページ085:
'博士の祖父は第二次大戦中の原爆開発プロジェクト、'
'マンハッタン計画に参画し、そのことを死ぬまで悔'
'やんでいたという。また彼の父はヒロシマに原爆が'
'投下された日に生まれたらしい。'
'「親子三代……僕の家系のDNAには核兵器に苦しめ'
'られる運命が書き込まれているのか……」'
'エメリッヒ博士が苦悩するのが聞こえてくる。純粋'
'に科学の発展を望み、人類の幸福を願って研究して'
'きた技術を兵器に利用されたことを恨み、後悔して'
'いるようだった。'
ページ086:
'だがそれは違う、と思う。核兵器や生物化学兵器な'
'どの大量破壊兵器に関わる技術だけでなく遺伝子工'
'学やサイバネティクスが件の忍者を生んだように、'
'最先端の科学は容易に殺戮用の技術に転用しうる。'
'科学者は自分の研究がもたらしうる結果に無関心で'
'いてはいけない。常に自分の研究に倫理的にも責任'
'を持たねばならないのだ。彼がそのことに気づく日'
'は来るのだろうか。軟禁されていた研究室から解放'
'されたエメリッヒ博士は自作のステルス迷彩を身に'
'つけて安全な場所へ避難した。'
ページ087:
'ステルス迷彩があればテロリストの目から逃れるこ'
'ともたやすいだろう。'
'スネークはメリルとの合流を果たし、＃｛ＦＯＸＨＯＵＮＤ、フォックスハウンド｝＃'
'隊員のサイキック、サイコ・マンティスを退け、メ'
'リルから受け取った鍵を使って起爆コードを再入力'
'するため、メタルギアが置かれている格納庫を目指し'
'た。しかし途中、＃｛ＦＯＸＨＯＵＮＤ、フォックスハウンド｝＃隊員の女狙撃手スナイ'
'パー・ウルフの待ち伏せを受けてメリルは負傷、彼'
'女を助けようとしたスネーク自身もまた捕らわれの'
'身となってしまった。'
ページ088:
'捕虜となったスネークは気を失ったまま＃｛ＦＯＸＨＯＵＮＤ、フォックスハウンド｝＃'
'のテロリスト達の前に連行された。他の装備は全て'
'奪われたが、無線機はスネークの耳小骨に埋め込ま'
'れている。彼等はその存在に気づかず、無線機は取'
'り上げられることはなかった。'
'スネークは気を失っていたが、無線機を通じてテロ'
'リスト達の会話が聞こえてくる。彼等は既に核発射'
'の準備を完了しているようだった。'
'リチャードはなぜかその場にいるテロリストの特定'
'にこだわっていた。'
ページ089:
'結果、交わされた会話の声紋からスナイパー・ウル'
'フ、リボルバー・オセロットだけでなくテロリスト'
'のリーダー、リキッド・スネークが確認された。'
'リキッド・スネーク。'
'ソリッド・スネークと同じコードネームを持つ男。'
'私はリチャードから作戦開始の直前にリキッドの資'
'料を見せられていた。それによれば、リキッド・ス'
'ネークはソリッド・スネークの除隊後＃｛ＦＯＸＨＯＵＮＤ、フォックスハウンド｝＃'
'に入隊し、またたくまにその戦闘能力の高さを発揮'
'して新制＃｛ＦＯＸＨＯＵＮＤ、フォックスハウンド｝＃の実戦部隊リーダーとなる。'
ページ090:
'本名・出身地等全て極秘。ただ一枚の写真のみが書'
'類に添付されていた。それを見た私は思わず声を上'
'げた。私の当惑を見透かしたようにリチャードが言'
'った。'
'「間違いじゃない。それがリキッド・スネークだ」'
'「でも……どういうこと？」'
'その写真はソリッド・スネークと瓜二つだったのだ。'
'「さあね。だけど、そのうち分かるんじゃないか。'
'二人のスネークが顔を合わせればね」'
'そうリチャードは意味ありげに言った。'
ページ091:
'そして今ソリッドとリキッド、二人のスネークが対'
'面した。だがリキッドはスネークに向かい、'
'「じゃあな、兄弟」'
'と一言だけ声をかけてその場を去った。それは憎し'
'みのこもった、それでいて後に再会する事を確信し、'
'それを楽しみにしているかのような不可解な口調だ'
'った。なぜスネークのことを「兄弟」と呼んだのか'
'も含め、その時の私にはリキッドの真意を理解する'
'事は出来なかった。'
'　'
ページ092:
'リキッドとの対面の次にスネークを待っていたのは、'
'オセロットによるKGB仕込みの拷問だった。だがオ'
'セロットは何を聞き出そうというでもなく、ただ拷'
'問そのものを楽しんでいるようだった。無線を通じ'
'てスネークの呻き声が痛々しく響く。それ以上にナ'
'ノマシンが電送する心拍数、呼吸数等の生体データ'
'がスネークの受けている苦痛がどれほどのものかを、'
'非情に伝えてきた。私たちにはそれを見守ることし'
'か出来ない。'
'　'
ページ093:
'拷問が終わった後、傷ついたスネークは独房に閉じ'
'込められた。'
'無線機を使い、キャンベルはスネークと連絡をとっ'
'た。だが既にメタルギアが新型の核兵器を発射する'
'ために開発されたシステムだと気づいていたスネー'
'クは逆にキャンベルを問いただす。黙り込むキャン'
'ベル。スネークが苦々しく呟いた。'
'「やはり、初めから知っていたか……」'
'続くキャンベルの沈黙がスネークの疑いを肯定して'
'いた。'
ページ094:
'「なぜ隠していた」'
'「……すまない……」'
'「一兵士には話せない、というわけか。変わったな、'
'あんた」'
'スネークの皮肉にもキャンベルは言葉を返せなかっ'
'た。キャンベルによれば、大統領は昨日までレック'
'ス計画の事は知らされていなかったらしい。しかも、'
'大統領は明日、ロシアの代表とSTART3（第三次戦略'
'兵器削減条約）の調印を行うことになっている。'
'　'
ページ095:
'START3はSTART2（第二次戦略兵器削減条約）をさら'
'に推し進めた核兵器削減条約だ。START2の発効後、'
'戦略核弾頭の配備数を米露双方で2000〜2500発に'
'まで削減することになっている。様々な紆余曲折を'
'経てようやく調印にこぎつけた条約だ。この時期に'
'アメリカで新型の核兵器が開発されていた事が明ら'
'かになれば、条約の調印が反故になる可能性がある'
'だけでなく、合衆国への不信も高まり大きな国際的'
'混乱を招くことになり兼ねない。政府はあくまでも'
'事が公になることを避けようとするはずだ。'
ページ096:
'リキッド達がこの時期にテロを起こし核発射の刻限'
'を24時間と区切ったのはそのあたりの事情を計算し'
'てのことだったのだろう。'
'なおもキャンベルが懇願する。'
'「スネーク、奴等をくい止めてくれ」'
'「勝手なことを……」'
'「君が頼りなんだ」'
'「それじゃ教えてもらおう。新型核弾頭の正体を？」'
'「何度も言うが、内容は知らん」'
'　'
ページ097:
'「信じられんな」'
'「……」'
'「それほど逼迫した状況なら、なぜ奴らの要求を飲'
'まない？　ビッグボスの死体など、くれてやればい'
'い」'
'「それは……」'
'口篭もるキャンベルをスネークが追求する。'
'「それとも、どうしても要求を飲めない理由がある'
'のか？　まだ俺には話していない理由が？」'
'　'
ページ098:
'押し黙るキャンベルの代わりにナオミが割って入っ'
'た。'
'「大統領は生命倫理にも厳しい政策を発表してきた'
'の。軍でゲノム兵が実用されていた事を知られたく'
'ないのよ」'
'「本当にそれだけか？」'
'キャンベルは答えなかった。'
'スネークからの無線が入った。'
'敵地で独り捕虜になり、本来頼るべき仲間も信用す'
'ることが出来ない。'
ページ099:
'そんな状態のスネークに私が言えることはほとんど'
'無かった。'
'「例え捕虜になったとしても、脱出のチャンスがな'
'いわけではない。あきらめずに隙を伺うんだ」'
'従軍経験も無い私の言葉が励ましになるかどうかは'
'疑問だったが、そう言うのが精一杯だった。今はス'
'ネークを信じることしかできない。'
'無線を切ると、リチャードがこっちを見ていた。'
'「何？」'
'　'
ページ100:
'「……ずいぶん熱心だなと思ってね」'
'「いけない？あなたがやらせてる仕事よ」'
'「いや、ただ妬けるだけさ」'
'「妬ける振りをしてるだけでしょ」'
'リチャードは目をそらせた。'
'「……そうでもないよ。もしも……いや、やめてお'
'こう」'
'彼はそれ以上言わずに煙草に火をつけた。'
ページ101:
'「煙草……昔と同じのを吸ってるのね」'
'「ああ。一度決めればそう簡単に変えられるもんじ'
'ゃない。住処や女と同じさ」'
'彼はそう答えた。私の目は見なかった。'
'　'
'拷問はただスネークをいたぶるためだけに何度も繰'
'り返されていた。だが彼は屈しようとはしない。し'
'かし拷問は確実にスネークの体力を奪っていく。無'
'線から漏れ聞こえてくる声も弱々しくなっていった。'
'　'
ページ102:
'「ナオミ、何か話をしてくれ。苦痛を紛らわしたい」'
'「どんな？」'
'「何でもいい」'
'「私、自分から話すのは苦手……」'
'「そう、君の事が聞きたい。君の事を話してくれ」'
'「私の事？……難しいわね」'
'「家族は？」'
'「……私には愉快な話題じゃないわ」'
'「俺には家族はいない……いや、一人父親を名乗っ'
'た男が居た……」'
ページ103:
'「その人は？」'
'「殺した。俺がこの手で」'
'続いてキャンベルの口から出た言葉に私は驚いた。'
'「……ビッグ・ボス、か」'
'「えっ？　ビッグ・ボスが？」'
'驚くナオミにキャンベルが続ける。'
'「君が知らないのも無理はない。６年前……ザンジ'
'バーランド……真相を知る者は、今では私とスネー'
'クだけだからな」'
'「そんな……ビッグ・ボスは……本当にあなたの？」'
ページ104:
'なおも信じられない、という様子のナオミにスネー'
'クが答えた。'
'「……奴はそう言った。それだけが事実だ」'
'「あなたは……それを知っていて、彼を？」'
'「……ああ」'
'「どうして！」'
'激しい口調で詰問するナオミに、スネークはしばし'
'の間をあけてから答えた。'
'「それを望んだからだ。俺も……そして奴も」'
'「そんな……親殺しなんて……」'
ページ105:
'「ああ。……俺の人生のトラウマだ……」'
'スネークの答えは今まで聞いたことがないほど弱々'
'しいものだった。'
'「＃｛ＦＯＸＨＯＵＮＤ、フォックスハウンド｝＃を離れたのは、そのせいなの？」'
'「…アラスカの厳しさが心地よかったのは確かだ…」'
'「スネーク……」'
'沈黙の後、ナオミは呟くように語った。'
'「……私も……本当の家族はいない。大学まで進学'
'させてくれた兄が一人。血は繋がってない。兄と言'
'っても歳は随分、離れていたけど」'
ページ106:
'「その人は？」'
'スネークの問いにナオミは苦しそうに答えた。'
'「……もういない……」'
'その声には深い悲しみ以外の何かが混じっているよ'
'うにも聞こえた。'
'　'
'「聞いてないな。大学まで進学させてくれた、血の'
'繋がってない兄か……」'
'リチャードが呟いた。'
'　'
ページ107:
'その声には不審さだけでなく、何か怒りの様なもの'
'が混じっているようにも聞こえたのが不思議だった。'
'私は手元にあるナオミの資料を見た。'
'ナオミ・ハンター。'
'198X年、ニューヨーク生まれ。'
'大学で博士号取得後、カリフォルニアの通称バイオ'
'テックベイにあるバイオビジネスの大手企業ATGC社'
'に入社。遺伝子治療にたずさわり、そこでの業績を'
'認められ＃｛ＦＯＸＨＯＵＮＤ、フォックスハウンド｝＃の遺伝子治療担当として招聘'
'される。'
ページ108:
'両親は二歳の時に交通事故で死亡。十歳年上の兄が'
'いたが、ナオミが１７歳の時に所属していた合衆国'
'海兵隊の訓練中の事故で死亡。その他の係累なし…'
'…。'
'リチャードはしばし考えた後、手帳に何やら書き込'
'むと部下を呼んだ。'
'「ディスカバリーの艦長に電文だ」'
'リチャードはそのページを破って部下に渡し、付け'
'加えた。'
'「キャンベルには知られないようにな」'
ページ109:
'「いったい何を？」'
'勿論、私のその質問にリチャードが答えるはずはな'
'かった。'
'　'
'拷問は以後も繰り返されたが、スネークは看守の一'
'瞬の隙をつき独房から脱出することに成功した。'
'しかしテロリストに捕らえられたメリルの安否は知'
'れない。'
'激しい追撃の手を逃れながら、それでもスネークは'
'メタルギアの格納庫へ向かおうとする。'
ページ110:
'何が彼をそこまでつき動かすのだろうか？　メリル'
'を捕らえられたことへの罪悪感と復讐。任務への責'
'任。核による大量殺戮を阻止することへの使命感。'
'どれも違う気がする。私にはわからなかった。私に'
'は傷つきながらもひた走るスネークをただ見守る事'
'しか出来なかった。'
'待ち伏せしていたスナイパー・ウルフとの再戦も制'
'しメタルギア格納庫に肉迫したスネークの前に＃｛ＦＯＸ、フォックス｝＃'
'＃｛ＨＯＵＮＤ、ハウンド｝＃隊員バルカン・レイブンが立ちふさがった。'
'　'
ページ111:
'戦闘機搭載用の巨大なガトリング・ガンを操るレイ'
'ブンに苦戦しながらも、スネークは打ち勝った。'
'歩み寄るスネークにむかって、レイブンはその傷つ'
'いた巨体を壁にもたれかけて語った。'
'「お前は自然が作りだした蛇ではない。お前もボス'
'も、違う世界から来た……俺達の知る世界ではない。'
'決着をつけて来い。俺は最後を見ている……」'
'苦しい息の下でレイブンが語ったのは驚くべきこと'
'だった。'
'　'
ページ112:
'「お前にひとつヒントをやろう。お前の目前で死ん'
'だ男……あれは……局長ではない。あいつはデコイ'
'・オクトパス……俺達と同じ＃｛ＦＯＸＨＯＵＮＤ、フォックスハウンド｝＃だ。奴は'
'変装の名人だった……。しかし、死神までは騙せな'
'かった訳だ」'
'「死神？」'
'スネークの問いにレイブンは答えない。スネークは'
'代わりの問いを発した。'
'「そんな手間を掛けてまで……なぜ局長のふりを？」'
'レイブンは微かに笑った。'
ページ113:
'「ヒントはここまでだ。この先は自力で解明するん'
'だな」'
'間もなくレイブンは息絶えた。'
'　'
'「そういうことか。やってくれるな」'
'苦々しげに呟くリチャードに私は聞いた。'
'「なぜデコイはアンダーソンに化けたのかしら？」'
'「さあな。スネークから情報を聞き出そうとしたの'
'か……」'
'　'
ページ114:
'「ということは彼等はスネークの侵入をあらかじめ'
'知っていた、ということ？」'
'リチャードは無言で煙草を揉み消した。それ以上は'
'何も言わず表情にも出さなかったが、彼が何を考え'
'ているかはすぐに分かった。'
'内通者がいるのだ。'
' '
'リチャードと私が話している間に、スネークの元に'
'無線連絡が入った。'
'　'
ページ115:
'「スネーク、私だ……」'
'「マスター？」'
'スネークが答えた。相手はマスター・ミラーらしい。'
'「ナオミ・ハンターの件だが……モニターはオフに'
'……」'
'「ナオミがどうした？」'
'　マスターが切り出した途端、キャンベルが割って'
'入ってきた。'
'マスターが舌打ちする。キャンベルには聞かれたく'
'ない話だったらしい。'
ページ116:
'スネークがキャンベルに聞く。'
'「大佐、そこにナオミはいるのか？」'
'「いや、席を外している。少し仮眠を取っていると'
'ころだ」'
'「そうか……」'
'「で、ナオミがどうかしたか？」'
'問い掛けるキャンベルに対し、マスターがあきらめ'
'たように答えた。'
'「わかった。キャンベルにも聞いて貰った方がいい'
'かもしれん」'
ページ117:
'「ああ、マスター……続けてくれ」'
'スネークに促されたマスターは驚くべきことを告げ'
'た。'
'「ナオミ・ハンターだが……キャンベルの側にいる'
'のは偽物だ」'
'「何だと！？」'
'思わず声を上げるキャンベル。マスターは構わず続'
'ける。'
'「確かにナオミ・ハンターという人物は実在する。'
'いや、実在した。しかし、彼女とは全くの別人だ。'
ページ118:
'中東で行方不明になっている。彼女はその『ナオミ'
'・ハンター』の戸籍を何処かで入手したに違いない」'
'確かに闇ルートを使えば社会保障番号等を手に入れ'
'ることは可能だ。しかし……。'
'キャンベルが声を荒げる。'
'「では彼女は何者だというんだ！？」'
'マスターはあくまで冷静に答えた。'
'「おそらくは……スパイ」'
'「スパイだと！！」'
'「ああ……今回の作戦を妨害する為に……」'
ページ119:
'「テロリストの仲間だとでもいうのか？ 」'
'キャンベルは信じられないという様子だった。しか'
'しスネークもマスターに同意したように言う。'
'「俺も信じたくはない。だが彼女も＃｛ＦＯＸＨＯＵＮＤ、フォックスハウンド｝＃の'
'人間だ……」'
'キャンベルが疑惑をかき立てられたようにスネーク'
'の言葉を継いだ。'
'「共に蜂起してもおかしくはない？」'
'マスターがまた別の疑念を提示する。'
'「あるいは別の組織かもしれんぞ？」'
ページ120:
'「別の……？　ありえんことだ……」'
'考え込むキャンベル。'
'マスターが非情な声で進言した。'
'「あの女を拘束しろ、大佐」'
'「何！」'
'「ナオミ・ハンターが我々を裏切っているのは確実'
'だ。彼女を尋問して何が目的か吐かせるんだ」'
'キャンベルが呟いた。'
'「彼女が奴等のスパイだとすると大変な事になる…'
'…」'
ページ121:
'その声の深刻さにマスターが反応する。'
'「何の事だ！？」'
'「い、いや……」'
'口篭もるキャンベル。'
'「キャンベル、彼女に何か重要な機密を任せている'
'のか？」'
'「……」'
'答えないキャンベルをマスターはなおも追求する。'
'「もしかして、DARPA局長やアームズ・テック社長'
'が変死した事と関係が？」'
ページ122:
'「私は……知らん」'
'キャンベルは何かを知っている。だがそれを言う気'
'はないということだろう。'
'マスターもそれを悟ったのか、それ以上の追求をや'
'め、かわりに言った。'
'「とにかくこれ以上、その女を作戦に参加させるの'
'は危険だ」'
'「まっ、待ってくれ。彼女抜きでは本作戦は完遂で'
'きん」'
'キャンベルはあくまでもナオミに固執している。'
ページ123:
'「重要な機密」を任せていた、というのは事実なの'
'だろうか。スネークが疑いに満ちた声で言う。'
'「やはり、隠しているな？」'
'「私にも時間をくれ。彼女を洗ってみる……」'
'キャンベルはそう答えるのが精一杯のようだった。'
'「急げよ。一刻も早く彼女の目的を掴むんだ」'
'念を押すマスターにキャンベルは渋々同意した。'
'「……分かった。スネーク、時間をくれ」'
'スネークが吐き捨てる。'
'「こっちには時間が残されていないがな」'
ページ124:
'「どういうこと？」'
'私はリチャードに聞いた。'
'「マスターの言ってたことは本当なの？」'
'「分からない。ナオミに俺の知らない何かがあった'
'というのは確かなようだ……調べ直させている最中'
'だが……」'
'リチャードは悔しそうに言いよどんだ。彼が多少で'
'も感情を表に出すのは珍しい。リチャードとナオミ'
'の間には何かがあったのだろうか。リチャードは煙'
'草に火をつけると、気を取り直したように続けた。'
ページ125:
'「だが、ナオミについてマスターが言っていること'
'が事実だとすると、不自然なのはむしろ彼の方だ」'
'「どうして？」'
'「彼はアラスカにいるんだろう」'
'「そう言ってたわね」'
'「そこからどうやってナオミの身元を調べたのか。'
'しかも俺達DIAが掴むよりも早く、だ」'
'リチャードは部下を呼んで、マスター・ミラーの調'
'査を指示した。'
'　'
ページ126:
'去っていく部下の背中を見ながら私はリチャードに'
'言った。'
'「味方なのに調べるの？」'
'彼は紫煙を吐き出しながら言った。'
'「味方かどうかなんて、どうして分かる？」'
'「……私のことも信じてないわけね」'
'「信じてないのは君の方だろ。いつだってね」'
'そう言ってリチャードは煙草を揉み消した。'
'　'
'スネークは遂にメタルギアの格納庫に辿り着いた。'
ページ127:
'スネークの前にそびえ立つ全高14メートルの威容。'
'だがメタルギアは最新式の複合装甲を採用している。'
'スネークの現在の装備では、敵の監視をかいくぐり'
'ながら破壊するのは難しい。鍵を使って起爆コード'
'を再入力して、既に入力された起爆コードを無効化'
'するのが核発射を阻止する一番現実的な方法だった。'
'起爆コードの入力システムを探すスネークの元に別'
'行動をとっていたエメリッヒ博士から連絡が入った。'
'ベイカーの極秘ファイルにアクセスし、メタルギア'
'と新型核兵器の正体を突き止めたと言うのだ。'
ページ128:
'エメリッヒ博士が言うには、新型核兵器の正体とは'
'メタルギアに装備されたレールガンで核弾頭を射出'
'するものらしい。射出された核弾頭は大気圏外に達'
'してから自律的に姿勢を制御し弾道コースをとって'
'目標に向かうという。'
'私はその意味を悟り慄然とした。'
'通常、弾道ミサイルが発射されてから着弾するまで'
'の過程は、４段階に区別される。最初がミサイルが'
'発射されてから大気圏の外に到達しロケット燃料が'
'燃えつきるまでのブースト段階。'
ページ129:
'二段階目が、燃料の燃焼が終わってから弾頭を収め'
'た再突入体を放出するまでのポスト・ブースト段階。'
'三段階目が、再突入体を放出してから弾道飛行し大'
'気圏に再突入するまでの中間コース段階。そして最'
'後の四段階目が、大気圏に再突入してから地上の目'
'標に到達するまでの終末段階。'
'現行のミサイル防衛システムは、軍事衛星でブース'
'ト段階にある弾道ミサイルのロケット噴射を感知し'
'て作動する。しかし新型核兵器はブースト段階をレ'
'ールガンの超高速射出機能を用いて代行する。'
ページ130:
'つまり既存のミサイル防衛システムで発見する事は'
'出来ないのだ。'
'その性能も驚くべきもので、約五千キロという中距'
'離弾道弾並みの射程距離を持ち、半数必中界（目標'
'からの中心から50％の確率で命中する範囲）も50メ'
'ートルと、最高のICBM並の命中精度を誇るという。'
'いかなる悪路も走破するメタルギアに搭載すること'
'で地上のあらゆる地点から、この核兵器が発射可能'
'になる。'
'　'
ページ131:
'どこから撃たれたのかさえ分からない不可視の核攻'
'撃。報復攻撃をその根幹におくMAD（相互確証破壊'
'）戦略も無効になる。従来とられてきた核戦略その'
'ものが根底から覆されることになるのだ。世界は混'
'乱を極めることになるだろう。'
'真相を知ったスネークが無線でキャンベルに詰め寄'
'った。'
'START３の調印を控えたこの時期に、アメリカが新'
'型核兵器を開発していたという事実が明らかになれ'
'ば勿論交渉は決裂し、合衆国の権威は失墜する。'
ページ132:
'「知ってたのか。大佐？」'
'「……すまない」'
'「あんたは変わったな……」'
'「言い訳はせんよ……」'
'黙り込むキャンベルを放置してエメリッヒ博士が言'
'う。'
'「スネーク。新型核弾頭だけど、完成していたのは'
'あくまでもシミュレーション上での事なんだ。だか'
'ら彼らは今回の演習を行ったんだ。シミュレーショ'
'ンを裏付けするデータを収拾する為のね」'
ページ133:
'「演習の結果は？」'
'問い掛けるスネークにエメリッヒ博士が答える。'
'「想像以上にうまくいったようだ。ただし、その全'
'記録データが見あたらない。ここのネットワーク内'
'の何処にも見あたらないんだ。一番重要なデータな'
'はずなんだけど……」'
'「そのデータならベイカー社長から預かった。光デ'
'ィスクでな」'
'スネークのその言葉を聞いたキャンベルが思わず声'
'を上げた。'
ページ134:
'「なんだと！　今も持っているのか？」'
'スネークは苦々しく答えた。'
'「いや、オセロットに奪われた」'
'捕虜となった時のことだろう。するとオセロットは'
'演習データの存在を知っていたのか。'
'それを聞いたキャンベルは深刻に考え込んだ。'
'「なんてこった……」'
'　'
'　私はリチャードを睨み付けた。'
'「あなたも知ってたのね」'
ページ135:
'「何を？」'
'「新型核兵器」'
'リチャードは肩をすくめてみせた。'
'「言ったら協力してくれたかい？　そのままどこか'
'のマスコミに連絡をとろうとしたんじゃないのか？'
'そうしたら……」'
'彼はそれ以上は言わなかった。機密保護上、私を消'
'さなければならなくなっていた、というところだろ'
'う。彼の世界では国家の機密が個人の命よりも優先'
'されるのが当たり前なのだ。'
ページ136:
'ではその機密を知ってしまった今は？　背中に冷た'
'いものが走るのが分かった。リチャードは黙って煙'
'草をふかしている。彼のまわりにはたくさんの部下'
'達がいる。逃げ出すことは出来そうに無かった。'
'だが私にも切り札がある。簡単にいいようにはさせ'
'ない。私は机の上のPCを見た。スクリーン・セーバ'
'ーがかかり、暗くなった画面の上で幾何学的な図形'
'が踊っていた。'
'私はPDAをポケットに入れ、トイレに向かった。一'
'通の電子メールを出す為に。'
ページ137:
'リチャードの元に部下が一枚のメモを持ってきた。'
'それを見た彼はしばらく考えると、ディスカバリー'
'のキャンベルを無線で呼び出した。'
'「何か用か、エイムズ少佐」'
'キャンベルの声には明らかに敵意が満ちていた。だ'
'がリチャードは全くそれを気にした様子はない。'
'「キャンベル大佐、あなたにナオミ・ハンターを尋'
'問してもらいたい」'
'「尋問？　何の事だ？」'
'　'
ページ138:
'キャンベルの声が尖った。リチャードは構わずに続'
'ける。'
'「あなたも聞いた通り、ナオミには不審な点がある。'
'それをそちらに乗り込んでいる私の部下に調べさせ'
'ていたんですが……なかなか話してくれないような'
'んでね」'
'リチャードは煙草に火をつけた。'
'キャンベルが反論する。'
'「彼女は仮眠を取っている」'
'「それは嘘です」'
ページ139:
'「何？」'
'「実際は私の部下が拘禁しています」'
'「何だと！？」'
'気色ばむキャンベル。しかしそれに答えるリチャー'
'ドはあくまでも冷静だった。'
'「もしもマスター・ミラーの言う通り、ナオミが身'
'元を偽り敵に通じているとなると、大きな問題が生'
'じます。お分かりですね」'
'キャンベルが苦渋に満ちた様子で呟いた。'
'「……＃｛ＦＯＸＤＩＥ、フォックスダイ｝＃、か……」'
ページ140:
'＃｛ＦＯＸＤＩＥ、フォックスダイ｝＃？　聞いた事が無かった。'
'この作戦の裏には、まだ何かがあるのか。'
'「私の部下では無理でも、あなたなら何か聞き出せ'
'るかもしれない。ナオミから彼女の正体と目的を聞'
'き出して下さい」'
'「断る。君の命令をうけるいわれなど無い。ナオミ'
'もすぐに解放させる」'
'リチャードは大きく紫煙を吐き出した。'
'「出来るとでも？」'
'長い沈黙。'
ページ141:
'「……貴様、何者だ？」'
'キャンベルの声には怒りが滲んでいた。'
'「……海軍の潜水艦に部下を潜り込ませるなどDIA'
'の権限を越えている」'
'リチャードは答えない。キャンベルは独りで続ける。'
'「いや、それだけじゃない。スネークや私を引き込'
'んだやり方といい……この作戦自体が政府の正式な'
'命令ではないな？　だがこれだけの大掛かりな作戦'
'を……」'
'キャンベルは何かに気づいたように呟いた。'
ページ142:
'「まさか『奴等』か……？」'
'リチャードはキャンベルの問いを無視して言った。'
'「私が何者だとしても、あなた、そしてあなたの大'
'事なメリルの命を自由に出来るという事実に変わり'
'は無い。そうでしょう？」'
'今度はキャンベルが黙り込む番だった。キャンベル'
'は自分とメリルの命と引き換えに作戦への参加を強'
'要されていたというのか。'
'リチャードの声が冷たく響いた。'
'「よく考えてみることですね、キャンベル大佐」'
ページ143:
'「……」'
'「それと、このことはスネークには内密に。彼には'
'まだ働いてもらわなければならない。ナオミはテロ'
'リストのスパイで敵に暗号で情報を流していた、と'
'でも言っておけばいいでしょう」'
'キャンベルが怒りの声を上げる。'
'「友人を裏切れ、というのか？」'
'「友人？　スネークのことですか？」'
'リチャードは冷たい笑いを浮かべた。'
'「向うもまだそう思っていますかね？」'
ページ144:
'「……」'
'答えられないキャンベルにリチャードが追い討ちを'
'掛ける。'
'「あなたはもう十分彼に嘘をついている」'
'「貴様達がそう強いたのだろうが！」'
'キャンベルの怒声にもリチャードは平然としていた。'
'「その通りです。だけどそれは問題じゃない。あな'
'たはあなたの意志で、スネークに嘘の情報と指令を'
'与えていたんだ。それに＃｛ＦＯＸＤＩＥ、フォックスダイ｝＃……」'
'キャンベルが歯噛みするのが聞こえた。'
ページ145:
'「まだ自分にスネークの友人でいる資格があるとで'
'も？」'
'キャンベルは答えられなかった。'
'「協力、してくれますね」'
'「わかった……」'
'通信は切られた。'
'　'
'「キャンベルの言っていた『奴等』って？」'
'　私の問いにリチャードは明後日の方向を向いた。'
'「何の事だい？」'
ページ146:
'「とぼけないで！」'
'振り返ったリチャードの目は笑っていなかった。'
'「君が知る必要のないことだよ。……それより、君'
'もスネークには余計なことは言わないで欲しいな」'
'「言えば私も……？」'
'リチャードの沈黙が私の問いを肯定していた。私は'
'あまりにも危険なことに足を踏み入れてしまったよ'
'うだ。'
'「作戦が終わった後、私をどうするつもり？」'
'「どうもしないよ」'
ページ147:
'「信じられない」'
'そう言うと、リチャードは少し寂しそうに笑った。'
'「……だろうね」'
'　'
'その間にもスネークは起爆コードの入力システムを'
'目指していた。'
'彼の元に再びマスターから連絡が入った。'
'「スネーク。ナオミ・ハンターの事だが？」'
'「その話なら、大佐が調査中だ」'
'「モニターをオフにしてくれ」'
ページ148:
'「オフにした。作戦室には聞かれていない。話して'
'もいいぞ？」'
'スネークはモニターをオフにしたつもりらしい。だ'
'がその話はこちらには聞こえていた。無線機の故障'
'？　いや、おそらく私達の側に対しては会話を秘匿'
'する事が出来ないように設定されているのだ。誰が'
'そう仕組んだかは考えるまでも無い。'
'そうは知らないマスターは言った。'
'「すまない。キャンベルにも聞かれたくない」'
'「で、どういう事だ」'
ページ149:
'スネークの問いにマスターが答えた。'
'「ペンタゴンに私の知り合いがいる。その友人から'
'聞き出したんだ。……DIA主導で最近、ある暗殺兵'
'器が開発されていたらしい」'
'私はリチャードを見たが、彼は私の視線に気づかな'
'い振りをしている。スネークが聞き返すのが聞こえ'
'る。'
'「暗殺兵器？」'
'「スネーク、＃｛ＦＯＸＤＩＥ、フォックスダイ｝＃という言葉を聞いたことがあ'
'るか？」'
ページ150:
'はっとした。＃｛ＦＯＸＤＩＥ、フォックスダイ｝＃。リチャードとキャンベル'
'が口にしていた……。'
'マスターが続ける。'
'「それは特定の人物だけを死に至らしめるウィルス'
'らしい。私も詳しいことは聞いていないのだが……」'
'リチャードは無表情のままだ。'
'マスターの持って回った言い方に苛立ったのか、ス'
'ネークが声を荒げる。'
'「何がいいたい？」'
'「似ているんだよ」'
ページ151:
'「何が？」'
'「死因だ。アームズ・テック社長とDARPA局長、'
'いやデコイ・オクトパスか？　二人とも心臓発作の'
'ようだったな？」'
'「ああ」'
'「＃｛ＦＯＸＤＩＥ、フォックスダイ｝＃による死も一見、心臓発作で倒れたよう'
'に見えるらしい」'
'スネークは考え込み、しばらくして口を開いた。'
'「まさかナオミがそれを仕組んだといいたいのか？」'
'　'
ページ152:
'「スネーク、よく思い出してくれ。ナオミに注射か'
'何か、打たれなかったか？」'
'「……あのナノマシン」'
'スネークが呟いた。'
'確かに作戦開始前、スネークはナノマシンや不凍液'
'を含む混合液を注入されていた。その中に暗殺ウイ'
'ルスが混入されていたと言うのか。'
'「彼女が一番可能なポジションにいるのは確かだ。'
'動機も目的も分からんが……」'
'　'
ページ153:
'しばしの沈黙の後、口を開いたスネークの声には疑'
'念が満ちていた。'
'「……大佐はその事を？」'
'「わからん。まだあの女を尋問していないようだし'
'な」'
'「わかった。大佐に聞いてみる」'
'　'
'いったんマスター・ミラーとの通信を切り、スネー'
'クはキャンベルを無線で呼び出した。'
'「大佐、ナオミの件はどうなった？」'
ページ154:
'「ナオミなら……たった今、拘束した」'
'「拘束？」'
'スネークが思わず声を上げる。'
'それに答えるキャンベルの声は苦渋に満ちていた。'
'「アラスカ基地方面に向けて暗号を送っていた。'
'信じたくはないが……彼女はテロリストの一味だ」'
'キャンベルはリチャードに言われた通りの嘘をつい'
'ていた。スネークはそれに気づいていない。'
'「確かなのか？」'
'　'
ページ155:
'「そうだ、間違いない。今、尋問中だ」'
'「どんな尋問だ？」'
'「手荒いマネは避けたいが、ここには＃｛自白剤、チオペンタール｝＃も'
'ない……」'
'「何かわかったら、教えてくれ」'
'何も知らないスネークはそう言ってキャンベルとの'
'通信を打ち切った。'
'私はスネークに真実を伝えたかった。だがそれをリ'
'チャード達が許すはずもない。'
'　'
ページ156:
'様々な疑念を抱きつつも、スネークは潜入を続け'
'ていた。起爆コード入力装置を目前にした彼の元に'
'突然無線が入った。'
'「スネーク、聞こえる？　私よ……」'
'スネークは驚きの声を上げた。'
'「ナオミ！？　……君は一体」'
'リチャードが身を乗り出した。'
'「今、キャンベルさん達の目を盗んで別の無線機で'
'話をしているの」'
'ナオミは小声で焦っているようにささやく。'
ページ157:
'「ナオミ、大佐の話は本当なのか？」'
'スネークの問いに、ナオミは苦しそうに答えた。'
'「……ええ。でも、全てが嘘ではないわ。本当の部'
'分もある」'
'「君は誰なんだ？」'
'「私にもわからない。親の顔も名前も……今の名前'
'や戸籍はお金で買ったもの。……私が遺伝子に固執'
'した理由は本当よ」'
'「自分を知りたいから、そう言ったな？」'
'　'
ページ158:
'「ええ、私は自分が誰だがわからない。年齢も、'
'人種さえも……」'
'「ナオミ……」'
'しばしの間をおいてナオミは語り始めた。'
'「……私はローデシアで拾われた……孤児だったの。'
'80年代の事」'
'「ローデシア？　ローデシア独立戦争の頃か？」'
'「ジンバブエはイギリス領だった。当時はインド人'
'が多く働いていた。だから、私の肌の色はその為か'
'もしれない。でも、それもわからない……」'
ページ159:
'「ナオミ、どうして過去に拘る？　今の自分を理解'
'できればいいじゃないか？」'
'突然、ナオミは語気を荒げた。'
'「今の私を理解？　誰も私を理解などしてくれなか'
'ったわ」'
'「私はずっと自分を探してた……兄とあの人に会う'
'まではね」'
'スネークが聞く。'
'「兄？」'
'　'
ページ160:
'「そうよ。フランク・イエーガー」'
'スネークは驚きの声を上げた。'
'「なんだって？」'
'「兄も少年兵士だったわ。ザンベジ川で餓死寸前の'
'幼い私を拾って、自分の食べ物を割いてくれた」'
'少年兵士。'
'世界各地の紛争地域、特に人口の半数を未成年者が'
'占める開発途上国では子供が戦闘員として戦争に参'
'加する事は珍しくない。無知で純粋な子供達を徹底'
'した訓練で好戦的で残虐な戦士に仕立て上げるのだ。'
ページ161:
'多くの場合、恐怖心を麻痺させる為に各種の麻薬の'
'投与も平行して行われる。'
'こうして従順な殺人機として仕上げられた少年兵達'
'は、その勇敢さをあてこまれ、最前線や地雷原への'
'特攻隊としてしばしば使われるという。'
'ナオミは静かに言った。'
'「そう、あなたが廃人にしたフランク・イエーガー'
'は私の兄。唯一の家族」'
'「馬鹿な……グレイフォックスが？」'
'スネークも動揺を隠せない。'
ページ162:
'「私達はあの地獄で生き延びた。兄が守ってくれた。'
'兄は私の全てだった」'
'「私の存在を、私という個人を証明する唯一の拠り'
'所だった」'
'「奴が君をアメリカに？」'
'「いいえ、モザンビークであの人に助けられた」'
'「あの人？」'
'スネークは思い当たったその人物の名を口にした。'
'「……ビッグボスか？」'
'　'
ページ163:
'「ええ、彼は私達をこの自由の国へ導いてくれた。'
'でも、兄はあの人とまた戦場へ戻っていったわ。そ'
'して戻ってきた時には……」'
'ナオミは押し黙った。'
'その沈黙には怒りが満ちていた。'
'「私は復讐を誓った。兄を廃人とし、あの人を殺し'
'た貴方に。＃｛ＦＯＸＨＯＵＮＤ、フォックスハウンド｝＃に入ったのはそのためよ。'
'ここにいれば、必ずあなたに逢える、そう思ったか'
'ら……」'
'「……思いは果たせたな？」'
ページ164:
'スネークは従容としてナオミの言葉を受け止めてい'
'るようだった。'
'きっと恨みをうけることには慣れているのだろう。'
'「そうね、２年も待ったわ……」'
'「俺を殺す、ただそれだけの為に？」'
'「ええ……。そう、２年……。この２年間、ずっと'
'あなたを待っていた。あなただけを……。恋焦がれ'
'るように……」'
'「今も、憎いか？」'
'　'
ページ165:
'「……少し違う。あなたの事、誤解していた所もあ'
'る」'
'ナオミの声には迷いがあった。'
'「まさか、君の前任者を殺したのも？　グレイ・フ'
'ォックスをゲノム兵の実験体にしたという……」'
'「クラーク博士のこと？　いいえ、彼を殺したのは'
'兄よ。私は事件を隠蔽し、兄をかくまった……」'
'気まずい沈黙が流れる。'
'「……忍者……グレイ・フォックスは俺を殺すため'
'にここに？」'
ページ166:
'「……違う、と思う。兄はただあなたと闘う為だけ'
'に……。初めは分からなかったけど、今は分かる気'
'がするわ。あなたとの闘い。それだけのために兄は'
'生きているのよ、きっと。……」'
'「……フォックス……」'
'スネークはフォックスとの事を思い出にひたるよう'
'に呟き、しばしの後、口を開いた。'
'「ナオミ、教えてほしい……」'
'「……＃｛ＦＯＸＤＩＥ、フォックスダイ｝＃の、こと？」'
'　'
ページ167:
'彼女は苦しそうに語り始めた。'
'「＃｛ＦＯＸＤＩＥ、フォックスダイ｝＃は特定人物だけを死に至らしめるレトロ'
'ウイルスよ。まず＃｛ＦＯＸＤＩＥ、フォックスダイ｝＃は体内のマクロファージに'
'感染する。＃｛ＦＯＸＤＩＥ、フォックスダイ｝＃にはタンパク質工学で生み出さ'
'れた認識酵素、特定の遺伝子配列に反応するようプ'
'ログラムされた酵素が導入されているの」'
'「その酵素で暗殺ターゲットのDNAを認識している'
'？」'
'スネークの問いに答えるナオミには、もう迷いはな'
'いようだった。'
ページ168:
'「認識酵素が反応して活性を示すと、＃｛ＦＯＸＤＩＥ、フォックスダイ｝＃は'
'マクロファージの組織を使って、TNFεを作りはじ'
'める」'
'「何？」'
'「サイトカインの一種で細胞死を誘発するペプチド'
'よ。TNFεは血流に乗って心臓に達し、心筋細胞の'
'レセプターに結合する」'
'「それで、心臓発作を？」'
'「刺激を受けた心筋細胞は急激なアポトーシスを起'
'こすわ。そして、その人物は……死ぬ」'
ページ169:
'「アポトーシス、細胞が自殺するための遺伝子プロ'
'グラムか……」'
'スネークの呟きの後、再び気まずい沈黙が訪れた。'
'スネークが口を開いた。'
'「……ナオミ……」'
'「……なに？」'
'「……当然俺も殺すようにプログラムしたんだろ？」'
'ナオミは答えない。'
'「まだ、時間はあるのか？」'
'ナオミは答えなかった。'
ページ170:
'「ナオミ、俺は君に殺されても仕方がない男だ。だ'
'が死ぬわけにはいかない。まだやる事が残っている'
'んだ」'
'ナオミはせっぱ詰まったようにスネークに告げた。'
'「……聞いて、＃｛ＦＯＸＤＩＥ、フォックスダイ｝＃の使用を決定したのは私で'
'はないわ」'
'「君じゃ、ない？」'
'「あなたに＃｛ＦＯＸＤＩＥ、フォックスダイ｝＃を注入したのは、作戦の一部。'
'それをあなたに伝えたくて……」'
'　'
ページ171:
'言いよどんだナオミは、やがて意を決したように口'
'を開いた。'
'「……私、自分に素直じゃない」'
'「ナオミ？」'
'「私があなたに本当に伝えたかったのは……スネー'
'ク……私……」'
'何かを言おうとしたナオミの背後で突然男の声がし'
'た。'
'「おい、何をしている！」'
'　'
ページ172:
'「きゃっ！」'
'ナオミの悲鳴。リチャードの部下に見つかったのか。'
'無線の向うから争う音だけが聞こえる。'
'「……スネーク……」'
'そして、その呻き声を最後にナオミの声は聞こえな'
'くなった。'
'「ナオミ！？」'
'しかしスネークのその叫びに答えたのはキャンベル'
'だった。'
'　'
ページ173:
'「……スネーク、ナオミとの交信はこれ以上許され'
'ん」'
'「何！」'
'「ナオミは作戦から外された」'
'「ナオミをどうした？　作戦の一部とはどう言う事'
'だ？！　大佐、彼女と話をさせろ！」'
'「できん、彼女は監禁した」'
'スネークが怒りの声を上げる。'
'「大佐……裏切ったな！？」'
'キャンベルは感情を押し殺したような声で答えた。'
ページ174:
'「今は余計な事を考えるな。メタルギアをくい止め'
'る事が先決だ……スネーク、いいな」'
'　'
'「ナオミがグレイ・フォックスの妹だったとはな…'
'…」'
'全てを聞いたリチャードが苦々しく呟いた。'
'「良かったわね。彼女の正体がわかって？」'
'「そうでもないさ……」'
'リチャードは複雑な顔で考え込んでいる。私は聞い'
'た。'
ページ175:
'「彼女、＃｛ＦＯＸＤＩＥ、フォックスダイ｝＃の使用を決めたのは自分じゃない'
'って言ってた」'
'リチャードは何も言わない。それを見て、私は確信'
'した。'
'「あなたなのね」'
'「……そうだ」'
'彼は認めた。意外だった。'
'「＃｛ＦＯＸＤＩＥ、フォックスダイ｝＃は俺が進めていたプロジェクトの一つだ'
'った」'
'「ナオミは？」'
ページ176:
'「……優秀な科学者だったよ。＃｛ＦＯＸＤＩＥ、フォックスダイ｝＃の研究が一'
'時行き詰まっていた時、どこで聞きつけたのか、遺'
'伝子工学のスペシャリストとして彼女が売り込みに'
'来た。彼女がチームに入ってから研究は飛躍的に進'
'展した」'
'リチャードは少し間をおいて続けた。'
'「……俺は彼女をプロジェクトの開発チーフに任命'
'した……完成したウイルスに＃｛ＦＯＸＤＩＥ、フォックスダイ｝＃という名前を'
'つけたのも彼女だ」'
'彼は寂しそうに呟いた。'
ページ177:
'「彼女のあの熱心さが復讐から来た物だったとはね。'
'そんなことは一度も口には出さなかった」'
'リチャードの顔を見て私は、彼とナオミの関係に気'
'づいた。'
'「つきあってたのね？」'
'「利用されただけだよ」'
'　'
'リチャードの部下が血相を変えて彼の元に駆けてき'
'た。耳打ちをされたリチャードの顔色が変わる。'
'「どうしたの？」'
ページ178:
'私の問いに答えるリチャードは取り乱していた。'
'「マスター・ミラーはマスター・ミラーではない！」'
'「どういうこと」'
'「マスターを調べさせていた部下から連絡が入った'
'んだ。マスターはアラスカの自宅で殺されていた」'
'「じゃあ、あのマスターは！？」'
'その問いに答えられるものはいなかった。'
' '
'その時シャドー・モセス島ではスネークが遂に敵の'
'目をかいくぐり起爆コードの再入力に成功していた。'
ページ179:
'しかし入力と同時に、核が発射可能になったことを'
'示すコンピュータ・ヴォイスと警報が鳴り響く。'
'「起爆コードが入力されました」'
'「発射準備完了しました」'
'予想外の事態にうろたえるスネーク。'
'「なぜだ！　俺は解除したぞ！」'
'叫ぶスネークに、マスター、いやマスターの名を語'
'るマスター以外の何者かから無線が入った。'
'「ありがとう、スネーク。これで起爆コードの入力'
'は完了した。もうメタルギアを止める事はできない」'
ページ180:
'「マスター、これは？」'
'「わざわざ鍵を見つけてくれた上、起爆コードの入'
'力までしてくれて、本当に恩に着る」'
'「何のことだ？」'
'「DARPA局長の起爆コードは入手できなかったん'
'だよ。マンティスの能力を以てしても読む事はでき'
'なかった。オセロットは起爆コードを聞き出す前に'
'殺してしまった……」'
'唖然とするスネークに『マスター』はなおも続ける。'
'　'
ページ181:
'「つまり、俺達は核を撃つことはできなかった。威'
'嚇発射さえもな……まさに八方塞がりだった。核が'
'撃てなければ、我々の要求は叶えられない……」'
'私には事情が飲み込めない。それはスネークも同様'
'だった。'
'「マスター、何を言ってる？」'
'「起爆コードを入手できなくなった以上、別の方法'
'を探すしかない。そこでスネーク、貴様に賭けてみ'
'る事にした」'
'「何？」'
ページ182:
'「デコイ・オクトパスを局長に変装させたのもその'
'一つだ。貴様から情報を得ようとしたのだが……'
'＃｛ＦＯＸＤＩＥ、フォックスダイ｝＃とはな」'
'吐き捨てる『マスター』。スネークが怒りを噛み締'
'めて言う。'
'「全て最初から仕組まれていたというのか？　俺に'
'起爆コードを解除させるために……」'
'馬鹿にしたような笑い声が響いた。'
'「ん？　もしや、ここまで来れたのは、自分一人の'
'才能だと思っているのか？」'
ページ183:
'「マスター、あんたは？　あんたはスパイか？」'
'スネークの怒りを無視し、彼は続ける。'
'「とにかくこれで核発射準備は整った。新型核を撃'
'ち込んで見せれば、ホワイトハウスの連中も血清を'
'渡さざるを得まい。奴らの切り札も無効になる……」'
'「切り札？　一体？」'
'「お前を使ったペンタゴンの目論見は既に達せられ'
'ているんだよ。あの拷問部屋で。知らないのはお前'
'だけだ。惨めだな、スネーク？」'
'　'
ページ184:
'嘲笑が響く。'
'「貴様、誰だ！？」'
'「全て教えてやる。もしも俺の元まで辿り着けたら、'
'な」'
'「何処にいる？」'
'「すぐ近くさ」'
'突然キャンベルが無線に割り込んできた。'
'「スネーク、そいつはマスター・ミラーではない！」'
'「キャンベル、今頃気づいても遅い」'
'　'
ページ185:
'「マスター・ミラーの遺体が彼の自宅で発見された。'
'死後３日経ってる。マスターとの無線がオフにされ'
'ていたので、わからなかった。メイ・リンによると'
'発信源はその基地内だ」'
'「じゃ、お前は？」'
'「お前が話していたのは……」'
'「俺だ。兄弟」'
'その男が答えた。声の調子が今までとは違う。私に'
'もその正体が分かった。スネークがその名を口にす'
'る。'
ページ186:
'「まさかリキッドかっ！？」'
'スネークは通信を打ち切り、駆け出した。'
' '
'既にメタルギアは始動している。スネークはリキッ'
'ドを阻止するためメタルギアの元へ走った。そして'
'メタルギアの搭乗口で、今にも操縦席に乗り込もう'
'としているリキッドを捉えることに成功した。'
'スネークがSOCOMピストルを構え叫ぶ。'
'「リキッド！！」'
'　'
ページ187:
'だが銃を向けられてさえリキッドの声に焦りはない。'
'「兄弟に銃を向けるのか？」'
'「なぜマスターに化けた？」'
'リキッドはまるで銃が目に入っていないかのように'
'平然としていた。'
'「無論、貴様をうまく操る為だ。実際、お前はよく'
'働いてくれた」'
'悔しさに歯噛みするスネークをリキッドの嘲笑が追'
'い討ちする。'
'「ペンタゴンの連中もそう思っていることだろうよ」'
ページ188:
'「さっきから何を言っている？」'
'「与えられた命令を疑いもしないとは。戦士の誇り'
'を失い、駒に成り果てたか、スネーク？」'
'リキッドは大仰に嘆息してみせた。'
'「核発射の阻止、人質の救出……全て偽りの任務だ」'
'「偽りだと？」'
'思わず声をあげるスネークの反応を楽しむようにリ'
'キッドは続けた。'
'「ペンタゴンとしては、貴様と俺達が接触するだけ'
'でよかったんだ。'
ページ189:
'アームズ・テックの社長とデコイはそれで始末され'
'た」'
'「まさか……」'
'「そうとも。俺達だけを暗殺し、莫大な予算を投じ'
'たゲノム兵の遺体とメタルギアを無傷で回収するた'
'め……貴様ははじめから＃｛ＦＯＸＤＩＥ、フォックスダイ｝＃の運び屋としてペン'
'タゴンに送り込まれたんだ！」'
'愕然とするスネーク。'
'「……馬鹿な……ではナオミは……ペンタゴンと組'
'んでいたのか？」'
ページ190:
'「連中はそのつもりでいたようだが……。あの女、'
'ただ利用されるような甘い女ではなかった」'
'「何？」'
'「ペンタゴンに潜り込ませたスパイが突き止めた。'
'作戦直前、ナオミは＃｛ＦＯＸＤＩＥ、フォックスダイ｝＃のプログラムを改竄'
'していたらしい。だがその理由も目的も不明だ」'
'舌打ちするリチャード。'
'スネークの問いが響く。'
'「まさかナオミを逮捕させたのは、彼女の目的を掴'
'むため！？」'
ページ191:
'「その通りだ。くだらない恨みとは思わなかったが'
'……しかし結局ナオミが＃｛ＦＯＸＤＩＥ、フォックスダイ｝＃にどのような改変を'
'加えたかは今も分からない……」'
'しばしの間をおいてリキッドは続けた。'
'「まぁ、それももういい。俺は既にホワイトハウス'
'への要求に＃｛ＦＯＸＤＩＥ、フォックスダイ｝＃の血清を上乗せしてある」'
'「血清があるのか？」'
'思わずスネークが問い掛ける。'
'「あるはずだ。あの女にしかわからんがな……だが'
'もう、それも必要ないかもしれんな」'
ページ192:
'「なぜだ？」'
'「貴様は潜入に成功、奴等が処分したかった俺達は'
'目論見通り暗殺ウイルスに感染した。オクトパスや'
'アームズ・テック社長の死因は確かにウイルスだ。'
'しかし、オセロットも俺も、そして運び屋である貴'
'様にもまだその兆候が現れていない……」'
'「＃｛ＦＯＸＤＩＥ、フォックスダイ｝＃の標的プログラムにバグが？」'
'「さぁな。だが貴様に効果がない以上、俺も安全だ。'
'俺と貴様の遺伝コードは同じなのだから」'
'「やはり俺とお前は……」'
ページ193:
'「そうとも。だがただの双子ではない。遺伝子に呪'
'いを込められた双子。『恐るべき子供達』……」'
'リキッドの声に怒りが混じる。'
'「貴様はいい。親父の優性遺伝子を全てもらった」'
'黙り込むスネーク。その手で殺した父親、ビッグボ'
'ス。思い出したくない過去。だがリキッドは続ける。'
'「俺は劣性遺伝子ばかりを受け継いだ。全ては貴様'
'という優性種を作り出す為の仕掛けだ。俺という存'
'在はお前の創造の為だけにあった」'
'「俺が優性だと？」'
ページ194:
'「そうだ。俺はその絞りカスだ。貴様に分かるか！'
'？　生まれ落ちた時からクズと見なされ続けた惨め'
'さが！」'
'リキッドの怒りの激しさにスネークは言葉を失った。'
'リキッドはゆっくりと言った。'
'「だが、親父は俺を選んだ」'
'「……それがビッグボスにこだわる理由か？　歪ん'
'だ愛情だな」'
'「ハッ、愛情だと？　憎しみだよ。劣っていると知'
'って俺を選んだことへの復讐だ！！」'
ページ195:
'リキッドの言う意味が分からない様子のスネークを'
'リキッドが嘲笑う。'
'「これも貴様には分かるまい。実の親父をその手で'
'殺すことが出来た貴様には！　俺は復讐の機会すら'
'貴様に奪われた。だから俺は、親父の遺志を実現し'
'てみせる。親父を越え、親父を殺す」'
'そう言い放つとリキッドは、メタルギアのコックピ'
'ットへと身を翻した。すかさず構えていたSOCOM'
'を撃つスネークだが、その弾丸は空しくメタルギア'
'の装甲に弾かれた。'
ページ196:
'「くそっ！！」'
'歯噛みするスネークを、リキッドがコックピットの'
'中から嘲笑う。'
'「スネーク、この歴史的な兵器を拝みながら、死ん'
'でゆけ。兄弟へのせめてもの気遣いだ」'
'既に起動体勢にあったメタルギアが微動を始める。'
'ターボ音のような甲高い音が唸り始める。拡声機を'
'通したリキッドの声が格納庫に轟いた。'
'「今から、見せてやる。21世紀を導く悪魔の兵器を'
'な」'
ページ197:
'遂に始動したメタルギアがスネークに襲い掛かった。'
'メタルギアは最新式の複合装甲を採用しており、高'
'性能のHEATでも使わない限り、破壊は出来ない。'
'しかしレドームを破壊してセンサー類を無効化すれ'
'ば勝機が見えるかもしれないというエメリッヒ博士'
'の助言を受けて、スネークはメタルギアに立ち向か'
'おうとしていた。'
'幾度も攻撃を繰り返すスネークだったが、メタルギ'
'アの機動力と火力の前に苦戦を強いられる。'
'　'
ページ198:
'そしてメタルギアの巨大な足がスネークを踏み潰そ'
'うと繰り出され、そのコックピットからリキッドが'
'叫んだ。'
'「甘いぞっ！　スネーク！！　死ねっ！」'
'振り下ろされた足が床に激突する轟音が響く。'
'だがスネークは無事だった。何者かが踏み潰される'
'寸前、足の下からスネークを救い出したのだ。'
'「早く逃げろ！」'
'その声には聞き覚えがあった。'
'スネークがその名を叫ぶ。'
ページ199:
'「グレイ・フォックス！」'
'忍者、いやグレイ・フォックスがメタルギアに向か'
'って火線を放つ。その攻撃でレドームは完全に破壊'
'された。'
'メタルギアの動きが混乱した。その一瞬の隙を突い'
'て物陰に隠れる二人。'
'「フォックス、何故だっ！　何故、俺に拘るっ！」'
'「俺は死の囚人だ。お前だけが俺を解放してくれる'
'……」'
'　'
ページ200:
'そう答えるグレイ・フォックスの声には理性の響き'
'が戻っていた。スネークがフォックスに訴えるのが'
'聞こえる。'
'「フォックス、もうこんな事に関わるな……。ナオ'
'ミはどうする？　ナオミはお前の為に復讐を……」'
'「ナオミ……」'
'「ナオミを止められるのお前だけだ」'
'だがフォックスは力なく答えた。'
'「俺にはできない……」'
'「どうして？」'
ページ201:
'「ナオミの両親を殺したのは俺なんだ」'
'スネークは言葉を失った。'
'「まだ若かった俺は、あいつまでは殺せなかった…'
'…。あいつを拾ったのは、うしろめたさに耐え切れ'
'なかったから。あいつの世話をしたのは、やせこけ'
'た良心を満足させるため。……それでもナオミは俺'
'を兄と慕ってくれた」'
'「フォックス……」'
'「……はたから見れば俺達は仲のいい兄妹に見えた'
'かもしれん。'
ページ202:
'だがあいつに瞳を覗かれる度、俺はいつも怯えてい'
'た。……お前から伝えてくれ。本当の仇はこの俺だ'
'と」'
'少年兵の多くはその凄惨な戦場体験によって心にい'
'える事のない深い傷を負っているという。グレイ・'
'フォックスがナオミを育てたのも、いやその後ビッ'
'グボスと共に戦地に身を投じつづけたのも、少年の'
'時に負った心の傷に苦しみつづけたがゆえのことだ'
'ったのかもしれない。'
'遂に二人を見つけたリキッドが拡声機越しに叫ぶ。'
ページ203:
'「そこか？」'
'轟々たるバルカンの掃射。着弾の音がどんどん迫っ'
'てくる。'
'フォックスが叫んだ。'
'「そろそろ決着をつける時だな。俺が奴の動きを止'
'める！」'
'「フォックス！！」'
'スネークが止める間もなく、メタルギアに向かって'
'飛び出していくフォックス。'
'メタルギアのバルカン砲が火を噴くのが聞こえる。'
ページ204:
'フォックスは強化骨格の運動能力を駆使して、バル'
'カン砲の掃射をかわす。だがその次の瞬間、メタル'
'ギアの顎がフォックスの体を捉えていた。'
'「フォックス！」'
'スネークの叫びが空しく響く。'
'メタルギアの駆動音がより大きくなり、フォックス'
'の強化骨格が軋む音が聞こえる。'
'「強化骨格がどこまで持つかな？　スネーク！　こ'
'いつを見殺しにするつもりか？」'
'勝ち誇ったリキッドの叫び。'
ページ205:
'だがフォックスは死んではいなかった。'
'「追い込まれた狐はジャッカルより凶暴だ！」'
'右腕に仕込んだレーザービームの一閃。'
'そして爆発音。'
'メタルギアのレドームが火を噴いた。メタルギアの'
'コックピットは完全閉鎖式のため、外界からの情報'
'を遮断されれば周りが見えなくなる。'
'「さすが、FOXの称号を持つ男！　だが、それまで'
'だ！」'
'　'
ページ206:
'リキッドの肉声が響く。コックピットのハッチを解'
'放し、有視界で戦うつもりらしい。'
'激しい激突音が響いた。メタルギアの巨大な足がフ'
'ォックスを踏み敷いたのか。'
'強化骨格が軋む音と共に押しつぶしたようなフォッ'
'クスの呻き声が聞こえてくる。'
'「おまえの前で…これで本当に死ねる…ザンジバー'
'ランドの後、俺は戦いを取り上げられた…生きる実'
'感のない、ただ死んでいないだけの無意味な生。'
'…長かった。……それが今、ようやく終わる……」'
ページ207:
'フォックスの悲痛な呻きが響く。'
'「スネーク！　俺達は政府や誰かの道具じゃない！'
'戦うことでしか……自分を表現できなかったが……'
'いつも自分の意志で戦ってきた……スネーク、さら'
'ばだ」'
'強化骨格がひしゃげる音が響いた。'
'スネークの絶叫がこだまする。'
'「フォックス！！」'
'リキッドの嘲笑が響く。'
'　'
ページ208:
'「愚かな男だ。死を懇願した時、勝敗は決まる」'
'リキッドはメタルギアでフォックスの死体を駄目押'
'しに踏みにじり、叫ぶ。'
'「わかったろう！　貴様は誰も守れやしない！　自'
'分の身でさえなっ！死ねっ！」'
'メタルギアのバルカン砲がスネークに向かって火を'
'噴いた。'
'だがセンサーをすべて失ったその火線は正確さを欠'
'いている。'
'　'
ページ209:
'友を失った怒りに燃えたスネークは、剥き出しのコ'
'ックピットに座ったリキッドめがけてスティンガー'
'・ミサイルを構えた。'
'発射されたミサイルはあやまたずメタルギアのコッ'
'クピットを捉えた。複合装甲もその内部を直接攻撃'
'されては役に立たない。'
'操縦システムを破壊されたメタルギアが轟音と共に'
'崩れ落ちる。'
'そして耳をろうする大爆発。'
'　'
ページ210:
'だがスネークもその爆風に吹き飛ばされ、意識を失'
'ってしまった。'
'　'
'スネークは意識を失ってしまったようだが、その無'
'線機はまだ生きていた。'
'破壊されたメタルギアが時折起こす小爆発、そして'
'引火した燃料が燃える音だけが聞こえてくる。'
'しかしスネークが目を覚ます気配は一向になかった。'
'しばしの後、周囲の爆音に混じって、スネークに向'
'かって歩み寄る足音が聞こえてきた。'
ページ211:
'かすかに呟く声が聞こえる。'
'「スネーク……まだ決着はついていない……」'
'リキッドの声だった。'
'「スネーク！」'
'私はスネークに呼びかけたが、彼は答えない。'
'「何か、スネークを起こす方法はないの？」'
'私はリチャードに聞いたが、彼は首を横に振るだけ'
'だった。'
'スネークの傍らに歩み寄ったリキッドは、スネーク'
'の体を担ぎ上げたようだった。'
ページ212:
'そしてそのまま歩き出す。どうやら破壊されたメタ'
'ルギアの背中を目指しているようだ。'
'それを私はただ傍観することしか出来なかった。闘'
'うのは私ではないのだ。どうすることもできない。'
'メタルギアの背に登ったリキッドは、スネークの体'
'を無造作に横たえた。'
'そのままスネークの覚醒を待つつもりらしい。'
'　'
'「おい……」'
'不意にリキッドが口を開いた。'
ページ213:
'スネークはまだ目を覚ましてはいない。'
'「聞いているな……？　スネークに仕込んだ無線機'
'で……」'
'リキッドは私達に語り掛けているのだ。'
'「＃｛ＦＯＸＤＩＥ、フォックスダイ｝＃……。成功したつもりだろうが……俺は'
'そんなもので死にはしない……絶対に」'
'暗殺ウイルスに感染している事を知りながらなお、'
'闘う事をあきらめない。恐るべき執念だった。'
'「……だが俺は嬉しいぞ。貴様らが……復讐の対象'
'がまだ存在していたとはな……」'
ページ214:
'リキッドは、ぞっとするほどの憎悪が満ちた声で吐'
'き捨てた。'
'「『らりるれろ』め……」'
'その時、スネークが呻き声をあげた。どうやら意識'
'を取り戻したらしい。'
'「目が覚めたか……。いいか、奴との決着をつけた'
'ら次は貴様達を皆殺しにしてやる。死神も目をそむ'
'けるような殺し方でな……」'
'それを聞いたリチャードがぽつりと呟いた。'
'「待ってるよ」'
ページ215:
'スネークがもう一度うめいた。'
'完全に目覚めたようだ。'
'　'
'リキッドはスネークに話し掛けた。'
'「あいかわらず、目覚めは悪いようだな？」'
'「リキッド……生きていたか？」'
'「俺は死なん。貴様が生きている限りは……」'
'スネークが言う。'
'「残念だったな、蹶起とやらは失敗だ」'
'　'
ページ216:
'「メタルギアを失った程度で、俺は闘いを終わらせ'
'る気はない……」'
'リキッドは全く闘志を失ってはいなかった。'
'スネークが聞き返す。'
'「闘い？　貴様の本当の狙いはなんだ！？」'
'「俺達のような戦士が活かされる時を再び築き上げ'
'る事」'
'「それはビッグボスの妄想だ」'
'スネークの言葉にリキッドは激昂した。'
'　'
ページ217:
'「遺志だ！　親父の……冷戦の時、混沌の時……世'
'の中が俺達を欲した。俺達を評価した。俺達は必要'
'とされた」'
'リキッドは嘆くようにしばしの間をおいてから続け'
'た。'
'「だが今は違う。偽善と欺瞞が横行し、争いがこの'
'世から消えていく……。自分を生かす場が失われる'
'空しさ。時代から必要とされなくなる恐怖……。お'
'前にはよく分かるだろう？」'
'「……」'
ページ218:
'スネークは答えなかった。それは同じ思いを抱いて'
'いたからだろうか……。'
'リキッドが続ける。'
'「俺は新型核を利用して当面の運動資金を得る。そ'
'して世界的なテロを行い、このふやけた世の中を再'
'び混沌の世界へと誘う。紛争が紛争を呼び、新たな'
'憎しみを生む。そして俺達の生態圏は拡大していく」'
'スネークが異を唱える。'
'「人の支配が続く限り、世界中の何処かで紛争は起'
'こっている」'
ページ219:
'間髪入れず言い返すリキッド。'
'「バランスが問題なんだ。親父の目指したバランス'
'が……」'
'「それだけの理由で？」'
'「十分な理由だろう？　俺や貴様にとっては」'
'「俺はそんなものは望まない！」'
'否定しようとするスネークをリキッドが嘲笑う。'
'「ハッ。嘘をつけ。ではなぜ貴様はここにいる？　'
'仲間に裏切られながらも任務を投げ出さずに、なぜ'
'ここまで来た？」'
ページ220:
'スネークは答える事が出来なかった。'
'リキッドが続ける。'
'「俺が代わりに言ってやろう。殺戮を楽しんでいる'
'んだよ、貴様は」'
'「何を！」'
'必死に抗弁するスネークを遮るリキッド。'
'「違うとでもいうのか？　貴様は俺の仲間を大勢殺'
'したじゃないか？」'
'「それは……」'
'　'
ページ221:
'言いよどむスネークを嬲るようにリキッドは笑った。'
'「とどめを刺す時のお前の顔……実に生気に満ちて'
'いたぞ」'
'「違う！」'
'「自分の内の殺人衝動、それを否定する必要はない。'
'俺達はそのように創られたんだからな」'
'「つく、られた……だと？」'
'そしてリキッドは『恐るべき子供達』と呼ばれた計'
'画について語り始めた。'
'　'
ページ222:
'1970年代。ベトナム戦争の悪夢もまだ覚めやらぬ頃'
'政府の一部勢力の間で最強の兵士を人為的に生産し'
'ようという計画が持ち上がった。そしてその雛型と'
'して選ばれたのが、当時生きながら、伝説の傭兵と'
'して名を馳せていた男、ビッグボスだった。'
'しかしビッグボスは戦場で負傷し不能者となってい'
'た。そこで彼等はビッグボスの体細胞を使い当時の'
'アナログ・クローン技術の粋を集めて彼のクローン'
'を生み出そうと謀った。その技術の一つがスーパー'
'・ベイビー法と呼ばれるものだった。'
ページ223:
'スーパー・ベイビー法とは細胞核を使って創られた'
'受精卵を分割、８人のクローンベイビーを子宮に移'
'した後に、６つの胎児を意図的に間引き犠牲にする'
'ことで、残った固体の成長能力を増大させる手法だ'
'という。'
'リキッドが言う。'
'「……俺達はもともと８つ子だったんだよ」'
'「８つ子……」'
'スネークが呆然と呟いた。'
'　'
ページ224:
'「そう、俺達を創るために６人の兄弟が殺された。'
'俺達は生まれ落ちる前から人の死に関与していたん'
'だ」'
'リキッドはなおも続けた。'
'「そして、俺と貴様。同じDNAを持つ二つの受精卵'
'が生き残った。だが、それで終わりじゃない。俺は'
'生贄にされた。……優性遺伝子だけを発現させた表'
'現型……貴様を造るために。劣性遺伝子ばかりを発'
'現させられた……。貴様は、兄弟の命を奪って生ま'
'れたんだ！」'
ページ225:
'愕然とするスネーク。リキッドは愉悦に満ちた笑み'
'を浮かべた。'
'「だが、残った兄弟は俺と貴様だけではないぞ」'
'「何？」'
'「ゲノム兵達だよ。彼等も親父の遺伝子を受け継い'
'でいる。俺達と違って、デジタルな方法で」'
'続いてリキッドが語ったのは驚くべきことだった。'
'前世紀に完了していたヒトゲノム計画、そして『恐'
'るべき子供達』計画とビッグボスの細胞標本の研究'
'を通じて、ソルジャー遺伝子と呼ばれる戦闘に適し'
ページ226:
'た遺伝子の存在が解明されていた。判明したソル'
'ジャー遺伝子はその都度、遺伝子治療を経て次世'
'代特殊部隊隊員に組み込まれていったのだという。'
'リキッドは言った。'
'「そうとも、お前がこの基地で殺してきたゲノム兵'
'は俺達と同じＤＮＡをもつ兄弟なんだよ」'
'「ゲノム兵が……」'
'「ああ。親父の遺伝配列から作為的に造り出された'
'いびつな生き物……。彼等は同胞だ。多くの犠牲の'
'末に生まれたという意味でも」'
ページ227:
'「犠牲？」'
'「人体実験だ」'
'リキッドは怒りを込めて語った。'
'91年の湾岸戦争で、軍は兵士に対して極秘裏にソル'
'ジャー遺伝子の注入実験を行っており、帰還兵の間'
'で問題になっている『湾岸戦争症候群』もその副作'
'用だというのだ。'
'スネークが呆然と呟いた。'
'「それでは、帰還兵の家族で起こっている『ガルフ'
'・ウオー・ベイビー』も……」'
ページ228:
'「そう。彼らこそ俺達の最初の兄弟だ」'
'「……それで完成したのが次世代特殊部隊……？」'
'愕然とするスネークにリキッドは嘲笑を浴びせる。'
'「完成？　馬鹿を言うな。出来損ないだ。……俺達'
'は滅びかけているからな」'
'「何？」'
'「左右非対称の理論という言葉を聞いたことがある'
'か？　自然界では左右非対称が標準だ。逆に絶滅種'
'には左右対称の兆候が見られる。ゲノム兵にも現わ'
'れているんだよ……その左右対称の兆しが。'
ページ229:
'それは俺にも……そして貴様にもあるはずだ」'
'驚くスネーク。'
'「そうだ、俺達は皆、遺伝子レベルで死にかけてい'
'る。いつ発病するかわからん。それを調べる為にも'
'オヤジのゲノム情報が必要なのだ」'
'スネークが言う。'
'「ビッグボスの遺体を要求したのは、同族を救うた'
'めだとでもいうのか？」'
'「兄弟同士は子を為さない。それにも関わらず助け'
'合うのは、なぜだか知っているか？」'
ページ230:
'わからない様子のスネークに、リキッドが続ける。'
'「同種の遺伝子を後世に伝えられる確率が高くなる'
'からだ。自然選択の末、血縁は互いに利他行動をと'
'るようになった。遺伝子には血縁を助けるよう記さ'
'れている」'
'「ゲノム兵を助けるのは、遺伝子の命令だと？」'
'スネークの問いかけに対し、リキッドは厳かに宣言'
'した。'
'「誰も遺伝子に逆らう事はできない」'
'　'
ページ231:
'「それは運命だ。まして俺達は親父の遺伝子を再現'
'するためだけに生み出された存在だ……。だから俺'
'は自分の遺伝子に従う。そしてそれを乗り越える。'
'呪われた運命を打ち破るために……そのためにまず'
'貴様を殺す……」'
'その声は静かだが、そこには圧倒的な殺気がみなぎ'
'っていた。'
'リキッドが不意に叫んだ。'
'「後ろを見てみろ！」'
'　'
ページ232:
'「メリル！？」'
'スネークが思わず声を上げる。どうやらメリルが横'
'たえられているらしい。スネークを担ぎ上げる前に'
'リキッドが連れてきていたのか。'
'「生きているのか？」'
'「どうかな？　数時間前までは息をしていた。何度'
'も、貴様の名前を呼んでいた……」'
'「メリル……」'
'「馬鹿な女だ。名前もない男に惚れるとはな」'
'　'
ページ233:
'「俺にも名前はある」'
'「ない！　俺達には過去も未来もない！」'
'リキッドが叫んだ。'
'「あると、すれば……親父から受け継いだ遺伝子に'
'刻まれている運命が全てだ」'
'「メリルを放せ！」'
'「お前との決着をつけたらな。俺達にはもう時間が'
'ない」'
'「……＃｛ＦＯＸＤＩＥ、フォックスダイ｝＃のことか？」'
'　'
ページ234:
'「いや、メタルギアの破壊を知った国防総省はある'
'決定を下したそうだ。もはやボンダー・レポート'
'（目標破壊評価）の必要もない。詳しくは聞き耳を立'
'てているご立派なキャンベルにきいてみるがいい」'
'　'
'スネークはキャンベルを無線で呼び出した。'
'「聞こえるか？　大佐！」'
'「ああ……聞いている」'
'「ペンタゴンは何をしようとしているんだ。大佐、'
'答えろっ！」'
ページ235:
'「……国防長官自らが作戦の指揮に乗り出した。'
'AWACSでそっちへ向かっている」'
'「何のために？」'
'キャンベルは苦しげに答えた。'
'「……空爆だ」'
'「なんだって？」'
'「それだけじゃない。先程爆撃機がカレーナ基地を'
'離陸した。地表貫通式戦術核爆弾B61-13を搭載し'
'てな」'
'　'
ページ236:
'スネークが声を上げる。'
'「まさか。メタルギアは破壊した。ちゃんと国防長'
'官に伝えろ」'
'「長官はナオミの裏切りを知って、＃｛ＦＯＸＤＩＥ、フォックスダイ｝＃の効果に'
'疑問を持った。スネークのメタルギア破壊で核攻撃'
'を受ける恐れもなくなった今、彼はもっとも直接的'
'な方法で事実の隠蔽を図るつもりなんだ」'
'「……全ての証拠とそれを知る者をこの基地ごと核'
'で吹き飛ばすつもりか」'
'怒りをかみ殺すスネーク。'
ページ237:
'だが次にキャンベルの口から出たのは意外な言葉だ'
'った。'
'「スネーク、だが心配するな。核攻撃は私が中止さ'
'せる」'
'「何？」'
'「例え形式だけであっても、本作戦の指揮権は私に'
'もある。私が爆撃中止命令を出せば命令系統が混乱'
'し、少なくとも時間は稼げるはずだ。その間に脱出'
'してくれ」'
'　'
ページ238:
'リチャードが部下を呼び、指示を出した。何の指示'
'かは考えるまでもない。キャンベルを拘束しようと'
'いうのだろう。'
'全てを聞かれている事を知らず、スネークとキャン'
'ベルの会話は続いていた。'
'「大佐、そんなことをすれば……」'
'「いいんだ、スネーク。実は極秘裏に＃｛ＦＯＸＨＯＵＮＤ、フォックスハウンド｝＃'
'の内偵捜査は行われていたんだ。そしてメリルは蜂'
'起当日にこの作戦に編入された。私を脅迫する材料'
'として……」'
ページ239:
'スネークは吐き捨てた。'
'「……くだらん」'
'「……済まなかった。メリルの命と引き替えに協力'
'を強いられていたのだ」'
'「さぁ、早く逃げろ、スネーク」'
'「いいのか？　……全てを失うぞ」'
'「構わんさ。本当に失ってはいけないものを、守る'
'ことができる」'
'「大佐……」'
'　'
ページ240:
'「さあ、爆撃中止命令を出そう。これで後戻りは出'
'来んな……うっ何をする！」'
'キャンベルの呻き声が聞こえた。リチャードの部下'
'がキャンベルを制止しようとしているのだろう。'
'無線機の向うから、銃声と物音だけが聞こえてく'
'る。私はまたしても、ただそれを聞いているしかな'
'かった。'
'無線機を奪ったのか、メイ・リンの声がした。'
'「スネーク！！」'
'「メイ・リン、大佐はどうなった！」'
ページ241:
'「……信じられない」'
'「どうしたっ！」'
'「スネーク、大佐が！！」'
'だがメイ・リンの叫びもノイズにかき消された。'
'かわりに聞こえてきたのは、聞き覚えのない男の声'
'だった。'
'「ロイ・キャンベルはたった今、解任した。私は国'
'防長官、ジム・ハウスマンだ」'
'「大佐をだせ！」'
'　'
ページ242:
'「機密漏洩と国家に対する反逆罪で逮捕監禁した」'
'「馬鹿な……」'
'「そう、馬鹿な男だ。指揮権を与えられたと本気で'
'信じていたとはな」'
'「貴様……！」'
'怒りの声を上げるスネークにハウスマンは傲然と言'
'い放った。'
'「全てを海に沈める。大統領もそれを望んでおられ'
'るだろう」'
'「大統領命令か？」'
ページ243:
'「大統領は忙しい。私が全責任を負っている」'
'「アメリカ国内を核攻撃してマスコミにどう説明す'
'る？」'
'スネークの反撃にも、ハウスマンは平然と答える。'
'「心配するな、隠蔽用のカバーストーリーは用意し'
'てある。テロリストが核を暴発させたということに'
'する」'
'「ここの研究員もゲノム兵の連中も皆死ぬぞ！」'
'「ドナルド、DARPA局長は死んでしまった……」'
'　'
ページ244:
'ハウスマンは急に悲しげに呟いた。それを聞いたス'
'ネークが問う。'
'「やはり、局長は殺すつもりはなかったんだな？」'
'「奴は親友だった」'
'「他の連中はどうでもいいっていうのか？」'
'「そうだな、光ディスクの内容を転送すれば考えて'
'やってもいい」'
'「なんの事だ？」'
'とぼけてみせるスネークをハウスマンは追求する。'
'　'
ページ245:
'「今回の演習データだ。ドナルドが持ち帰るはずだ'
'った」'
'「持っていない……」'
'「そうか、まあいい……貴様ら二人は、70年代の恥'
'部だ。誰もが蒸し返したくない暗部だ。このまま生'
'かしておく訳にはいかない。爆撃までの時間、せい'
'ぜい仲良くな。旧態政府の亡霊達……」'
'通信は打ち切られた。'
'　'
'「お互い脱出路は断たれたようだな」'
ページ246:
'リキッドが笑いながらスネークに近づいてくるのが'
'聞こえる。'
'「空爆の前に決着をつけよう」'
'スネークもゆっくりと立ち上がった。'
'「貴様は俺から何もかも奪った。貴様を、貴様の遺'
'伝子をここで否定することで、俺はその全てを取り'
'返してみせる……」'
'　'
'お互いに歩み寄る二人。'
'そして最後の闘いが始まった。'
ページ247:
'スネークとリキッドが素手の死闘を繰り広げてい'
'る。それを後目にリチャードは部下に命じていずこ'
'かを無線で呼び出した。'
'「なんだ？」'
'私は驚いた。それは国防長官ジム・ハウスマンの声'
'だった。リチャードは残念そうに言った。'
'「空爆とは早まりましたね。核爆弾を搭載したステ'
'ルス機まで出動したとあっては、事態を隠蔽する事'
'は完全に不可能になる。『あの方達』は御立腹です'
'よ」'
ページ248:
'「証拠を隠滅するには、あれしか方法はない。結果'
'が私の正しさを証明してくれるだろう」'
'「結果が生まれる事はありません。既に空爆の撤回'
'命令は出されました」'
'「馬鹿な、貴様ごときに……」'
'ハウスマンは口篭もった。リチャードの後ろにいる'
'『何者か』に思い至ったのだろう。'
'彼は怒りを含んだ口調で問い返した。'
'「では、どうするつもりだというのだ？」'
'「事態を収拾するにはもう一つ方法があります」'
ページ249:
'「……全てを私に押し着せるつもりか？　そうはさ'
'せんぞ！」'
'激昂するハウスマン。リチャードは大仰に嘆息して'
'みせた。'
'「そうはさせない？　『指揮権を与えられたと本気'
'で信じていた』のはキャンベル大佐だけではないと'
'いうことですね」'
'「何！」'
'無線機の向うで争う音がする。'
'　'
ページ250:
'「ぐっ、何をする、放せ！」'
'ハウスマンは近くの者達に取り押さえられたようだ。'
'まるでキャンベルに対してそうしたように。'
'リチャードが哀れむように言う。'
'「あなたには今後、幾つかの道が残されています。'
'どれを選択するかはあなた次第です。出来れば穏便'
'に引退して頂きたいと思っているのですが……」'
'もみあいながらもハウスマンは毒づいた。'
'「貴様、覚えていろ。必ず……」'
'　'
ページ251:
'「私としても乱暴な手段は取りたくはない。どうぞ、'
'よいご決断を……」'
'リチャードは通信を打ち切った。'
'　'
'シャドー・モセス島からの無線はまだ生きている。'
'無線のノイズの向うから、リキッドの断末魔の絶叫'
'が聞こえた。リチャードが呟く。'
'「どうやら、向うもカタがついたようだ」'
'リチャードは部下を全員、私達のいる書斎から立ち'
'退かせた。'
ページ252:
'無線からは再会を喜ぶスネークとメリルの声が聞こ'
'えてくる。どうやらスネークはメリルの救出にも成'
'功したようだ。'
'「さて、あとは君をどうするかだが……」'
'リチャードが無線機から私の方に向き直った。'
'いよいよこの時が来た。'
'私にも切り札がある。そろそろ、それを明かす時だ。'
'私はパソコンの傍らに立って言った。'
'「今までこの書斎で交わされた会話、全部このパソ'
'コンからある場所に電送されているの」'
ページ253:
'「向うのサーバでは送られてきた画像と音声を順次'
'光ディスクに圧縮して保存してるわ」'
'ハッタリではない。'
'リアルタイムTV会議システムの応用だった。私は軍'
'事アナリストという仕事柄、武器の密輸やプルトニ'
'ウムの闇取引を行うマフィアへのインタヴューを行'
'う事もある。そういう危険な人間を相手にする時に'
'は、必ずこの保険をかけることにしていた。私は続'
'けた。'
'　'
ページ254:
'「サーバの管理者には、私から連絡が途絶えたら、'
'その光ディスクを私の信用するマスコミ関係者に郵'
'送してくれるように電子メールも打ってある」'
'先程トイレに行った時にPDAから送信した電子メー'
'ルがそれだった。'
'「私をどうにかすれば、全てが報道されることにな'
'るわ」'
'だがその脅しにも、リチャードは顔色一つ変えない。'
'嫌な予感がした。彼は悠然と煙草に火をつけて言っ'
'た。'
ページ255:
'「その『全て』ってのは、これのことかい」'
'彼はスーツの内ポケットから一枚のディスクを取り'
'出し、パソコンに入れた。'
'マウスを二〜三回動かすと、小さなウインドウが現'
'われ、荒れた動画と音声が流れ始める。'
'「スネークはシャドー・モセス島への潜入に成功し'
'たそうだ。すぐに向うから連絡が入るはずだ。無線'
'機の使い方はもう分かってるな……」'
'リチャードの声だ。'
'　'
ページ256:
'それは間違いなく、私が送信したはずのデータだっ'
'た。'
'「どうして……？」'
'リチャードはディスクを取り出した。'
'「甘く見てもらっては困るね。この家のあらゆるも'
'のは全て監視している。人の出入りから無線電波ま'
'で。当然、君のパソコンからのデータもね。勿論、'
'君がトイレから出した例の電子メールも先方には届'
'いていない」'
'　'
ページ257:
'見透かされていた。'
'全身の力が抜けていくのがわかる。'
'「だが、もしもこのデータが正しく送られていたと'
'しても、それだけじゃ君の身の保証にならないよ。'
'そんな与太話、誰も信用しないはずだ。まして報道'
'などされはしない」'
'「あなた達が圧力をかけるから……？」'
'リチャードは答える代わりに、煙草を揉み消し、上'
'着の左内側に手を入れた。'
'　'
ページ258:
'仕立ての良いスーツの形がそこだけ崩れている。'
'ホルスターで拳銃が吊ってあるのだ。'
'冷たい汗が背中を伝う。'
'私は知らずあとずさっていた。背中が壁に当たる。'
'逃げ場はなかった。'
'「あなたに私を殺せるの？」'
'声が震える。'
'リチャードは静かに私の目を見て言った。'
'「それは君の方がよく知ってるはずだ」'
'リチャードは上着から手を引きぬいた。'
ページ259:
'私は思わず目を閉じた。'
'だが、しばらく待っても、何の痛みも襲っては来な'
'かった。'
'恐る恐る目を開ける。'
'彼の手に握られていたのは、拳銃ではなかった。'
'代わりにその手の中にあったのは一枚の光ディスク。'
'「＃｛ＦＯＸＤＩＥ、フォックスダイ｝＃の資料だ」'
'リチャードは私に歩み寄り、そのディスクを手渡し'
'た。'
'　'
ページ260:
'「さっきも言った通り、ここの会話を録音したとし'
'ても、それだけじゃ君の安全を保障する事はできな'
'い。具体性のない会話ばかりだ。そんなものはでっ'
'ちあげとして簡単にもみ消せるからね」'
'リチャードは続ける。'
'「だがこの＃｛ＦＯＸＤＩＥ、フォックスダイ｝＃の資料なら話は別だ。ここには'
'＃｛ＦＯＸＤＩＥ、フォックスダイ｝＃に関係する全てが収められている。プロジェ'
'クトの発端から……個人名まで含めてね。これを盾'
'にとれば、『彼等』も君に手を出す事はできないだ'
'ろう」'
ページ261:
'「どうして？」'
'リチャードは私の問いには答えない。'
'「早く逃げる事だ。裏口に君の車がおいてある」'
'「あなたは？」'
'「君が気にする事じゃない」'
'「でも……」'
'「君に俺は必要ないだろう？　それに俺にはやらな'
'ければいけないこともあるからね」'
'私はもう一度聞いた。'
'「どうして……？」'
ページ262:
'「いずれわかるよ。君は君の思う通りにすればいい」'
'リチャードはそう言って突然私を抱き寄せ、唇をふ'
'さいだ。'
'長いキスの後、彼は耳元でささやいた。'
'「もう一度、こうしたかった……」'
'そしてリチャードは優しく体を離した。'
'「さぁ、早く行け」'
'その言葉には有無を言わせぬ強さがあった。私は頷'
'いて書斎から駆け出した。'
'そして、それがリチャードを見た最後になった。'
ページ263:
'カリフォルニアから逃げ出した私は某所に身を隠し'
'た。今のところ追手はかかっていないようだ。'
'メタルギアの破壊とリキッドの死と共にシャドー・'
'モセス島のテロ事件は終結した。しかし合衆国政府'
'はその事件の存在を公式には一切認めていない。リ'
'キッド・スネーク、サイコ・マンティス、スナイパ'
'ー・ウルフ、デコイ・オクトパス、バルカン・レイ'
'ブンは死亡。リボルバー・オセロットは死体こそ発'
'見されなかったものの行方不明として処理されて、'
'＃｛ＦＯＸＨＯＵＮＤ、フォックスハウンド｝＃は壊滅した。'
ページ264:
'生き残った次世代特殊部隊の隊員達は、訓練という'
'名目でニューハンプシャー州ピーズ空軍基地に拘禁'
'された。政府は改めて遺伝子操作による兵士強化を'
'否定したが、まだ研究が続けられているという噂が'
'ある。'
'DARPA局長ドナルド・アンダーソンとアームズ・テ'
'ック社長ケネス・ベイカー両名の死によって、新型'
'メタルギアの開発計画は完全に中止された。エメリ'
'ッヒ博士の開発したメタルギア＃｛ＲＥＸ、レックス｝＃本体はほぼ完成'
'していたようだが、ローレンス・リバモア研究所の'
ページ265:
'関係者へ極秘にインタヴューを行ったところ、核弾'
'頭発射レールガンのシステムは未完成だったようだ。'
'実際には命中精度にかなりの問題があったらしい。'
'だからこそベイカーは演習データの入った光ディス'
'クをスネークに託そうとし、国防長官ジム・ハウス'
'マンはそれを執拗に欲しがったのだろう。いずれに'
'せよデータは失われ、研究も中止された。新型核兵'
'器システムが日の目を見る事はもうないだろう。'
'そして事件の数日後、国防長官ジム・ハウスマンが'
'拳銃自殺した、というニュースがマスコミに流れた。'
ページ266:
'過労による心身の喪失というのが一貫した報道で、'
'それを傍証する家族や部下のコメントも流されてい'
'た。シャドー・モセス島への空爆命令もその影響と'
'して処理されている。だが私は知っている。おそら'
'く、ハウスマンは自分独りで全ての責を負う事を拒'
'んだのだろう。そして、消された。'
'この事件の記録とリチャードから託された＃｛ＦＯＸＤＩＥ、フォックスダイ｝＃の'
'資料の入った光ディスクは今も私の手元で厳重に保'
'管してある。その資料にはナオミが独自に＃｛ＦＯＸＤＩＥ、フォックスダイ｝＃'
'へ加えた改変の解析結果まで収められていた。'
ページ267:
'それによると＃｛ＦＯＸＤＩＥ、フォックスダイ｝＃のターゲットにスネークは確か'
'に入っている。だがいつ発症するかはウィルスをデ'
'ザインしたナオミ自身にも分からない、というもの'
'だった。いつ死ぬか分からない恐怖に怯えながら生'
'きていけ、というのがナオミの復讐だったのだろう'
'か。'
'キャンベルはディスカバリーで捕らえられたが国防'
'長官の逮捕後、無事釈放。自宅に戻り軍務とは無縁'
'の隠居生活を送っている。'
'　'
ページ268:
'メイ・リンもキャンベル同様、無事に帰国し、大学'
'に戻ったらしい。'
'エメリッヒ博士はシャドー・モセス島から救出され'
'たあと、アームズ・テック社へは戻らずに姿を消し'
'た。家族を尋ねてイギリスへ向かったという情報も'
'ある。'
'スネーク、メリルは無事シャドー・モセス島を脱出'
'したらしい。しかしその後の足取りは完全に途絶え'
'ている。うまく身を隠している事を祈るばかりだ。'
'ナオミ・ハンターは事件後、逮捕された。'
ページ269:
'某基地で取り調べを受けていたが、三週間後に脱走。'
'その後消息不明だ。某基地の関係者は固く口を閉ざ'
'しているが、どうやら何者かが基地に侵入し、ナオ'
'ミを連れ出したというのが真相のようだ。警戒厳重'
'な軍の施設に侵入し、人を一人連れ出して無事逃げ'
'おおせることができるような人物を私は一人しか知'
'らない。'
'　'
'そしてリチャード。'
'私は人を使い、DIAに対してリチャード・エイムズ'
ページ270:
'少佐についての問い合わせをかけてみた。'
'答えは「該当する職員は存在しない」というもの'
'だった。'
'それを知った私は決意した。'
'私の知る全てを公にしよう、と。'
'この事実を明るみに出すことで私の身に危険が及ぶ'
'事があるかもしれない。しかし私はもう傍観者であ'
'ることはやめた。シャドー・モセス島でスネークが'
'闘っている間、私は無力な存在だった。何をするこ'
'とも出来なかった。だが今度は違う。'
ページ271:
'今度は私自身が闘う番だ。'
'　'
}