/*
	tales_c_exchange_j.h
	    スネークテイルズ紙芝居用リソース返しまくりへっだ
		にほん
	2002/06/04 S.Mukaide
	$Id: tales_c_exchange_j.h,v 1.1 2002/07/13 07:13:24 usr03005 Exp $


*/

//---------------------------------
//テイルズＣ
//----------------------------------
proc テイルズ入れ替え＿C1_スタート:07 $:no $:res_num {
	return [テイルズ＿Ｃ__j:C1_スタート]
}

proc テイルズ入れ替え＿C2_船橋到着:07 $:no $:res_num {
	return [テイルズ＿Ｃ__j:C2_船橋到着]
}

proc テイルズ入れ替え＿C3_長廊下戦前:07 $:no $:res_num {
	return [テイルズ＿Ｃ__j:C3_長廊下戦前]
}

proc テイルズ入れ替え＿C4_長廊下戦後:07 $:no $:res_num {
	return [テイルズ＿Ｃ__j:C4_長廊下戦後]
} 

proc テイルズ入れ替え＿C5_機関室脱出:07 $:no $:res_num {
	return [テイルズ＿Ｃ__j:C5_機関室脱出]
}  

proc テイルズ入れ替え＿C6_メリル再会:07 $:no $:res_num {
	return [テイルズ＿Ｃ__j:C6_メリル再会]
}   


//分岐：
//メリル殺した場合：C7_1A→C7_2→C7_3A
//メリル気絶させた場合：C7_1B→C7_2→C7_3B
proc テイルズ入れ替え＿C7_メリル戦後Ａ＿殺した:07 $:no $:res_num {
	if( $:no == 1 ){//本文の #C1 と書かれているところに書き込まれる
		return [テイルズ＿Ｃ__j:C7_1A]

	}else if( $:no == 2 ){
			return [テイルズ＿Ｃ__j:C7_2]

	}else {
		return [テイルズ＿Ｃ__j:C7_3A]
	}
}

proc テイルズ入れ替え＿C7_メリル戦後Ｂ＿気絶させた:07 $:no $:res_num {
	if( $:no == 1 ){//本文の #C1 と書かれているところに書き込まれる
		return [テイルズ＿Ｃ__j:C7_1B]

	}else if( $:no == 2 ){
			return [テイルズ＿Ｃ__j:C7_2]

	}else {
			return [テイルズ＿Ｃ__j:C7_3B]
	}
}




