\/*
\	w04a_seals_param.h
\	    第１船倉兵パラメータ用ヘッダファイル
\	2001/08/07 S.Nojiri
\	$Id: w04a_seals_param.h,v 1.4 2001/09/26 08:10:23 usr01717 Exp $
\
\
\*/
\//###################################################################################
\//								船倉兵のパラメータ（共通）
\//###################################################################################
			-t 2500,7000 \
			//-t 4000,4001 \
			-s 4000,-10000,-22000 \
			-p 140,-15600,-1300 -104,1894,0 256 \
			-e 敵兵発見 プロジェクタ１ プロジェクタ２ 船倉兵物音反応 最初の一人発見 げろっぱ げろっぱ げろっぱ げろっぱ 船倉兵死亡時プロック \
			-b 船倉パンツ兵写真判定 \
			-m 2 \	//実験用全員同じ方向に顔を向ける
