/**************************************************
		ÌµÀþ¤Ç¤Ý¤¤¤¤¤ó
**************************************************/

#include "cdc_common_p.h"


@rp_Âçº´¥Ç¥Õ¥©¥ë¥ÈÌµÀþ¥»¥Ã¥È
@rp_¥×¥ê¥¹¥­¥ó¡²¥Ç¥Õ¥©¥ë¥ÈÌµÀþ¥»¥Ã¥È
@rp_¥í¡¼¥º¥Ç¥Õ¥©¥ë¥ÈÌµÀþ¥»¥Ã¥È


//¤í¤Ã¤«¤ê¤¢¤ó
	//¤¤¤Ã¤Á¤ã¤óº¸¤¢¤ó
	trap lk001 d:PLAYER \
	-mask * \
	-exec {
		@rp_¥í¥Ã¥«¡¼ÌµÀþ¥»¥Ã¥È $3 ¥í¥Ã¥«¡¼:01 t:RPC_¥í¥Ã¥«¡¼¶¦ÄÌ£±
	}

	//º¸¤«¤é£²ÈÖÌÜ¤â¤ó
	trap lk002 d:PLAYER \
	-mask * \
	-exec {
		@rp_¥í¥Ã¥«¡¼ÌµÀþ¥»¥Ã¥È $3 ¥í¥Ã¥«¡¼:02 t:RPC_¥í¥Ã¥«¡¼¶¦ÄÌ£²
	}

	//±¦¤«¤é£²ÈÖ¤ß¤ã¤à
	trap lk003 d:PLAYER \
	-mask * \
	-exec {
		@rp_¥í¥Ã¥«¡¼ÌµÀþ¥»¥Ã¥È $3 ¥í¥Ã¥«¡¼:03 t:RPC_¥í¥Ã¥«¡¼¶¦ÄÌ£±
	}

	//¤¤¤Ã¤Á¤ã¤ó±¦¤©¡¼¤à
/*
	trap lk004 d:PLAYER \
	-mask * \
	-exec {
		@rp_¥í¥Ã¥«¡¼ÌµÀþ¥»¥Ã¥È $3 ¥í¥Ã¥«¡¼:04 t:RPC_¥í¥Ã¥«¡¼¶¦ÄÌ£²
	}
*/
	trap lk004 d:PLAYER \
		-mask * \
		-exec {
			@rp_¥í¥Ã¥«¡¼ÌµÀþ¥»¥Ã¥È $3 ¥í¥Ã¥«¡¼:04 t:RPC_³«¤«¤Ê¤¤¥í¥Ã¥«¡¼¶¦ÄÌ£±
			@rp_³«¤«¤Ê¤¤¥í¥Ã¥«¡¼¥Õ¥é¥°¥»¥Ã¥È $3 $f:rfp_w24b_lk004_³«¤«¤Ê¤¤¥í¥Ã¥«¡¼³«¤±¤¿
		}
	trap lk004 d:PLAYER \
		-and \
		-mask ¤¤¤ë \
		-state d:TRP_STATE_STAND,d:TRP_STATE_CAUTION \
		-dir 2048,512 0,512 \
		-button d:ACTION_BUTTON,-1 \
		-exec {
			eval($f:rfp_w24b_lk004_³«¤«¤Ê¤¤¥í¥Ã¥«¡¼³«¤±¤¿ =  1)
		}


	//Åì¾®Éô²°
	//­è
	trap lk005 d:PLAYER \
	-mask * \
	-exec {
		@rp_¥í¥Ã¥«¡¼ÌµÀþ¥»¥Ã¥È $3 ¥í¥Ã¥«¡¼:05 t:RPC_¥í¥Ã¥«¡¼¶¦ÄÌ£±
	}

	//­é
	trap lk006 d:PLAYER \
	-mask * \
	-exec {
		@rp_¥í¥Ã¥«¡¼ÌµÀþ¥»¥Ã¥È $3 ¥í¥Ã¥«¡¼:06 t:RPC_¥í¥Ã¥«¡¼¶¦ÄÌ£²
	}


proc rp_w24b_ÌÖËì¥»¥ó¥µ¡¼¡²»à¤ó¤Ç¤ëÅ¨Ê¼¥À¥á£Ã£Á£Ì£Ì½ªÎ» {
	eval($f:rfp_w24b_ÌÖËì¥»¥ó¥µ¡¼¡²»à¤ó¤Ç¤ëÅ¨Ê¼¥À¥á£Ã£Á£Ì£ÌÊ¹¤¤¤¿ = 1)
	command varsave $f:rfp_w24b_ÌÖËì¥»¥ó¥µ¡¼¡²»à¤ó¤Ç¤ëÅ¨Ê¼¥À¥á£Ã£Á£Ì£ÌÊ¹¤¤¤¿
}


proc rp_w24b_ÌÖËì¥»¥ó¥µ¡¼¥Ò¥ó¥È£Ã£Á£Ì£Ì½ªÎ» {
	eval($f:rfp_w24b_ÌÖËì¥»¥ó¥µ¡¼¥Ò¥ó¥È£Ã£Á£Ì£ÌÊ¹¤¤¤¿ = 1)
	command varsave $f:rfp_w24b_ÌÖËì¥»¥ó¥µ¡¼¥Ò¥ó¥È£Ã£Á£Ì£ÌÊ¹¤¤¤¿
}

trap r_sensor d:PLAYER \
	-mask * \
	-exec {
		if( ($3 == Æþ¤ë) || ($3 == ½Ð¤ë) ){
			print 'r_sensor'
			command ÌµÀþÀßÄê -over $3 14085 t:RPC_w24b_ÌÖËì¥»¥ó¥µ¡¼Á°
		}
		if( ($3 == ¤¤¤ë) || ($3 == Æþ¤ë) ){
			command ¥²¥Ã¥ÈÊá¤Þ¤¨¤é¤ìÊ¼¤ÎËÜÅö¤ÎÌ¾Á° $s:rfp_w24b_Êá¤Þ¤¨¤é¤ì¤¿Å¨Ê¼¤ÎÌ¾Á°
			if($s:rfp_w24b_Êá¤Þ¤¨¤é¤ì¤¿Å¨Ê¼¤ÎÌ¾Á° != 0){
				command ¥²¥Ã¥ÈÅ¨Ê¼¾õÂÖ³ÈÄ¥ÈÇ $s:rfp_w24b_Êá¤Þ¤¨¤é¤ì¤¿Å¨Ê¼¤ÎÌ¾Á° $i:rfp_w24b_Êá¤Þ¤¨¤é¤ì¤¿Å¨Ê¼¤Î¾õÂÖ³ÈÄ¥ÈÇ
				if(! ($i:rfp_w24b_Êá¤Þ¤¨¤é¤ì¤¿Å¨Ê¼¤Î¾õÂÖ³ÈÄ¥ÈÇ & 0x00000004) ){
					if( (!$f:rfp_w24b_ÌÖËì¥»¥ó¥µ¡¼¡²»à¤ó¤Ç¤ëÅ¨Ê¼¥À¥á£Ã£Á£Ì£ÌÊ¹¤¤¤¿) && \
							(!$f:rfp_w24b_ÌÖËì¥»¥ó¥µ¡¼¡²»à¤ó¤Ç¤ëÅ¨Ê¼¥À¥á£Ã£Á£Ì£Ì¤·¤¿) && \
							(`@rp_ÄÌ¾ï£Ã£Á£Ì£Ì¤·¤Æ¤â¤¤¤¤¤è`) && \
							( ( ( $i:¥¹¥Æ¡¼¥¸¥×¥ì¥¤»þ´Ö / d:FRAME_RATE) ) >= 120) && \
							($w:p_story < d:ST:P039_01_P01¿Í¼ÁÉô²°ÀøÆþ£±¥Ý¥ê¥´¥ó¥Ç¥â£±³«»Ï) ){
						eval($f:rfp_w24b_ÌÖËì¥»¥ó¥µ¡¼¡²»à¤ó¤Ç¤ëÅ¨Ê¼¥À¥á£Ã£Á£Ì£Ì¤·¤¿ = 1)
						command ÌµÀþÀßÄê -call 14085 t:RPC_w24b_ÌÖËì¥»¥ó¥µ¡¼¡²»à¤ó¤Ç¤ëÅ¨Ê¼¥À¥á£Ã£Á£Ì£Ì \
							d:CODEC_CALL rp_w24b_ÌÖËì¥»¥ó¥µ¡¼¡²»à¤ó¤Ç¤ëÅ¨Ê¼¥À¥á£Ã£Á£Ì£Ì½ªÎ» 
					}
				}
			}
		}
		if( ($3 == ½Ð¤ë) && ($f:rfp_w24b_ÌÖËì¥»¥ó¥µ¡¼¡²»à¤ó¤Ç¤ëÅ¨Ê¼¥À¥á£Ã£Á£Ì£Ì¤·¤¿) && \
				(!$f:rfp_w24b_ÌÖËì¥»¥ó¥µ¡¼¥Ò¥ó¥È£Ã£Á£Ì£Ì¤·¤¿) ){
			eval($f:rfp_w24b_ÌÖËì¥»¥ó¥µ¡¼¡²»à¤ó¤Ç¤ëÅ¨Ê¼¥À¥á£Ã£Á£Ì£Ì¤·¤¿ = 0)
			if(`%ÌµÀþ¾õÂÖ` == 2){
				command ÌµÀþÀßÄê -reset
			}
		}

		if($3 == Æþ¤ë){
			if( ( ($i:¥¹¥Æ¡¼¥¸¥×¥ì¥¤»þ´Ö / d:FRAME_RATE)  >= 600) && \
					(!$f:rfp_w24b_ÌÖËì¥»¥ó¥µ¡¼¥Ò¥ó¥È£Ã£Á£Ì£ÌÊ¹¤¤¤¿) && \
					(!$f:rfp_w24b_ÌÖËì¥»¥ó¥µ¡¼¥Ò¥ó¥È£Ã£Á£Ì£Ì¤·¤¿) && \
					(`@rp_¶¯À©£Ã£Á£Ì£Ì¤·¤Æ¤â¤¤¤¤¤è`) && \
					(!$f:rfp_w24b_ÌÖËì¥»¥ó¥µ¡¼¡²»à¤ó¤Ç¤ëÅ¨Ê¼¥À¥á£Ã£Á£Ì£Ì¤·¤¿) && \
					($w:p_story < d:ST:P039_01_P01¿Í¼ÁÉô²°ÀøÆþ£±¥Ý¥ê¥´¥ó¥Ç¥â£±³«»Ï) ){
						eval($f:rfp_w24b_ÌÖËì¥»¥ó¥µ¡¼¥Ò¥ó¥È£Ã£Á£Ì£Ì¤·¤¿ = 1)
						command ÌµÀþÀßÄê -call 14085 t:RPC_w24b_ÌÖËì¥»¥ó¥µ¡¼¥Ò¥ó¥È£Ã£Á£Ì£Ì \
							d:CODEC_CALL rp_w24b_ÌÖËì¥»¥ó¥µ¡¼¥Ò¥ó¥È£Ã£Á£Ì£Ì½ªÎ» 
			}
		}
		if($3 == ½Ð¤ë){
			if($f:rfp_w24b_ÌÖËì¥»¥ó¥µ¡¼¥Ò¥ó¥È£Ã£Á£Ì£Ì¤·¤¿){
				eval($f:rfp_w24b_ÌÖËì¥»¥ó¥µ¡¼¥Ò¥ó¥È£Ã£Á£Ì£Ì¤·¤¿ = 0)
			}
			eval($f:rfp_w24b_ÌÖËì¥»¥ó¥µ¡¼¡²¥é¥¤¥Ç¥ó¤¬¼«Ê¬¤ÇÇÁ¤­¤ä¤¬¤Ã¤¿¤Ö¤ê¤ó¤Á¤ç = 0)
		}

	}


proc rp_w24b_ÌÖËì¥»¥ó¥µ¡¼ÇÁ¤­¹þ¤ß»þÌµÀþ·Ï½èÍý¡²¥é¥¤¥Ç¥ó¤¬¼«Ê¬¤ÇÇÁ¤­¤ä¤¬¤Ã¤¿¤Ö¤ê¤ó¤Á¤ç {
	eval($f:rfp_w24b_ÌÖËì¥»¥ó¥µ¡¼¡²¥é¥¤¥Ç¥ó¤¬¼«Ê¬¤ÇÇÁ¤­¤ä¤¬¤Ã¤¿¤Ö¤ê¤ó¤Á¤ç = 1)
//	@rp_w24b_ÌÖËì¥»¥ó¥µ¡¼ÇÁ¤­¹þ¤ß¸åÌµÀþ·Ï½èÍý
}

proc rp_w24b_ÌÖËì¥»¥ó¥µ¡¼ÇÁ¤­¹þ¤ß¸åÌµÀþ·Ï½èÍý {
	if( ($f:rfp_w24b_ÌÖËì¥»¥ó¥µ¡¼¡²¥é¥¤¥Ç¥ó¤¬¼«Ê¬¤ÇÇÁ¤­¤ä¤¬¤Ã¤¿¤Ö¤ê¤ó¤Á¤ç) && \
			(!$f:rfp_w24b_ÌÖËì¥»¥ó¥µ¡¼¡²¥é¥¤¥Ç¥ó¤¬¼«Ê¬¤ÇÇÁ¤­¤ä¤¬¤Ã¤¿¤Ö¤ê¤ó¤Á¤ç£Ã£Á£Ì£Ì¤·¤¿) && \
			(`@rp_¶¯À©£Ã£Á£Ì£Ì¤·¤Æ¤â¤¤¤¤¤è`) ){
		command ÌµÀþÀßÄê -call 14085 t:RPC_w24b_ÌÖËì¥»¥ó¥µ¡¼¡²¥é¥¤¥Ç¥ó¤¬¼«Ê¬¤ÇÇÁ¤­¤ä¤¬¤Ã¤¿¤Ö¤ê¤ó¤Á¤ç£Ã£Á£Ì£Ì d:CODEC_CALL 
		eval($f:rfp_w24b_ÌÖËì¥»¥ó¥µ¡¼¡²¥é¥¤¥Ç¥ó¤¬¼«Ê¬¤ÇÇÁ¤­¤ä¤¬¤Ã¤¿¤Ö¤ê¤ó¤Á¤ç£Ã£Á£Ì£Ì¤·¤¿ = 1)
	}
	eval($f:rfp_w24b_ÌÖËì¥»¥ó¥µ¡¼¡²¥é¥¤¥Ç¥ó¤¬¼«Ê¬¤ÇÇÁ¤­¤ä¤¬¤Ã¤¿¤Ö¤ê¤ó¤Á¤ç = 0)
}

//eval($w:Éð´ïÃÆ¿ô£Ò[d:Éð´ï:¥Þ¥¤¥¯] = 1)

