/*
	w32_d_common.h
	    海上	デモ／ゲーム共通プロック

	2000/09/29 H.Yoshiike         
	$Id: w32_d_common.h,v 1.2 2001/08/02 04:34:20 usr03379 Exp $                      

	
*/



//###################################################################################
//									オブジェクト
//###################################################################################

	proc 海面設定 {
		#if d:DEBUG_PRINT
			print 'w32a_sea_set'
		#endif

		chara プラント海面 seaseasea \
			-tex oil s_oil_sea_alp_ovl_mod0022 s_oil_ref_add_alp_ovl_mod1120 \
			-w 2,2,6 \
			-l \
			-pos 52000,-40000,-210000
	}

	proc 空設定 {
		#if d:DEBUG_PRINT
			print 'w32a_sky_set'
		#endif

		@狙撃夕空（レンズフレア指定）	52000 -31000 -210000 -1000 -210 -4500 4
	}

	proc 浮き橋１ {
		chara 浮き橋 bridge_1 \
			-pos 57875,-40000,-206625 98125,-40000,-183375 \
			-n 10 \
			-model oilfence
	}

	proc 浮き橋２ {
		chara 浮き橋 bridge_2 \
			-p 104000,-40000,-173250 104000,-40000,-126750 \
			-n 10 \
			-model oilfence
	}
	proc 浮き橋３ {
		chara 浮き橋 bridge_3 \
			-p 98125,-40000,-116500 57875 -40000 -93250 \
			-n 10 \
			-model oilfence

	}



//###################################################################################
//									 エフェクト
//###################################################################################

	proc フォグ設定 {
		#if d:DEBUG_PRINT
			print 'fog_set'
		#endif

		chara フォグ 霧\
			-c 143,100,50 \
			-n -16000 \
			-f 250000
	}


