/**************************************************
		無線でぽいいん
**************************************************/

#include "cdc_common_p.h"
extern command ＮＰＣスネークのライフ
extern command ＮＰＣスネークの状態


@rp_大佐デフォルト無線セット
@rp_プリスキン＿デフォルト無線セット
@rp_ローズデフォルト無線セット
@rp_オタコン＿デフォルト無線セット

//eval($w:武器弾数Ｒ[6] = -1)
//eval($f:rfp_PS_リモコンミサイルの場所聞いた = 1)

/*
proc rp_スネーク状態監視太郎 {
	command ＮＰＣスネークの状態
	print 'どらばっとぼんＮＰＣスネークの状態:' $status
}

chara プロック連続実行  スネーク状態監視太郎 \
	-proc rp_スネーク状態監視太郎 \
	-time -1
*/

