/*
	w61a_common.h                     
	    ソリダス戦とデモで使用する共通プロック

	2001/07/31 H.Yoshiike         
	$Id: w61a_common.h,v 1.2 2001/09/19 02:18:49 usr03682 Exp $                      

	
*/

// 各proc設定
//-------------------------------------------------------------------------------------
// 全マップ共通
	// 遠景
	// ------------------------------------
	proc 遠景設定 {
		#if d:DEBUG_PRINT 
			print 'w61a_other_model_set'
		#endif

		chara プットオブジェ 遠景１ \
			-m d:KMS_NAME1 \
			-r 0,0,0 \
			-p 0,0,0 \
			-l d:LT2_NAME \
			-f 0x0010 \ 	//モデルオフセットのスケーリング
			-s 1000,1000,1000 
	}

	// 旗
	// ------------------------------------
	proc フェデラルホール旗設置 {
		#if d:DEBUG_PRINT 
			print 'w61a_flag_set'
		#endif
/* テロ事件に配慮し削除
		chara プット頂点アニメオブジェ 旗 \
			-m d:FLAG_NAME \
			-b 5 \
			-w 1 \
			-p 0,0,0
*/
		chara プットオブジェ ポール \
			-m d:POLE_NAME \
			-r 0,0,0 \
			-p 0,0,0 \
			-l d:LT2_NAME
	}






// FIXデータはここまで
// -----------------------------------------------------------------------------------


// 以下仮キャラ用proc
// -----------------------------------------------------------------------------------
// 仮キャラ
// ------------------------------------


// 以下デバッグ専用proc
// -----------------------------------------------------------------------------------
// デバッグキャラ
// ------------------------------------
proc デバッグキャラセット {
	#if d:DEBUG_PRINT
		print 'debug_chara_set'
	#endif

	#if d:SCREENSHOT
		chara スクリーンショット shot
	#endif
}
