/*
	plugin.h
	プラグインライブラリヘッダ

	2000/02/29 K.Takabe
	$Id: plugin.h,v 1.1.1.3 2002/11/19 11:42:19 Yoshizawa1 Exp $

*/

#ifndef __PLUGIN__H__
#define __PLUGIN__H__

#ifdef __cplusplus
extern "C" {
#endif


/*----------------------------------------------------------------*/
/* ＤＭＡパケット接続型オブジェクト */
#include "dmapack.h"
/*----------------------------------------------------------------*/
/* 曲面パッチオブジェクト */
#include "patch.h"
/*----------------------------------------------------------------*/

#ifdef __cplusplus
};
#endif

#endif	/* __PLUGIN__H__ */

